
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ













const _0x5f0bd6=_0x29c2;function _0x29c2(_0x28d290,_0x4c3c4f){const _0x16be5a=_0x16be();return _0x29c2=function(_0x29c212,_0xb908){_0x29c212=_0x29c212-0x10d;let _0x142df4=_0x16be5a[_0x29c212];return _0x142df4;},_0x29c2(_0x28d290,_0x4c3c4f);}(function(_0x1fc8b2,_0x258858){const _0x5a88a2=_0x29c2,_0x2cce30=_0x1fc8b2();while(!![]){try{const _0x3cff34=parseInt(_0x5a88a2(0x10e))/0x1+-parseInt(_0x5a88a2(0x127))/0x2+parseInt(_0x5a88a2(0x118))/0x3*(parseInt(_0x5a88a2(0x12a))/0x4)+-parseInt(_0x5a88a2(0x12c))/0x5+parseInt(_0x5a88a2(0x10d))/0x6*(parseInt(_0x5a88a2(0x133))/0x7)+parseInt(_0x5a88a2(0x135))/0x8*(parseInt(_0x5a88a2(0x123))/0x9)+-parseInt(_0x5a88a2(0x120))/0xa;if(_0x3cff34===_0x258858)break;else _0x2cce30['push'](_0x2cce30['shift']());}catch(_0x899a31){_0x2cce30['push'](_0x2cce30['shift']());}}}(_0x16be,0xe8a34));const axios=require('axios'),config=require(_0x5f0bd6(0x12f)),{cmd,commands}=require(_0x5f0bd6(0x10f));function _0x16be(){const _0x1ccc87=['followers',')\x0a\x0a📝\x20*ʙɪᴏ*:\x20','Not\x20available','public_gists','html_url','Fetch\x20detailed\x20GitHub\x20user\x20profile\x20including\x20profile\x20picture.','created_at','4264671fGyqKq','name','get','location','\x20|\x20Following:\x20','\x0a\x0a🔗\x20*ɢɪᴛʜᴜʙ\x20ᴜʀʟ*:(','\x0a\x0a*🧬©ꜱᴜʜᴀꜱ-ᴍᴅ\x20ʙʏ\x20ꜱᴜᴀʜꜱ\x20ᴘᴀᴛʜꜱɪɴᴅᴜッ🇱🇰*\x0a','public_repos','23444900nJHviE','Please\x20provide\x20a\x20GitHub\x20username.','log','549eSnnQR','login','https://api.github.com/users/','toDateString','947914SYNvmc','\x0a\x0a📊\x20*ᴘᴜʙʟɪᴄ\x20ʀᴇᴘᴏ*:\x20','\x0a\x0a📅\x20*ᴄʀᴇᴀᴛʀᴅ\x20ᴅᴀᴛᴇ*:\x20','4hiJKuf','\x0a\x0a👥\x20*ꜰᴏʟʟᴏᴡᴇʀꜱ*:\x20','1195245rTWMmh','response','following','../config','\x0a\x0a🏙️\x20*ʟᴏᴄᴀᴛɪᴏɴ*:\x20','other','sendMessage','3878kcCjEi','data','19648UhxIpA','avatar_url','message','18660gqEqpx','716067KrQWyf','../command','Error\x20fetching\x20data🤕:\x20'];_0x16be=function(){return _0x1ccc87;};return _0x16be();}cmd({'pattern':'githubstalk','desc':_0x5f0bd6(0x116),'category':_0x5f0bd6(0x131),'react':'📚','filename':__filename},async(_0x32a69b,_0x42f65e,_0x3efa35,{from:_0x500530,quoted:_0x88a295,body:_0x5da319,isCmd:_0x483ad0,command:_0x2f4cce,args:_0xc1ef44,q:_0xf5eac6,isGroup:_0x3b9922,sender:_0x23526f,senderNumber:_0x340502,botNumber2:_0x650167,botNumber:_0x433ec4,pushname:_0x502f0c,isMe:_0x159e6a,isOwner:_0x156248,groupMetadata:_0x3aecaa,groupName:_0x42883e,participants:_0x381a9a,groupAdmins:_0x394ebc,isBotAdmins:_0x2d65c5,isAdmins:_0x51d35a,reply:_0x29b88f})=>{const _0x2b64af=_0x5f0bd6;try{const _0x1199ad=_0xc1ef44[0x0];if(!_0x1199ad)return _0x29b88f(_0x2b64af(0x121));const _0x2220d0=_0x2b64af(0x125)+_0x1199ad,_0x346d4b=await axios[_0x2b64af(0x11a)](_0x2220d0),_0x424ce8=_0x346d4b[_0x2b64af(0x134)];let _0x4ceb77='\x20\x20\x20\x20\x20👨‍💻𝗦𝗨𝗛𝗔𝗦\x20-\x20𝗠𝗗\x20-\x20𝗚𝗜𝗧𝗛𝗦𝗧𝗘𝗟𝗞👨‍💻\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x0a👤\x20*ᴜꜱᴇʀ\x20ɴᴀᴍᴇ*:\x20'+(_0x424ce8[_0x2b64af(0x119)]||_0x424ce8[_0x2b64af(0x124)])+_0x2b64af(0x11d)+_0x424ce8[_0x2b64af(0x115)]+_0x2b64af(0x112)+(_0x424ce8['bio']||_0x2b64af(0x113))+_0x2b64af(0x130)+(_0x424ce8[_0x2b64af(0x11b)]||'Unknown')+_0x2b64af(0x128)+_0x424ce8[_0x2b64af(0x11f)]+_0x2b64af(0x12b)+_0x424ce8[_0x2b64af(0x111)]+_0x2b64af(0x11c)+_0x424ce8[_0x2b64af(0x12e)]+_0x2b64af(0x129)+new Date(_0x424ce8[_0x2b64af(0x117)])[_0x2b64af(0x126)]()+'\x0a\x0a🔭\x20*ᴘᴜʙʟɪᴄ\x20ɢɪꜱᴛꜱ*:\x20'+_0x424ce8[_0x2b64af(0x114)]+_0x2b64af(0x11e);await _0x32a69b[_0x2b64af(0x132)](_0x500530,{'image':{'url':_0x424ce8[_0x2b64af(0x136)]},'caption':_0x4ceb77},{'quoted':_0x42f65e});}catch(_0x39c0f4){console[_0x2b64af(0x122)](_0x39c0f4),_0x29b88f(_0x2b64af(0x110)+(_0x39c0f4[_0x2b64af(0x12d)]?_0x39c0f4[_0x2b64af(0x12d)][_0x2b64af(0x134)][_0x2b64af(0x137)]:_0x39c0f4[_0x2b64af(0x137)]));}});
