
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ















const _0x5b3c8d=_0x3c39;function _0x2279(){const _0x1d9f7e=['2887510BxKMzT','🧟‍♂','29409kUkvGr','2110464JqDfJj','log','*👋\x20Hello\x20','main','2779448FMyONo','../command','1734420KAwlNE','about','sendMessage','*\x0a\x0a\x20*I\x20am\x20Suhas\x20Pathsindu🙈*\x0a\x0a\x20*I\x20am\x2018\x20years\x20old\x20Boy🔞*\x0a\x0a\x20*I\x20am\x20from\x20Galle🏠*\x0a\x0a\x20*I\x20am\x20Simple\x20WhatsApp\x20Bot\x20Developer👨‍💻*\x0a\x0a\x0a\x20Thank\x20You.😊','6512eUpURU','7hIgdkU','About\x20For\x20Suhas.','716160TzcmPZ'];_0x2279=function(){return _0x1d9f7e;};return _0x2279();}(function(_0x5ed774,_0xe18c3d){const _0x5967f4=_0x3c39,_0x176a66=_0x5ed774();while(!![]){try{const _0x3c31c8=-parseInt(_0x5967f4(0x1b9))/0x1+-parseInt(_0x5967f4(0x1b6))/0x2+parseInt(_0x5967f4(0x1af))/0x3+-parseInt(_0x5967f4(0x1b3))/0x4+-parseInt(_0x5967f4(0x1b7))/0x5+parseInt(_0x5967f4(0x1a9))/0x6+parseInt(_0x5967f4(0x1b4))/0x7*(parseInt(_0x5967f4(0x1ad))/0x8);if(_0x3c31c8===_0xe18c3d)break;else _0x176a66['push'](_0x176a66['shift']());}catch(_0x84c816){_0x176a66['push'](_0x176a66['shift']());}}}(_0x2279,0x4bda8));function _0x3c39(_0x422324,_0x4d2c0a){const _0x22798b=_0x2279();return _0x3c39=function(_0x3c3980,_0x579e4f){_0x3c3980=_0x3c3980-0x1a9;let _0x182b30=_0x22798b[_0x3c3980];return _0x182b30;},_0x3c39(_0x422324,_0x4d2c0a);}const config=require('../config'),{cmd,commands}=require(_0x5b3c8d(0x1ae));cmd({'pattern':_0x5b3c8d(0x1b0),'desc':_0x5b3c8d(0x1b5),'category':_0x5b3c8d(0x1ac),'react':_0x5b3c8d(0x1b8),'filename':__filename},async(_0x1b6aa9,_0x4392b6,_0x1b4eec,{from:_0x1091a1,quoted:_0x304740,body:_0x3ef040,isCmd:_0x2fedcb,command:_0x118e4d,args:_0x58720f,q:_0x415cd2,isGroup:_0x2603f8,sender:_0x50d4e7,senderNumber:_0xf2bc3a,botNumber2:_0x3d9836,botNumber:_0x4e765d,pushname:_0x2efcd6,isMe:_0x44eeaa,isOwner:_0x2b9573,groupMetadata:_0x29b2f7,groupName:_0x10a777,participants:_0x4f64fe,groupAdmins:_0x5dc8bd,isBotAdmins:_0x3ea084,isAdmins:_0x170f4c,reply:_0x1d4348})=>{const _0x57db7d=_0x5b3c8d;try{let _0x5c792b=_0x57db7d(0x1ab)+_0x2efcd6+_0x57db7d(0x1b2);return await _0x1b6aa9[_0x57db7d(0x1b1)](_0x1091a1,{'image':{'url':config['ALIVE_IMG']},'caption':_0x5c792b},{'quoted':_0x4392b6});}catch(_0x37ff75){console[_0x57db7d(0x1aa)](_0x37ff75),_0x1d4348(''+_0x37ff75);}});
