
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ







const _0x2ec115=_0xe7a7;(function(_0x4c8eeb,_0x5e240c){const _0x5331f9=_0xe7a7,_0x276858=_0x4c8eeb();while(!![]){try{const _0x67c7f0=-parseInt(_0x5331f9(0x93))/0x1*(parseInt(_0x5331f9(0x9f))/0x2)+parseInt(_0x5331f9(0xa0))/0x3+parseInt(_0x5331f9(0x97))/0x4*(-parseInt(_0x5331f9(0x8b))/0x5)+parseInt(_0x5331f9(0x86))/0x6+parseInt(_0x5331f9(0x94))/0x7+parseInt(_0x5331f9(0x92))/0x8*(parseInt(_0x5331f9(0x99))/0x9)+-parseInt(_0x5331f9(0x88))/0xa*(parseInt(_0x5331f9(0x98))/0xb);if(_0x67c7f0===_0x5e240c)break;else _0x276858['push'](_0x276858['shift']());}catch(_0x21cc8c){_0x276858['push'](_0x276858['shift']());}}}(_0x3561,0x94d56));function _0xe7a7(_0x4fa7f7,_0xa78d9f){const _0x3561bd=_0x3561();return _0xe7a7=function(_0xe7a728,_0x524ae4){_0xe7a728=_0xe7a728-0x84;let _0x41165c=_0x3561bd[_0xe7a728];return _0x41165c;},_0xe7a7(_0x4fa7f7,_0xa78d9f);}const axios=require(_0x2ec115(0x8e)),{cmd}=require(_0x2ec115(0x8c));cmd({'pattern':_0x2ec115(0xa1),'desc':_0x2ec115(0x9a),'react':'⚡','category':'other','filename':__filename},async(_0x2fa4c8,_0x5294cc,_0x278818,{from:_0x27a60d,q:_0x535890,reply:_0x3d4e14})=>{const _0x2d7459=_0x2ec115;try{const _0x32818c=_0x535890[_0x2d7459(0x89)]('\x20');if(_0x32818c[_0x2d7459(0x9d)]<0x2)return _0x3d4e14(_0x2d7459(0x9e));const _0x165b7f=_0x32818c[0x0],_0x43ed68=_0x32818c['slice'](0x1)['join']('\x20'),_0x1226e4=_0x2d7459(0x8f)+encodeURIComponent(_0x43ed68)+_0x2d7459(0x85)+_0x165b7f,_0x545148=await axios[_0x2d7459(0x96)](_0x1226e4),_0x5506de=_0x545148[_0x2d7459(0x9b)][_0x2d7459(0x91)]['translatedText'],_0x37d7cc=_0x2d7459(0x84)+_0x43ed68+_0x2d7459(0x95)+_0x5506de+_0x2d7459(0x8d)+_0x165b7f[_0x2d7459(0x9c)]()+_0x2d7459(0x8a);return _0x3d4e14(_0x37d7cc);}catch(_0x1ef3a8){return console[_0x2d7459(0x87)](_0x1ef3a8),_0x3d4e14(_0x2d7459(0x90));}});function _0x3561(){const _0x56ccd2=['\x0a\x0a🔠\x20*Translated*:\x20','get','4LIspNZ','990qwgPlo','1233WiNgmM','🌍\x20Translate\x20text\x20between\x20languages','data','toUpperCase','length','❗\x20Please\x20provide\x20a\x20language\x20code\x20and\x20text.\x20Usage:\x20.translate\x20[language\x20code]\x20[text]','2cUUnDH','2644809tkOxqr','trt','\x0a🌍\x20*SUHAS-MD\x20Translation*\x20🌍\x0a\x0a🔤\x20*Original*:\x20','&langpair=en|','2225226ZSrKvs','log','123400fSOwUQ','split','\x0a\x0a*🧬©ꜱᴜʜᴀꜱ-ᴍᴅ\x20ʙʏ\x20ꜱᴜᴀʜꜱ\x20ᴘᴀᴛʜꜱɪɴᴅᴜッ🇱🇰*','5017715KvOtjF','../command','\x0a\x0a🌐\x20*Language*:\x20','axios','https://api.mymemory.translated.net/get?q=','⚠️\x20An\x20error\x20occurred\x20data\x20while\x20translating\x20the\x20your\x20text.\x20Please\x20try\x20again\x20later🤕','responseData','55760yRtrKc','238831bJoAcU','5286624DRCXbO'];_0x3561=function(){return _0x56ccd2;};return _0x3561();}
