
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ










function _0x2592(){const _0x27ac7c=['log','1266tLiQhn','9404EmdvHQ','\x0a📝\x20*Example*:\x20','8818523jjbcBo','axios','\x0a\x0a*🧬©ꜱᴜʜᴀꜱ-ᴍᴅ\x20ʙʏ\x20ꜱᴜᴀʜꜱ\x20ᴘᴀᴛʜꜱɪɴᴅᴜッ🇱🇰*','❗\x20Please\x20provide\x20a\x20word\x20to\x20define.\x20Usage:\x20.define\x20[word]','response','join','9689944MQvano','data','\x0a📚\x20*Word*:\x20','7687305LpdTUR','example','\x0a🔍\x20*Definition*:\x20','22645zSqQYy','meanings','42flecOl','definition','../command','915490fobilo','874630PdNVid','📚\x20Get\x20the\x20definition\x20of\x20a\x20word','status','🚫\x20Word\x20not\x20found.\x20Please\x20check\x20the\x20spelling\x20and\x20try\x20again.','word','get','\x0a🔗\x20*Synonyms*:\x20','⚠️\x20An\x20error\x20occurred\x20while\x20fetching\x20the\x20definition.\x20Please\x20try\x20again\x20later.','definitions','define','No\x20synonyms\x20available','No\x20example\x20available','other'];_0x2592=function(){return _0x27ac7c;};return _0x2592();}const _0xf4e641=_0x1be2;(function(_0xb532b6,_0x2ae1b8){const _0x351ace=_0x1be2,_0x107261=_0xb532b6();while(!![]){try{const _0x91bac3=parseInt(_0x351ace(0x125))/0x1+-parseInt(_0x351ace(0x124))/0x2+parseInt(_0x351ace(0x133))/0x3*(parseInt(_0x351ace(0x134))/0x4)+-parseInt(_0x351ace(0x11f))/0x5*(-parseInt(_0x351ace(0x121))/0x6)+parseInt(_0x351ace(0x113))/0x7+-parseInt(_0x351ace(0x119))/0x8+-parseInt(_0x351ace(0x11c))/0x9;if(_0x91bac3===_0x2ae1b8)break;else _0x107261['push'](_0x107261['shift']());}catch(_0x126286){_0x107261['push'](_0x107261['shift']());}}}(_0x2592,0x9b0e7));function _0x1be2(_0x11b370,_0xc9c7f8){const _0x25921e=_0x2592();return _0x1be2=function(_0x1be263,_0x8f5da0){_0x1be263=_0x1be263-0x113;let _0x29ec4a=_0x25921e[_0x1be263];return _0x29ec4a;},_0x1be2(_0x11b370,_0xc9c7f8);}const axios=require(_0xf4e641(0x114)),{cmd}=require(_0xf4e641(0x123));cmd({'pattern':_0xf4e641(0x12e),'desc':_0xf4e641(0x126),'react':'🔍','category':_0xf4e641(0x131),'filename':__filename},async(_0x5cbfee,_0x438f9,_0x47a67d,{from:_0x14693d,q:_0x5a758f,reply:_0xe3d4})=>{const _0x2deb72=_0xf4e641;try{if(!_0x5a758f)return _0xe3d4(_0x2deb72(0x116));const _0x4ce853=_0x5a758f,_0x4d3c92='https://api.dictionaryapi.dev/api/v2/entries/en/'+_0x4ce853,_0x5a64ee=await axios[_0x2deb72(0x12a)](_0x4d3c92),_0x271ffb=_0x5a64ee[_0x2deb72(0x11a)][0x0],_0x52c627=_0x271ffb['meanings'][0x0][_0x2deb72(0x12d)][0x0][_0x2deb72(0x122)],_0x440cae=_0x271ffb[_0x2deb72(0x120)][0x0]['definitions'][0x0][_0x2deb72(0x11d)]||_0x2deb72(0x130),_0x49f107=_0x271ffb['meanings'][0x0][_0x2deb72(0x12d)][0x0]['synonyms'][_0x2deb72(0x118)](',\x20')||_0x2deb72(0x12f),_0x284a35=_0x2deb72(0x11b)+_0x271ffb[_0x2deb72(0x129)]+_0x2deb72(0x11e)+_0x52c627+_0x2deb72(0x135)+_0x440cae+_0x2deb72(0x12b)+_0x49f107+_0x2deb72(0x115);return _0xe3d4(_0x284a35);}catch(_0x31a1ec){console[_0x2deb72(0x132)](_0x31a1ec);if(_0x31a1ec[_0x2deb72(0x117)]&&_0x31a1ec[_0x2deb72(0x117)][_0x2deb72(0x127)]===0x194)return _0xe3d4(_0x2deb72(0x128));return _0xe3d4(_0x2deb72(0x12c));}});
