
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ








const _0x49f7e5=_0x83d5;(function(_0x3f9ed7,_0x483acb){const _0x5c6013=_0x83d5,_0x3bbe74=_0x3f9ed7();while(!![]){try{const _0x28f54e=-parseInt(_0x5c6013(0x11e))/0x1+-parseInt(_0x5c6013(0x117))/0x2*(-parseInt(_0x5c6013(0x12e))/0x3)+-parseInt(_0x5c6013(0x118))/0x4*(-parseInt(_0x5c6013(0x126))/0x5)+-parseInt(_0x5c6013(0x12c))/0x6+parseInt(_0x5c6013(0x127))/0x7*(-parseInt(_0x5c6013(0x12f))/0x8)+parseInt(_0x5c6013(0x120))/0x9+parseInt(_0x5c6013(0x12b))/0xa;if(_0x28f54e===_0x483acb)break;else _0x3bbe74['push'](_0x3bbe74['shift']());}catch(_0x2655ae){_0x3bbe74['push'](_0x3bbe74['shift']());}}}(_0x2ae6,0x1efa0));function _0x2ae6(){const _0x401202=['guts','12840SUciIc','10552oTqGcW','elisa','log','https://api.waifu.pics/sfw/waifu','snloy','../command','100AzxpJO','12lEWbTa','sendMessage','data','waifu','levi','spiky','251263SxIBXe','neko','1966257kzfCUX','recat','haifu','🧙‍♂️\x20*SUHAS-MD\x20Random\x20Anime\x20Images*\x20🧙‍♂️\x0a\x0a\x0a\x20*🧬©ꜱᴜʜᴀꜱ-ᴍᴅ\x20ʙʏ\x20ꜱᴜᴀʜꜱ\x20ᴘᴀᴛʜꜱɪɴᴅᴜッ🇱🇰*','url','get','204870zyfPQN','931WEVBbc','message','blacky','loli','1044740uqNMSU','637794jIkuEt'];_0x2ae6=function(){return _0x401202;};return _0x2ae6();}function _0x83d5(_0x3bf3c0,_0x112ebb){const _0x2ae60a=_0x2ae6();return _0x83d5=function(_0x83d5bb,_0xe8fef7){_0x83d5bb=_0x83d5bb-0x115;let _0x320f6f=_0x2ae60a[_0x83d5bb];return _0x320f6f;},_0x83d5(_0x3bf3c0,_0x112ebb);}const axios=require('axios'),{cmd,commands}=require(_0x49f7e5(0x116));cmd({'pattern':_0x49f7e5(0x12a),'alias':[_0x49f7e5(0x11f),'maid',_0x49f7e5(0x121),'awoo',_0x49f7e5(0x11b),_0x49f7e5(0x11c),_0x49f7e5(0x12d),'goku','chooty',_0x49f7e5(0x11d),_0x49f7e5(0x130),_0x49f7e5(0x129),'soow',_0x49f7e5(0x115),_0x49f7e5(0x122)],'desc':'Fetch\x20a\x20random\x20anime\x20girl\x20image.','category':'fun','react':'🧙‍♂️','filename':__filename},async(_0x154b95,_0x202888,_0x58eadf,{from:_0x730160,quoted:_0x393090,body:_0xaf0a63,isCmd:_0x5b851a,command:_0x380b0e,args:_0x4e4b88,q:_0x562f63,isGroup:_0x39586b,sender:_0xec464d,senderNumber:_0x490f7b,botNumber2:_0x1d65bf,botNumber:_0x2d9b92,pushname:_0x3e0abf,isMe:_0x5e2bec,isOwner:_0x40b1a7,groupMetadata:_0x4dbe42,groupName:_0x4193f4,participants:_0x3956d5,groupAdmins:_0x4939c4,isBotAdmins:_0x3b8ad1,isAdmins:_0x5a71df,reply:_0x461379})=>{const _0x3e3ca6=_0x49f7e5;try{const _0x2de23a=_0x3e3ca6(0x132),_0x55faee=await axios[_0x3e3ca6(0x125)](_0x2de23a),_0x255a56=_0x55faee[_0x3e3ca6(0x11a)];await _0x154b95[_0x3e3ca6(0x119)](_0x730160,{'image':{'url':_0x255a56[_0x3e3ca6(0x124)]},'caption':_0x3e3ca6(0x123)},{'quoted':_0x202888});}catch(_0xeeccb7){console[_0x3e3ca6(0x131)](_0xeeccb7),_0x461379('*Error\x20Fetching\x20Anime\x20Girl\x20image*:\x20'+_0xeeccb7[_0x3e3ca6(0x128)]);}});
