
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ







function _0xde86(_0xc2d3d,_0x22bc93){const _0x4469ca=_0x4469();return _0xde86=function(_0xde86f2,_0x4cfe7c){_0xde86f2=_0xde86f2-0xe8;let _0x5ecc6c=_0x4469ca[_0xde86f2];return _0x5ecc6c;},_0xde86(_0xc2d3d,_0x22bc93);}const _0x1d8336=_0xde86;(function(_0x53c4bd,_0x1d41ed){const _0x413097=_0xde86,_0x5c1d7f=_0x53c4bd();while(!![]){try{const _0x2c9e37=parseInt(_0x413097(0xfd))/0x1*(-parseInt(_0x413097(0xf9))/0x2)+-parseInt(_0x413097(0xf6))/0x3+parseInt(_0x413097(0xfc))/0x4*(parseInt(_0x413097(0xf2))/0x5)+-parseInt(_0x413097(0xf0))/0x6+-parseInt(_0x413097(0xe8))/0x7+-parseInt(_0x413097(0xf8))/0x8*(parseInt(_0x413097(0xea))/0x9)+parseInt(_0x413097(0xec))/0xa;if(_0x2c9e37===_0x1d41ed)break;else _0x5c1d7f['push'](_0x5c1d7f['shift']());}catch(_0x3f4166){_0x5c1d7f['push'](_0x5c1d7f['shift']());}}}(_0x4469,0xddff8));function _0x4469(){const _0x6e383a=['../command','group','6499500dKPeMC','mute\x20group.','170615vKwboo','groupSettingUpdate','sendMessage','mute','2574732XZwJKm','*Please\x20give\x20me\x20a\x20Addmin\x20SUHAS-MD\x20❗👻*','357360SfGYSl','8aJpknz','onlygroup','key','76DrfrJS','440669WmQPqB','chat','log','*Group\x20chat\x20muted*\x20🔒','5768392VLIcQO','../config','36Lfupxi','needbotadmins','49678730BmcJuh','announcement'];_0x4469=function(){return _0x6e383a;};return _0x4469();}const config=require(_0x1d8336(0xe9)),{cmd,commands}=require(_0x1d8336(0xee));cmd({'pattern':_0x1d8336(0xf5),'alias':['lock'],'react':'🔒','desc':_0x1d8336(0xf1),'category':_0x1d8336(0xef),'filename':__filename},async(_0xcf239d,_0x28fb7a,_0x10d3fb,{from:_0x4780d9,l:_0x41df75,quoted:_0x5eb17c,body:_0x1f70bb,isCmd:_0x61ada2,command:_0xdb1701,args:_0x264b8a,q:_0x40c1bc,isGroup:_0x1e90f5,sender:_0x38ea39,senderNumber:_0x2168ec,botNumber2:_0x5a84f4,botNumber:_0x58da35,pushname:_0x42db0b,isMe:_0x5d45f6,isOwner:_0x4aaff3,groupMetadata:_0x4e0386,groupName:_0x3993d0,participants:_0x1531eb,isItzcp:_0x4791db,groupAdmins:_0x4ae764,isBotAdmins:_0x45f7b7,isAdmins:_0x18774a,reply:_0x37a809})=>{const _0x317d83=_0x1d8336;try{if(!_0x4aaff3||!_0x18774a)return;if(!_0x10d3fb['isGroup'])return _0x37a809(mg[_0x317d83(0xfa)]);if(!_0x45f7b7)return _0x37a809(mg[_0x317d83(0xeb)]);await _0xcf239d[_0x317d83(0xf3)](_0x10d3fb[_0x317d83(0xfe)],_0x317d83(0xed));const _0x46d4bd=await _0xcf239d['sendMessage'](_0x10d3fb[_0x317d83(0xfe)],{'text':_0x317d83(0x100)},{'quoted':_0x28fb7a});return await _0xcf239d[_0x317d83(0xf4)](_0x10d3fb[_0x317d83(0xfe)],{'react':{'text':'🔒','key':_0x46d4bd[_0x317d83(0xfb)]}});}catch(_0x361821){console[_0x317d83(0xff)](_0x361821),_0x37a809(_0x317d83(0xf7));}});
