
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ










const _0x10a531=_0x2c21;(function(_0x3ac92c,_0x2bb87a){const _0xb986a9=_0x2c21,_0x336e45=_0x3ac92c();while(!![]){try{const _0x285561=parseInt(_0xb986a9(0xdb))/0x1+parseInt(_0xb986a9(0xd8))/0x2+-parseInt(_0xb986a9(0xdf))/0x3+-parseInt(_0xb986a9(0xda))/0x4*(parseInt(_0xb986a9(0xdc))/0x5)+-parseInt(_0xb986a9(0xd3))/0x6+parseInt(_0xb986a9(0xd7))/0x7+parseInt(_0xb986a9(0xe3))/0x8;if(_0x285561===_0x2bb87a)break;else _0x336e45['push'](_0x336e45['shift']());}catch(_0x368299){_0x336e45['push'](_0x336e45['shift']());}}}(_0x1afd,0x57456));function _0x2c21(_0x4756a2,_0x40baa0){const _0x1afd84=_0x1afd();return _0x2c21=function(_0x2c2150,_0x5154ca){_0x2c2150=_0x2c2150-0xd1;let _0x111a09=_0x1afd84[_0x2c2150];return _0x111a09;},_0x2c21(_0x4756a2,_0x40baa0);}const axios=require('axios'),{cmd,commands}=require('../command');function _0x1afd(){const _0x1cdf71=['291280EervKC','485270YoUeVJ','get','animegirl3','750309rKkYmt','data','log','animegirl4','118824fddwoU','fun','animegirl5','Fetch\x20a\x20random\x20anime\x20girl\x20image.','animegirl','2519442fwVade','url','sendMessage','animegirl1','3526999yojhuh','629072RmIJgt','https://api.waifu.pics/sfw/waifu','4cfAHaD'];_0x1afd=function(){return _0x1cdf71;};return _0x1afd();}cmd({'pattern':_0x10a531(0xd2),'alias':[_0x10a531(0xd6),'animegirl2',_0x10a531(0xde),_0x10a531(0xe2),_0x10a531(0xe5)],'desc':_0x10a531(0xd1),'category':_0x10a531(0xe4),'react':'👧','filename':__filename},async(_0x1dfe41,_0x1bed69,_0x8dde26,{from:_0x4aa260,quoted:_0x48756a,body:_0x54a0a4,isCmd:_0x2a0487,command:_0x5a2e06,args:_0x49ac25,q:_0x2aede5,isGroup:_0x1eebef,sender:_0x2dd078,senderNumber:_0x15d01a,botNumber2:_0x34d74e,botNumber:_0xc492f7,pushname:_0x3ac067,isMe:_0x46035a,isOwner:_0x4b92ad,groupMetadata:_0x2c16e2,groupName:_0x1165af,participants:_0x29377b,groupAdmins:_0x3cc5fd,isBotAdmins:_0x263732,isAdmins:_0x3cf4c4,reply:_0x5d2122})=>{const _0x1b9402=_0x10a531;try{const _0x499ba5=_0x1b9402(0xd9),_0xc7474a=await axios[_0x1b9402(0xdd)](_0x499ba5),_0x5bb4b7=_0xc7474a[_0x1b9402(0xe0)];await _0x1dfe41[_0x1b9402(0xd5)](_0x4aa260,{'image':{'url':_0x5bb4b7[_0x1b9402(0xd4)]},'caption':'👸\x20*SUHAS-MD\x20Random\x20Anime\x20Girl\x20Images*\x20👸\x0a\x0a\x0a\x20*🧬©ꜱᴜʜᴀꜱ-ᴍᴅ\x20ʙʏ\x20ꜱᴜᴀʜꜱ\x20ᴘᴀᴛʜꜱɪɴᴅᴜッ🇱🇰*'},{'quoted':_0x1bed69});}catch(_0x51e800){console[_0x1b9402(0xe1)](_0x51e800),_0x5d2122('*Error\x20Fetching\x20Anime\x20Girl\x20image*:\x20'+_0x51e800['message']);}});
