
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ










const _0x429279=_0x197d;function _0x197d(_0x51016d,_0x421716){const _0x554306=_0x5543();return _0x197d=function(_0x197d98,_0x4d8522){_0x197d98=_0x197d98-0xb1;let _0x45a4aa=_0x554306[_0x197d98];return _0x45a4aa;},_0x197d(_0x51016d,_0x421716);}(function(_0x82110e,_0x33c893){const _0x39be6f=_0x197d,_0x3932f1=_0x82110e();while(!![]){try{const _0x3cfdb9=-parseInt(_0x39be6f(0xbd))/0x1+parseInt(_0x39be6f(0xbb))/0x2*(-parseInt(_0x39be6f(0xb7))/0x3)+-parseInt(_0x39be6f(0xc1))/0x4+-parseInt(_0x39be6f(0xba))/0x5*(-parseInt(_0x39be6f(0xb3))/0x6)+-parseInt(_0x39be6f(0xbe))/0x7*(-parseInt(_0x39be6f(0xb8))/0x8)+parseInt(_0x39be6f(0xb9))/0x9+parseInt(_0x39be6f(0xb2))/0xa*(parseInt(_0x39be6f(0xb5))/0xb);if(_0x3cfdb9===_0x33c893)break;else _0x3932f1['push'](_0x3932f1['shift']());}catch(_0x3e6015){_0x3932f1['push'](_0x3932f1['shift']());}}}(_0x5543,0x4f427));function _0x5543(){const _0xd75544=['77ODuKXe','../config','data','2238608vXbShM','main','3809290KgRDDz','30UCrhXu','https://chatgptforprabath-md.vercel.app/api/gptv1?q=','11oBTPqS','../command','6rpxtik','119032oqJsaO','3995919rpGkhG','299405LWPoJi','123198OCPBoQ','log','280497vjXWUQ'];_0x5543=function(){return _0xd75544;};return _0x5543();}const config=require(_0x429279(0xbf)),{cmd,commands}=require(_0x429279(0xb6)),{fetchJson}=require('../lib/functions');cmd({'pattern':'ai','desc':'ai','category':_0x429279(0xb1),'react':'🧠','filename':__filename},async(_0x1486f8,_0x7edcdf,_0x25f7ed,{from:_0x4e1a01,quoted:_0x3cdb7d,body:_0x3aaa5b,isCmd:_0x2f9638,command:_0x57d2d7,args:_0x21da3a,q:_0x588f49,isGroup:_0x320a79,sender:_0x535fce,senderNumber:_0x3cd3b5,botNumber2:_0x49a04e,botNumber:_0x3c7844,pushname:_0x4e5d33,isMe:_0x246a36,isOwner:_0x26224e,groupMetadata:_0x21a8f3,groupName:_0x58cc21,participants:_0x200ad0,groupAdmins:_0x17c7d1,isBotAdmins:_0x13c5a7,isAdmins:_0x45b44b,reply:_0x5a1c42})=>{const _0x2253c4=_0x429279;try{let _0x35702e=await fetchJson(_0x2253c4(0xb4)+_0x588f49);_0x5a1c42(''+_0x35702e[_0x2253c4(0xc0)]);}catch(_0x19cd1f){console[_0x2253c4(0xbc)](_0x19cd1f),_0x5a1c42(''+_0x19cd1f);}});
