
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ







const _0x1c62b1=_0x2583;(function(_0x26ca4d,_0x22a12b){const _0x1e25e9=_0x2583,_0x1813e3=_0x26ca4d();while(!![]){try{const _0x42b6df=parseInt(_0x1e25e9(0x18a))/0x1*(-parseInt(_0x1e25e9(0x184))/0x2)+parseInt(_0x1e25e9(0x187))/0x3+-parseInt(_0x1e25e9(0x18c))/0x4*(-parseInt(_0x1e25e9(0x186))/0x5)+parseInt(_0x1e25e9(0x17e))/0x6*(parseInt(_0x1e25e9(0x17d))/0x7)+-parseInt(_0x1e25e9(0x17f))/0x8*(-parseInt(_0x1e25e9(0x181))/0x9)+-parseInt(_0x1e25e9(0x189))/0xa+-parseInt(_0x1e25e9(0x17b))/0xb*(-parseInt(_0x1e25e9(0x18b))/0xc);if(_0x42b6df===_0x22a12b)break;else _0x1813e3['push'](_0x1813e3['shift']());}catch(_0x534b43){_0x1813e3['push'](_0x1813e3['shift']());}}}(_0x1d20,0x5f931));function _0x2583(_0x3849c9,_0x355f5b){const _0x1d20bb=_0x1d20();return _0x2583=function(_0x2583e1,_0x374862){_0x2583e1=_0x2583e1-0x17b;let _0x205e53=_0x1d20bb[_0x2583e1];return _0x205e53;},_0x2583(_0x3849c9,_0x355f5b);}function _0x1d20(){const _0x2096e4=['601384jucHkG','11XWnLBP','main','7nNraEW','1641858qsWWqY','544216CDIuEJ','log','54GIZLGA','../command','*⚡𝐒𝐔𝐇𝐀𝐒-𝐌𝐃⚡*\x0a\x0a>\x20*🌍𝗢𝗪𝗡𝗘𝗥\x20𝗜𝗡𝗙𝗢*\x20\x0a\x0a*⚡ᴏᴡɴᴇʀ\x20ɴᴀᴍᴇ*\x20-:\x20*ꜱᴜʜᴀꜱ\x20ᴘᴀᴛʜꜱɪɴᴅᴜ\x20(ꜱᴜʜᴀꜱ\x20ʙʀᴏ)*\x0a*⚡ɴᴜᴍʙᴇʀ*\x20-:\x2094774132871\x0a*⚡ʏᴏᴜᴛᴜʙᴇ*\x20-:\x20https://youtube.com/@suhasbro\x0a*⚡ᴡʜᴀᴛꜱᴀᴘᴘ\x20ᴄʜᴀɴɴᴇʟ*\x20-:\x20https://whatsapp.com/channel/0029VagKNUe96H4IdMbr9f2o\x0a\x0a*©ꜱᴜʜᴀꜱ-ᴍᴅ\x20ʙʏ\x20ꜱᴜʜᴀꜱ\x20ʙʀᴏッ🇱🇰*\x0a','46JYnCNa','owner','20FNXcOl','957732zyiaEq','sendMessage','6266790DPSryX','29644sceinQ','1170372iBtKje'];_0x1d20=function(){return _0x2096e4;};return _0x1d20();}const {cmd,commands}=require(_0x1c62b1(0x182));cmd({'pattern':_0x1c62b1(0x185),'desc':'owner\x20the\x20bot','category':_0x1c62b1(0x17c),'react':'👨‍💻','filename':__filename},async(_0xe33509,_0x3f14c8,_0x3072b1,{from:_0x489b71,quoted:_0x6d077e,body:_0x40d336,isCmd:_0xb2ebd5,command:_0x1517dc,args:_0x278678,q:_0x2a804d,isGroup:_0x29e6c1,sender:_0x101ec0,senderNumber:_0x437574,botNumber2:_0x4d21eb,botNumber:_0x360058,pushname:_0x22eb0e,isMe:_0x16887d,isOwner:_0x4ff952,groupMetadata:_0x52d256,groupName:_0xc786f4,participants:_0xf69cb4,groupAdmins:_0x67ae1,isBotAdmins:_0x39d239,isAdmins:_0x49db09,reply:_0x196c20})=>{const _0x2ae10d=_0x1c62b1;try{let _0x5ebf80=_0x2ae10d(0x183);await _0xe33509[_0x2ae10d(0x188)](_0x489b71,{'image':{'url':'https://telegra.ph/file/4a8fe45cb863594e1f1c1.jpg'},'caption':_0x5ebf80},{'quoted':_0x3f14c8});}catch(_0x491ffe){console[_0x2ae10d(0x180)](_0x491ffe),_0x196c20(''+_0x491ffe);}});
