
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ













const _0x475cbb=_0x4c20;(function(_0x4f1bac,_0x26afb6){const _0x290d47=_0x4c20,_0x2efc9a=_0x4f1bac();while(!![]){try{const _0x122d25=-parseInt(_0x290d47(0x1bd))/0x1+parseInt(_0x290d47(0x1b8))/0x2+-parseInt(_0x290d47(0x1b3))/0x3*(parseInt(_0x290d47(0x1b9))/0x4)+parseInt(_0x290d47(0x1c4))/0x5*(-parseInt(_0x290d47(0x1c3))/0x6)+parseInt(_0x290d47(0x1b4))/0x7*(parseInt(_0x290d47(0x1c2))/0x8)+-parseInt(_0x290d47(0x1bf))/0x9*(-parseInt(_0x290d47(0x1bb))/0xa)+parseInt(_0x290d47(0x1b5))/0xb;if(_0x122d25===_0x26afb6)break;else _0x2efc9a['push'](_0x2efc9a['shift']());}catch(_0x498e9f){_0x2efc9a['push'](_0x2efc9a['shift']());}}}(_0x32de,0x34a52));const axios=require('axios'),{cmd}=require(_0x475cbb(0x1c0));function _0x4c20(_0x4ed6bd,_0x514544){const _0x32debd=_0x32de();return _0x4c20=function(_0x4c20e7,_0x2a18a1){_0x4c20e7=_0x4c20e7-0x1b2;let _0x38f1ad=_0x32debd[_0x4c20e7];return _0x38f1ad;},_0x4c20(_0x4ed6bd,_0x514544);}function _0x32de(){const _0x280a67=['646464EewexI','239540NVfGZH','fun','9510iWGROI','https://uselessfacts.jsph.pl/random.json?language=en','376206wvvFsY','\x0a👾\x20*ꜱᴜʜᴀꜱ-ᴍᴅ\x20ʀᴀɴᴅᴏᴍ\x20ꜰᴜɴ\x20ꜰᴀᴄᴛ*\x20👾\x0a\x0a','3771fJcSEQ','../command','text','184VqcaQY','2130zLrrGl','1765AypwCf','data','6bnVJkl','18872dZQhJk','585376pPIqkW','\x0a\x0aIsn\x27t\x20that\x20interesting?\x20😄\x0a','🧠\x20Get\x20a\x20random\x20fun\x20fact'];_0x32de=function(){return _0x280a67;};return _0x32de();}cmd({'pattern':'fact','desc':_0x475cbb(0x1b7),'react':'😝','category':_0x475cbb(0x1ba),'filename':__filename},async(_0xbf4fcb,_0x1d2c1e,_0x55a5f7,{from:_0x331500,q:_0x4a08a8,reply:_0x31d1f9})=>{const _0x1e7990=_0x475cbb;try{const _0x2eaa51=_0x1e7990(0x1bc),_0x4ccc62=await axios['get'](_0x2eaa51),_0x50b8d6=_0x4ccc62[_0x1e7990(0x1b2)][_0x1e7990(0x1c1)],_0x9344d=_0x1e7990(0x1be)+_0x50b8d6+_0x1e7990(0x1b6);return _0x31d1f9(_0x9344d);}catch(_0x47c5f5){return console['log'](_0x47c5f5),_0x31d1f9('⚠️\x20An\x20error\x20occurred\x20while\x20fetching\x20a\x20fun\x20fact.\x20Please\x20try\x20again\x20later🤕.');}});
