
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ










function _0xd67b(){const _0x3584fa=['1131564kQCxXJ','../config','sendMessage','656868nyTpng','*Hey...👋\x20I\x20am\x20Suhas\x20Pathsindu.*\x0a\x0a\x20*SUHAS-MD\x20Is\x20Online\x20Now*\x20👊\x0a\x0a*🌀\x20Owner*\x20-\x20SUHAS-MD\x0a\x0a*💫\x20Owner\x20Number*\x2094774132871\x0a\x0a*Very\x20Simple\x20WhatsApp\x20Bot🤖\x0a\x0a_Type\x20To\x20*.menu*\x20Get\x20Commands👾_\x0a\x0a*🧬\x20Don\x27t\x20Forget\x20To\x20Subscibe\x20My\x20YouTube\x20Channel*\x0a\x0awww.youtube.com/@suhasbro\x0a\x0a*🧬\x20Follow\x20Your\x20WhatsApp\x20Channel*\x20https://www.whatsapp.com/channel/0029VagKNUe96H4IdMbr9f2o\x0a\x0a\x0a_🔮MADE\x20BY\x20SUHAS-BRO🔮_','756050cnUchY','7pHzhsT','412218EFjCVX','6628fAIyhY','143125IweGld','Check\x20bot\x20online\x20or\x20no.','40atpIKT','121qpSNfX','5312568xltHRG','../command','1830nhIGHs','ALIVE_IMG','20hsLlKu'];_0xd67b=function(){return _0x3584fa;};return _0xd67b();}function _0x5857(_0x4e46e0,_0x4458ec){const _0xd67b8b=_0xd67b();return _0x5857=function(_0x585744,_0x9ba06e){_0x585744=_0x585744-0x65;let _0xd4b0ad=_0xd67b8b[_0x585744];return _0xd4b0ad;},_0x5857(_0x4e46e0,_0x4458ec);}const _0x428fbc=_0x5857;(function(_0x3fbd6c,_0x37521c){const _0x5f2e3b=_0x5857,_0x427d7c=_0x3fbd6c();while(!![]){try{const _0x4de477=-parseInt(_0x5f2e3b(0x6c))/0x1+parseInt(_0x5f2e3b(0x68))/0x2+-parseInt(_0x5f2e3b(0x72))/0x3*(-parseInt(_0x5f2e3b(0x6b))/0x4)+parseInt(_0x5f2e3b(0x6e))/0x5*(parseInt(_0x5f2e3b(0x66))/0x6)+parseInt(_0x5f2e3b(0x69))/0x7*(-parseInt(_0x5f2e3b(0x70))/0x8)+parseInt(_0x5f2e3b(0x6a))/0x9*(parseInt(_0x5f2e3b(0x74))/0xa)+parseInt(_0x5f2e3b(0x6f))/0xb*(-parseInt(_0x5f2e3b(0x75))/0xc);if(_0x4de477===_0x37521c)break;else _0x427d7c['push'](_0x427d7c['shift']());}catch(_0x4ac075){_0x427d7c['push'](_0x427d7c['shift']());}}}(_0xd67b,0x7cf10));const config=require(_0x428fbc(0x76)),{cmd,commands}=require(_0x428fbc(0x71));cmd({'pattern':'alive','desc':_0x428fbc(0x6d),'category':'main','filename':__filename},async(_0x4bf65a,_0x10bb87,_0x1001fa,{from:_0x321049,quoted:_0x62bc04,body:_0x21baaa,isCmd:_0x24f504,command:_0x1ff7bb,args:_0x18bcd9,q:_0x4d3ada,isGroup:_0x2320b7,sender:_0x528245,senderNumber:_0x34ad10,botNumber2:_0x36be60,botNumber:_0x4f20eb,pushname:_0x404108,isMe:_0x58b61f,isOwner:_0x35e452,groupMetadata:_0x487bcd,groupName:_0x5b1dbc,participants:_0x365cf5,groupAdmins:_0x122c77,isBotAdmins:_0x2052c4,isAdmins:_0x5177f1,reply:_0x289539})=>{const _0x4fad5d=_0x428fbc;try{let _0x18dd72=_0x4fad5d(0x67);return await _0x4bf65a[_0x4fad5d(0x65)](_0x321049,{'image':{'url':config[_0x4fad5d(0x73)]},'caption':_0x18dd72},{'quoted':_0x10bb87});}catch(_0x6e4f11){console['log'](_0x6e4f11),_0x289539(''+_0x6e4f11);}});
