
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ








const _0x4ebbd8=_0x52a0;(function(_0x5930be,_0x149fb3){const _0x59aa2e=_0x52a0,_0x18f277=_0x5930be();while(!![]){try{const _0x4440a5=parseInt(_0x59aa2e(0x11c))/0x1+-parseInt(_0x59aa2e(0x118))/0x2*(parseInt(_0x59aa2e(0x11e))/0x3)+parseInt(_0x59aa2e(0x112))/0x4*(parseInt(_0x59aa2e(0x113))/0x5)+parseInt(_0x59aa2e(0x10d))/0x6*(-parseInt(_0x59aa2e(0x115))/0x7)+parseInt(_0x59aa2e(0x10b))/0x8*(-parseInt(_0x59aa2e(0x10e))/0x9)+-parseInt(_0x59aa2e(0x111))/0xa*(-parseInt(_0x59aa2e(0x10a))/0xb)+parseInt(_0x59aa2e(0x10f))/0xc*(parseInt(_0x59aa2e(0x117))/0xd);if(_0x4440a5===_0x149fb3)break;else _0x18f277['push'](_0x18f277['shift']());}catch(_0x2bf1d1){_0x18f277['push'](_0x18f277['shift']());}}}(_0x2e6c,0xa0aba));const config=require('../config'),{cmd,commands}=require(_0x4ebbd8(0x116));function _0x52a0(_0x28b7ef,_0x147d78){const _0x2e6c5a=_0x2e6c();return _0x52a0=function(_0x52a0ce,_0x563382){_0x52a0ce=_0x52a0ce-0x106;let _0x595625=_0x2e6c5a[_0x52a0ce];return _0x595625;},_0x52a0(_0x28b7ef,_0x147d78);}function _0x2e6c(){const _0x4dd7d2=['sendMessage','not_announcement','779479lzZvMB','groupSettingUpdate','148377HPPYZP','*Group\x20chat\x20unmuted*\x20🔊','onlygroup','log','group','isGroup','chat','unlock','3082046gxKtHq','35480dAtmPF','key','1138998kooYFx','1035zfYHOU','12mwALTo','unmute','30bVnpYc','3412YRDPVc','1565lUzpKf','*Please\x20give\x20me\x20a\x20Addmin\x20SUHAS-MD\x20❗👻*','28RQrZnf','../command','4383483vSHUFD','12AcHFst','mute\x20group.'];_0x2e6c=function(){return _0x4dd7d2;};return _0x2e6c();}cmd({'pattern':_0x4ebbd8(0x110),'alias':[_0x4ebbd8(0x109)],'react':'🔊','desc':_0x4ebbd8(0x119),'category':_0x4ebbd8(0x106),'filename':__filename},async(_0x5b84bb,_0x5b1739,_0x38fcd3,{from:_0x1b2d03,l:_0x3a5476,quoted:_0x5d4802,body:_0x1f2a3f,isCmd:_0x3d83a5,command:_0x5c6551,args:_0x5a04f7,q:_0x3643ba,isGroup:_0x24ca37,sender:_0x45c0a1,senderNumber:_0x292fd3,botNumber2:_0x3439b5,botNumber:_0x1e0e43,pushname:_0x91bd89,isMe:_0x5a25ae,isOwner:_0x232cf1,groupMetadata:_0x419090,groupName:_0x128d29,participants:_0x4d2fd1,isItzcp:_0x5ed7ce,groupAdmins:_0x2426fb,isBotAdmins:_0x29f7f1,isAdmins:_0x571b32,reply:_0x29effb})=>{const _0x521a8b=_0x4ebbd8;try{if(!_0x232cf1||!_0x571b32)return;if(!_0x38fcd3[_0x521a8b(0x107)])return _0x29effb(mg[_0x521a8b(0x120)]);if(!_0x29f7f1)return _0x29effb(mg['needbotadmins']);await _0x5b84bb[_0x521a8b(0x11d)](_0x38fcd3['chat'],_0x521a8b(0x11b));const _0x40ff13=await _0x5b84bb[_0x521a8b(0x11a)](_0x38fcd3[_0x521a8b(0x108)],{'text':_0x521a8b(0x11f)},{'quoted':_0x5b1739});return await _0x5b84bb['sendMessage'](_0x38fcd3[_0x521a8b(0x108)],{'react':{'text':'🔊','key':_0x40ff13[_0x521a8b(0x10c)]}});}catch(_0x1690ff){console[_0x521a8b(0x121)](_0x1690ff),_0x29effb(_0x521a8b(0x114));}});
