
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ







function _0x2aad(){const _0x11cc85=['Get\x20a\x20random\x20inspiring\x20quote.','7WePaEt','../command','808850NnRRvI','3vreLMi','10PbXcdR','\x0a𝐏𝐎𝐖𝐄𝐑𝐄𝐃\x20𝐁𝐘\x20-𝐒𝐔𝐇𝐀𝐒-𝐌𝐃\x20𝐐𝐔𝐎𝐓𝐄𝐒\x0a\x20\x20\x20\x20\x20\x20\x20\x20','2336213YXvkOJ','11225BneIKF','26760lkefMS','3634464YjNFZG','10413yaGDVn','76981YcDipt','432244KvCCws','2538gceNdw','fun','author','error','https://api.quotable.io/random','¢συℓ∂\x20ησт\x20ƒєт¢н\x20α\x20qυσтє.\x20ρℓєαѕє\x20тяу\x20αgαιη\x20ℓαтєя.','axios','18TeqkeS'];_0x2aad=function(){return _0x11cc85;};return _0x2aad();}const _0x58560c=_0xa77c;function _0xa77c(_0x19c250,_0x1f26d8){const _0x2aad14=_0x2aad();return _0xa77c=function(_0xa77c6,_0x31b5b9){_0xa77c6=_0xa77c6-0x6b;let _0x3a16ff=_0x2aad14[_0xa77c6];return _0x3a16ff;},_0xa77c(_0x19c250,_0x1f26d8);}(function(_0x3f63bb,_0x51bfe7){const _0x3ecdaf=_0xa77c,_0x171955=_0x3f63bb();while(!![]){try{const _0x3bac4b=parseInt(_0x3ecdaf(0x73))/0x1*(-parseInt(_0x3ecdaf(0x6c))/0x2)+parseInt(_0x3ecdaf(0x6b))/0x3*(parseInt(_0x3ecdaf(0x74))/0x4)+parseInt(_0x3ecdaf(0x6f))/0x5*(-parseInt(_0x3ecdaf(0x75))/0x6)+parseInt(_0x3ecdaf(0x7e))/0x7*(-parseInt(_0x3ecdaf(0x71))/0x8)+-parseInt(_0x3ecdaf(0x7c))/0x9*(-parseInt(_0x3ecdaf(0x80))/0xa)+parseInt(_0x3ecdaf(0x6e))/0xb+-parseInt(_0x3ecdaf(0x70))/0xc*(-parseInt(_0x3ecdaf(0x72))/0xd);if(_0x3bac4b===_0x51bfe7)break;else _0x171955['push'](_0x171955['shift']());}catch(_0x2c6d32){_0x171955['push'](_0x171955['shift']());}}}(_0x2aad,0x7516c));const axios=require(_0x58560c(0x7b)),{cmd}=require(_0x58560c(0x7f));cmd({'pattern':'quote','desc':_0x58560c(0x7d),'category':_0x58560c(0x76),'react':'💬','filename':__filename},async(_0x423493,_0x5673f1,_0x12761c,{from:_0x1d9622,reply:_0x580f81})=>{const _0x29e960=_0x58560c;try{const _0xe2dd91=await axios['get'](_0x29e960(0x79)),_0xa8b828=_0xe2dd91['data'],_0x4367fc='\x0a💬\x20\x22'+_0xa8b828['content']+'\x22\x0a-\x20'+_0xa8b828[_0x29e960(0x77)]+_0x29e960(0x6d);return _0x580f81(_0x4367fc);}catch(_0x26444d){console[_0x29e960(0x78)]('Error\x20fetching\x20quote:',_0x26444d),_0x580f81(_0x29e960(0x7a));}});
