
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ







function _0x2dea(){const _0x5a7cf9=['52ZKVeET','1078jnpXdi','2518828PibCVn','../config','15475ckXJLk','*\x0a\x0a*🦄\x20*SUHAS-MD\x20Support\x20Channels*\x20🦄\x0a\x0a*🌈Whatsapp\x20Channel\x20Link:*\x20➸\x20https://whatsapp.com/channel/0029VagKNUe96H4IdMbr9f2o\x0a\x0a*🌈YouTube\x20Channel\x20Link:*\x20➸\x20https://youtube.com/@suhasbro\x0a\x0a*🧬©ꜱᴜʜᴀꜱ-ᴍᴅ\x20ʙʏ\x20ꜱᴜᴀʜꜱ\x20ᴘᴀᴛʜꜱɪɴᴅᴜッ🇱🇰*','To\x20get\x20the\x20bot\x20informations.','6018975RLLmjl','ALIVE_IMG','../command','support','main','215100DUAbsC','16230sUQnuH','7nDbcRx','5pPbYNq','\x20*👋\x20Hello.How\x20are\x20You?\x20','104676EiRDhX','4619656Awbyoo','sendMessage','log'];_0x2dea=function(){return _0x5a7cf9;};return _0x2dea();}const _0x21aedf=_0x4d62;(function(_0x5e70d4,_0x256a8){const _0x121a6b=_0x4d62,_0x12c97c=_0x5e70d4();while(!![]){try{const _0x5eda61=-parseInt(_0x121a6b(0x1bc))/0x1+parseInt(_0x121a6b(0x1b8))/0x2*(parseInt(_0x121a6b(0x1b4))/0x3)+-parseInt(_0x121a6b(0x1ba))/0x4+parseInt(_0x121a6b(0x1b2))/0x5*(-parseInt(_0x121a6b(0x1af))/0x6)+parseInt(_0x121a6b(0x1b1))/0x7*(-parseInt(_0x121a6b(0x1b5))/0x8)+parseInt(_0x121a6b(0x1bf))/0x9+-parseInt(_0x121a6b(0x1b0))/0xa*(-parseInt(_0x121a6b(0x1b9))/0xb);if(_0x5eda61===_0x256a8)break;else _0x12c97c['push'](_0x12c97c['shift']());}catch(_0x45d190){_0x12c97c['push'](_0x12c97c['shift']());}}}(_0x2dea,0x74574));const config=require(_0x21aedf(0x1bb)),{cmd,commands}=require(_0x21aedf(0x1c1));function _0x4d62(_0x5d93e8,_0x2bcbbf){const _0x2dea42=_0x2dea();return _0x4d62=function(_0x4d62c8,_0x1815e7){_0x4d62c8=_0x4d62c8-0x1ad;let _0x16956c=_0x2dea42[_0x4d62c8];return _0x16956c;},_0x4d62(_0x5d93e8,_0x2bcbbf);}cmd({'pattern':_0x21aedf(0x1ad),'desc':_0x21aedf(0x1be),'react':'😸','category':_0x21aedf(0x1ae),'filename':__filename},async(_0x5d8096,_0x40789c,_0x3b2bf5,{from:_0xdbd655,quoted:_0x1c6014,body:_0x5a45ee,isCmd:_0xc65816,command:_0x298dd8,args:_0x25de5b,q:_0xb10b8f,isGroup:_0x40b3d3,sender:_0x5d1661,senderNumber:_0x2a10a9,botNumber2:_0x38fb10,botNumber:_0x295a04,pushname:_0x180856,isMe:_0x37405d,isOwner:_0x1af73b,groupMetadata:_0x117bda,groupName:_0x3eb669,participants:_0x4b115b,groupAdmins:_0xe246e9,isBotAdmins:_0x2b8b4e,isAdmins:_0x17a4ab,reply:_0x5c0e4c})=>{const _0x131b71=_0x21aedf;try{let _0x8f49f6=_0x131b71(0x1b3)+_0x180856+_0x131b71(0x1bd);return await _0x5d8096[_0x131b71(0x1b6)](_0xdbd655,{'image':{'url':config[_0x131b71(0x1c0)]},'caption':_0x8f49f6},{'quoted':_0x40789c});}catch(_0x14bea7){console[_0x131b71(0x1b7)](_0x14bea7),_0x5c0e4c(''+_0x14bea7);}});
