
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ










const _0x5902c5=_0xa4bc;function _0xa4bc(_0x6b4fcb,_0x45a585){const _0x1d394f=_0x1d39();return _0xa4bc=function(_0xa4bc76,_0x1e70b0){_0xa4bc76=_0xa4bc76-0x1e2;let _0x5361f6=_0x1d394f[_0xa4bc76];return _0x5361f6;},_0xa4bc(_0x6b4fcb,_0x45a585);}(function(_0x7c04ea,_0x28a472){const _0x3df079=_0xa4bc,_0x2132b5=_0x7c04ea();while(!![]){try{const _0x3c77ec=parseInt(_0x3df079(0x1e6))/0x1*(parseInt(_0x3df079(0x1f2))/0x2)+parseInt(_0x3df079(0x1ec))/0x3+-parseInt(_0x3df079(0x1eb))/0x4*(parseInt(_0x3df079(0x1e3))/0x5)+parseInt(_0x3df079(0x1e9))/0x6+-parseInt(_0x3df079(0x1ee))/0x7+parseInt(_0x3df079(0x1f4))/0x8*(-parseInt(_0x3df079(0x1e4))/0x9)+-parseInt(_0x3df079(0x1ed))/0xa*(-parseInt(_0x3df079(0x1ef))/0xb);if(_0x3c77ec===_0x28a472)break;else _0x2132b5['push'](_0x2132b5['shift']());}catch(_0x3be159){_0x2132b5['push'](_0x2132b5['shift']());}}}(_0x1d39,0xec065));const config=require(_0x5902c5(0x1ea)),{cmd,commands}=require(_0x5902c5(0x1f5));function _0x1d39(){const _0x31b88c=['658120CMXGON','1644321raAThq','132kuhLjH','sender','notextfordel','11382pksAEo','sendMessage','5840vbEJne','../command','log','85JjQyeQ','17478qChuSW','chat','151RIUaJW','group','quoted','10153614wfHgjV','../config','186536zCCWPj','212232xfPNrl'];_0x1d39=function(){return _0x31b88c;};return _0x1d39();}cmd({'pattern':'delete','react':'❌','alias':[','],'desc':'delete\x20message','category':_0x5902c5(0x1e7),'use':'.del','filename':__filename},async(_0x32e545,_0x330db8,_0x515c43,{from:_0x55866f,l:_0x226abd,quoted:_0x4b4408,body:_0x19b7b1,isCmd:_0x7cc18d,command:_0xfac386,args:_0x3cef49,q:_0x4b2cae,isGroup:_0x113104,sender:_0x1007eb,senderNumber:_0x30a7d1,botNumber2:_0x3f0f29,botNumber:_0x228c80,pushname:_0x4f3ad2,isMe:_0x4c60b6,isOwner:_0x3164f6,groupMetadata:_0x323384,groupName:_0x39fb8f,participants:_0x51f474,isItzcp:_0x3e4b7f,groupAdmins:_0x2e820d,isBotAdmins:_0x5682a7,isAdmins:_0x51fc37,reply:_0x520dc8})=>{const _0x37326a=_0x5902c5;if(!_0x3164f6||!_0x51fc37)return;try{if(!_0x515c43[_0x37326a(0x1e8)])return _0x520dc8(mg[_0x37326a(0x1f1)]);const _0x1a73c5={'remoteJid':_0x515c43['chat'],'fromMe':![],'id':_0x515c43[_0x37326a(0x1e8)]['id'],'participant':_0x515c43['quoted'][_0x37326a(0x1f0)]};await _0x32e545[_0x37326a(0x1f3)](_0x515c43[_0x37326a(0x1e5)],{'delete':_0x1a73c5});}catch(_0x355dd5){console[_0x37326a(0x1e2)](_0x355dd5),_0x520dc8('successful..👨‍💻✅');}});
