
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ







const _0x3751c2=_0x1e90;(function(_0x4d8371,_0x4d467f){const _0x4dbc2b=_0x1e90,_0x1cc86d=_0x4d8371();while(!![]){try{const _0x4ec105=parseInt(_0x4dbc2b(0xd4))/0x1+-parseInt(_0x4dbc2b(0xd5))/0x2+-parseInt(_0x4dbc2b(0xca))/0x3+parseInt(_0x4dbc2b(0xc1))/0x4*(-parseInt(_0x4dbc2b(0xd3))/0x5)+parseInt(_0x4dbc2b(0xc9))/0x6*(-parseInt(_0x4dbc2b(0xd0))/0x7)+parseInt(_0x4dbc2b(0xc0))/0x8*(-parseInt(_0x4dbc2b(0xc7))/0x9)+-parseInt(_0x4dbc2b(0xc3))/0xa*(-parseInt(_0x4dbc2b(0xc5))/0xb);if(_0x4ec105===_0x4d467f)break;else _0x1cc86d['push'](_0x1cc86d['shift']());}catch(_0x2e6507){_0x1cc86d['push'](_0x1cc86d['shift']());}}}(_0x3064,0xbc7ae));const {cmd}=require(_0x3751c2(0xcf)),config=require('../config');let autoBioInterval;function _0x1e90(_0x5ac725,_0x6b6cd1){const _0x3064c8=_0x3064();return _0x1e90=function(_0x1e907a,_0x1149ed){_0x1e907a=_0x1e907a-0xc0;let _0x37ec49=_0x3064c8[_0x1e907a];return _0x37ec49;},_0x1e90(_0x5ac725,_0x6b6cd1);}cmd({'pattern':_0x3751c2(0xcd),'desc':_0x3751c2(0xce),'category':_0x3751c2(0xc8),'react':'🛠️','filename':__filename},async(_0x2413f1,_0x11a23e,_0x1ca5bf,{from:_0x2ec7a3,isOwner:_0x268fd8,reply:_0x51ad16})=>{const _0x24bf06=_0x3751c2;if(!_0x268fd8)return _0x51ad16(_0x24bf06(0xd1));config['autoBioEnabled']=!config[_0x24bf06(0xcb)],config[_0x24bf06(0xcb)]?(_0x51ad16(_0x24bf06(0xc2)),startAutoBio(_0x2413f1)):(_0x51ad16('🛠️\x20AutoBIO\x20feature\x20has\x20been\x20*disabled*!\x20🚫'),stopAutoBio());});function startAutoBio(_0x28829b){if(autoBioInterval)clearInterval(autoBioInterval);autoBioInterval=setInterval(async()=>{const _0x2e2c6c=_0x1e90,_0x5e0cd7=new Date()['toLocaleTimeString'](),_0x314fd3=_0x2e2c6c(0xc6)+_0x5e0cd7+_0x2e2c6c(0xd2);await _0x28829b[_0x2e2c6c(0xcc)](_0x314fd3);},0x3c*0x3e8);}function stopAutoBio(){const _0xde6793=_0x3751c2;autoBioInterval&&(clearInterval(autoBioInterval),autoBioInterval=null,console['log'](_0xde6793(0xc4)));}function _0x3064(){const _0x4e99f2=['9OVPwgF','owner','540582TTbHey','1335198bxdVIp','autoBioEnabled','updateProfileStatus','setautobio','Enable\x20or\x20disable\x20the\x20AutoBIO\x20feature.','../command','56yJkUUX','❌\x20You\x20are\x20not\x20the\x20owner!',']\x20⚡💻','87545HpYGWD','1535590IlxOAT','2877874JtXQtV','6058376waIgjN','268uUrYEO','🛠️\x20AutoBIO\x20feature\x20has\x20been\x20*enabled*!\x20🔄','12572010koeTKD','🛠️\x20AutoBIO\x20feature\x20stopped.','33xfmJmq','👨‍💻\x20𝙒𝙤𝙧𝙡𝙙\x20𝘽𝙚𝙨𝙩\x20𝙒𝙝𝙖𝙩𝙨𝙖𝙥𝙥\x20𝘽𝙤𝙩\x20𝙎𝙐𝙃𝘼𝙎-𝙈𝘿🙈\x20𝘾𝙤𝙣𝙣𝙚𝙘𝙩𝙚𝙙\x20𝙎𝙪𝙘𝙨𝙨𝙚𝙨𝙛𝙪𝙡💥.𝘿𝙤𝙣\x27𝙩\x20𝙁𝙤𝙧𝙜𝙚𝙩\x20𝙏𝙤\x20𝙎𝙪𝙗𝙨𝙘𝙧𝙞𝙗𝙚\x20𝙈𝙚\x20𝙞𝙣\x20𝙔𝙤𝙪𝙩𝙪𝙗𝙚🔔\x20@suhasbro\x20['];_0x3064=function(){return _0x4e99f2;};return _0x3064();}
