
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ














const _0x52ace4=_0xedd1;function _0xedd1(_0x20f7c5,_0x2d5cb5){const _0x3f8d5b=_0x3f8d();return _0xedd1=function(_0xedd188,_0x330d16){_0xedd188=_0xedd188-0x12e;let _0x35262a=_0x3f8d5b[_0xedd188];return _0x35262a;},_0xedd1(_0x20f7c5,_0x2d5cb5);}(function(_0x4bc6c2,_0x1cfa03){const _0x13910f=_0xedd1,_0x28ee5d=_0x4bc6c2();while(!![]){try{const _0x211750=-parseInt(_0x13910f(0x134))/0x1*(-parseInt(_0x13910f(0x136))/0x2)+parseInt(_0x13910f(0x13d))/0x3+parseInt(_0x13910f(0x141))/0x4+parseInt(_0x13910f(0x12f))/0x5*(parseInt(_0x13910f(0x131))/0x6)+-parseInt(_0x13910f(0x140))/0x7+parseInt(_0x13910f(0x13a))/0x8+-parseInt(_0x13910f(0x130))/0x9*(parseInt(_0x13910f(0x138))/0xa);if(_0x211750===_0x1cfa03)break;else _0x28ee5d['push'](_0x28ee5d['shift']());}catch(_0x4db153){_0x28ee5d['push'](_0x28ee5d['shift']());}}}(_0x3f8d,0x882c7));function _0x3f8d(){const _0x12ba96=['sendMessage','3947132mgqPLd','4377044VksLkc','🐶\x20SUHAS-MD\x20Random\x20Dog\x20Images🐶\x0a\x0a\x0a\x20*🧬©ꜱᴜʜᴀꜱ-ᴍᴅ\x20ʙʏ\x20ꜱᴜᴀʜꜱ\x20ᴘᴀᴛʜꜱɪɴᴅᴜッ🇱🇰*','257595LduHCt','9986373EACBVD','96fYZpbH','log','data','1ilpOBR','Error\x20Fetching\x20Dog\x20Image🤕:\x20','1508388sTPXXT','https://dog.ceo/api/breeds/image/random','20wVYgCI','fun','2061408RzsaJp','Fetch\x20a\x20random\x20dog\x20image.','message','1231206eCFCPu','../command'];_0x3f8d=function(){return _0x12ba96;};return _0x3f8d();}const axios=require('axios'),{cmd,commands}=require(_0x52ace4(0x13e));cmd({'pattern':'dog','desc':_0x52ace4(0x13b),'category':_0x52ace4(0x139),'react':'🐶','filename':__filename},async(_0x4908a2,_0x2159b5,_0x5b3491,{from:_0x4cd9fd,quoted:_0x2111c8,body:_0x42b28b,isCmd:_0x2d58b0,command:_0x502361,args:_0x1fb2fe,q:_0x5b23f6,isGroup:_0x23bc44,sender:_0x30b4aa,senderNumber:_0x1ea49b,botNumber2:_0xdd9df8,botNumber:_0x1a1e5c,pushname:_0x13a351,isMe:_0x52990,isOwner:_0x499264,groupMetadata:_0x333c91,groupName:_0x35fc76,participants:_0x263626,groupAdmins:_0x12ea74,isBotAdmins:_0x20d638,isAdmins:_0x5a4946,reply:_0x85c7b7})=>{const _0x359556=_0x52ace4;try{const _0x1447c6=_0x359556(0x137),_0xe50e91=await axios['get'](_0x1447c6),_0x2a7ad0=_0xe50e91[_0x359556(0x133)];await _0x4908a2[_0x359556(0x13f)](_0x4cd9fd,{'image':{'url':_0x2a7ad0[_0x359556(0x13c)]},'caption':_0x359556(0x12e)},{'quoted':_0x2159b5});}catch(_0x5267c5){console[_0x359556(0x132)](_0x5267c5),_0x85c7b7(_0x359556(0x135)+_0x5267c5[_0x359556(0x13c)]);}});
