
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ







const _0x35207c=_0x4cbe;(function(_0x15df83,_0x58b6e2){const _0x58d120=_0x4cbe,_0x5b70a0=_0x15df83();while(!![]){try{const _0xeeb26=-parseInt(_0x58d120(0xd9))/0x1*(-parseInt(_0x58d120(0xd7))/0x2)+parseInt(_0x58d120(0xe5))/0x3*(parseInt(_0x58d120(0xdc))/0x4)+parseInt(_0x58d120(0xd8))/0x5+-parseInt(_0x58d120(0xe4))/0x6+parseInt(_0x58d120(0xe6))/0x7*(-parseInt(_0x58d120(0xe7))/0x8)+parseInt(_0x58d120(0xe3))/0x9*(-parseInt(_0x58d120(0xda))/0xa)+parseInt(_0x58d120(0xdb))/0xb;if(_0xeeb26===_0x58b6e2)break;else _0x5b70a0['push'](_0x5b70a0['shift']());}catch(_0x4816aa){_0x5b70a0['push'](_0x5b70a0['shift']());}}}(_0x335d,0xdfed3));function _0x4cbe(_0x487213,_0x49699d){const _0x335d98=_0x335d();return _0x4cbe=function(_0x4cbe66,_0x57aae1){_0x4cbe66=_0x4cbe66-0xd4;let _0x40ee69=_0x335d98[_0x4cbe66];return _0x40ee69;},_0x4cbe(_0x487213,_0x49699d);}const axios=require(_0x35207c(0xe8)),{cmd}=require(_0x35207c(0xdf));function _0x335d(){const _0x22262a=['get','log','fun','punchline','132FPDpIq','3467980FMXeWs','23692YjiBDP','163690RLOUUu','135036btuGTr','1033696hKIddo','\x0a😂\x20*Here\x27s\x20a\x20random\x20joke\x20for\x20you!*\x20😂\x0a\x0a*','*\x0a\x0a','../command','data','\x20😄\x0a\x0a*©\x20ᴘᴏᴡᴇʀᴅ\x20ʙʏ\x20ꜱᴜʜᴀꜱ-ᴍᴅ🇱🇰*\x20','😂\x20Get\x20a\x20random\x20joke','423kZuqRD','10241832ZkmEiR','15yoyuGZ','154dCxLUh','61144ZyCPpt','axios','https://official-joke-api.appspot.com/random_joke'];_0x335d=function(){return _0x22262a;};return _0x335d();}cmd({'pattern':'joke','desc':_0x35207c(0xe2),'react':'🤣','category':_0x35207c(0xd5),'filename':__filename},async(_0x4b45ce,_0x1be09a,_0x193800,{from:_0x5adba5,q:_0x3103c1,reply:_0xd5c35a})=>{const _0x232317=_0x35207c;try{const _0x19c00c=_0x232317(0xe9),_0x57f3e3=await axios[_0x232317(0xea)](_0x19c00c),_0x302835=_0x57f3e3[_0x232317(0xe0)],_0x3c08da=_0x232317(0xdd)+_0x302835['setup']+_0x232317(0xde)+_0x302835[_0x232317(0xd6)]+_0x232317(0xe1);return _0xd5c35a(_0x3c08da);}catch(_0x197880){return console[_0x232317(0xd4)](_0x197880),_0xd5c35a('⚠️\x20¢συℓ∂η\x27т\x20ƒєт¢н\x20α\x20נσкє\x20яιgнт\x20ησω.\x20ρℓєαѕє\x20тяу\x20αgαιη\x20ℓαтєя.');}});
