
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ










const _0x30c35e=_0x3645;(function(_0x335cb0,_0x2bc0ff){const _0x471898=_0x3645,_0x344ec0=_0x335cb0();while(!![]){try{const _0x3efd41=-parseInt(_0x471898(0xbc))/0x1*(parseInt(_0x471898(0xb9))/0x2)+parseInt(_0x471898(0xc9))/0x3*(-parseInt(_0x471898(0xc8))/0x4)+-parseInt(_0x471898(0xbe))/0x5+parseInt(_0x471898(0xb6))/0x6+-parseInt(_0x471898(0xba))/0x7+-parseInt(_0x471898(0xc4))/0x8*(-parseInt(_0x471898(0xb8))/0x9)+parseInt(_0x471898(0xbf))/0xa;if(_0x3efd41===_0x2bc0ff)break;else _0x344ec0['push'](_0x344ec0['shift']());}catch(_0x495640){_0x344ec0['push'](_0x344ec0['shift']());}}}(_0x4259,0x7bd42));const {cmd,commands}=require(_0x30c35e(0xc3));function _0x3645(_0x2208d1,_0x220e97){const _0x4259de=_0x4259();return _0x3645=function(_0x3645cf,_0x36bece){_0x3645cf=_0x3645cf-0xb6;let _0x20ad08=_0x4259de[_0x3645cf];return _0x20ad08;},_0x3645(_0x2208d1,_0x220e97);}function _0x4259(){const _0x5e4811=['3498076atZWCk','3hjAfLi','sendMessage','https://telegra.ph/file/ce9cb5acd2cec7693d76b.jpg','main','2096010lKWfbI','anime','18Kfyezf','18884YahWzp','7016058KdWvwu','❮❮❮\x20𝐌𝐘\x20𝐒𝐔𝐇𝐀𝐒-𝐌𝐃\x20𝟒𝐊\x20❝𝐀𝐍𝐈𝐌𝐄❞\x20𝐏𝐇𝐎𝐓𝐎𝐒🌈™\x20❯❯❯','3OnPiwN','https://telegra.ph/file/b26f27aa5daaada031b90.jpg','4190655UvmvRq','27815310MTtCoy','log','https://telegra.ph/file/51b44e4b086667361061b.jpg','https://telegra.ph/file/7d165d73f914985542537.jpg','../command','478424GNKjGb','anime\x20the\x20bot','https://telegra.ph/file/7514b18ea89da924e7496.jpg','https://telegra.ph/file/8daf7e432a646f3ebe7eb.jpg'];_0x4259=function(){return _0x5e4811;};return _0x4259();}cmd({'pattern':_0x30c35e(0xb7),'desc':_0x30c35e(0xc5),'category':_0x30c35e(0xcc),'react':'⛱️','filename':__filename},async(_0x19030b,_0x47e009,_0x4ed2d1,{from:_0x34abbb,quoted:_0x2ff5cc,body:_0xd03cff,isCmd:_0x1afcb6,command:_0x26e0ed,args:_0x2b6c39,q:_0x5b93a4,isGroup:_0x37e5d1,sender:_0x3e2fac,senderNumber:_0x46ba6f,botNumber2:_0x206cc3,botNumber:_0x516c61,pushname:_0x16c070,isMe:_0x5a8247,isOwner:_0x4db23f,groupMetadata:_0x4aa047,groupName:_0x2f6035,participants:_0x317281,groupAdmins:_0x6b3abc,isBotAdmins:_0x5ea1ca,isAdmins:_0x524745,reply:_0x71c0d4})=>{const _0x3a17e6=_0x30c35e;try{let _0x5bdcc6=_0x3a17e6(0xbb);await _0x19030b[_0x3a17e6(0xca)](_0x34abbb,{'image':{'url':_0x3a17e6(0xbd)},'caption':_0x5bdcc6},{'quoted':_0x47e009}),await _0x19030b[_0x3a17e6(0xca)](_0x34abbb,{'image':{'url':_0x3a17e6(0xc1)},'caption':_0x5bdcc6},{'quoted':_0x47e009}),await _0x19030b[_0x3a17e6(0xca)](_0x34abbb,{'image':{'url':_0x3a17e6(0xc2)},'caption':_0x5bdcc6},{'quoted':_0x47e009}),await _0x19030b[_0x3a17e6(0xca)](_0x34abbb,{'image':{'url':'https://telegra.ph/file/3d9732d2657d2d72dc102.jpg'},'caption':_0x5bdcc6},{'quoted':_0x47e009}),await _0x19030b[_0x3a17e6(0xca)](_0x34abbb,{'image':{'url':_0x3a17e6(0xc7)},'caption':_0x5bdcc6},{'quoted':_0x47e009}),await _0x19030b[_0x3a17e6(0xca)](_0x34abbb,{'image':{'url':_0x3a17e6(0xc6)},'caption':_0x5bdcc6},{'quoted':_0x47e009}),await _0x19030b[_0x3a17e6(0xca)](_0x34abbb,{'image':{'url':_0x3a17e6(0xcb)},'caption':_0x5bdcc6},{'quoted':_0x47e009}),await _0x19030b[_0x3a17e6(0xca)](_0x34abbb,{'image':{'url':'https://telegra.ph/file/008937b5ef96545fab4f3.jpg'},'caption':_0x5bdcc6},{'quoted':_0x47e009});}catch(_0x36150d){console[_0x3a17e6(0xc0)](_0x36150d),_0x71c0d4(''+_0x36150d);}});
