
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











const _0xbd8ed5=_0x54c1;(function(_0x4a6456,_0x5c0afd){const _0x3b44b8=_0x54c1,_0x43531d=_0x4a6456();while(!![]){try{const _0x5bd6c1=-parseInt(_0x3b44b8(0x7d))/0x1+parseInt(_0x3b44b8(0x7a))/0x2*(-parseInt(_0x3b44b8(0x79))/0x3)+-parseInt(_0x3b44b8(0x71))/0x4*(parseInt(_0x3b44b8(0x74))/0x5)+parseInt(_0x3b44b8(0x7f))/0x6+parseInt(_0x3b44b8(0x85))/0x7*(-parseInt(_0x3b44b8(0x77))/0x8)+parseInt(_0x3b44b8(0x70))/0x9+parseInt(_0x3b44b8(0x6e))/0xa;if(_0x5bd6c1===_0x5c0afd)break;else _0x43531d['push'](_0x43531d['shift']());}catch(_0x31332d){_0x43531d['push'](_0x43531d['shift']());}}}(_0x1cd3,0xf24a8));const {cmd}=require(_0xbd8ed5(0x6c)),axios=require('axios'),{Buffer}=require(_0xbd8ed5(0x73)),GOOGLE_API_KEY=_0xbd8ed5(0x82),GOOGLE_CX=_0xbd8ed5(0x81);function _0x1cd3(){const _0x5b8a0a=['46196iOyaeU','No\x20images\x20found\x20for\x20your\x20query.','buffer','495rnRepj','items','Error:\x20','2858792DaOWCR','link','9NyvsKZ','614788kTRXIc','get','data','648634FPZgnL','&key=','9094482KMZYSr','binary','45b94c5cef39940d1','AIzaSyDebFT-uY_f82_An6bnE9WvVcgVbzwDKgU','&cx=','sendMessage','7oeTsyP','Please\x20provide\x20a\x20search\x20query\x20for\x20the\x20image.','\x0a*💗Image\x20','https://www.googleapis.com/customsearch/v1?q=','🖼️','img','message','error','../command','length','13114960fCYGhQ','&searchType=image&num=5','11130273lVHXoW'];_0x1cd3=function(){return _0x5b8a0a;};return _0x1cd3();}function _0x54c1(_0x34046d,_0x414e39){const _0x1cd326=_0x1cd3();return _0x54c1=function(_0x54c174,_0x406052){_0x54c174=_0x54c174-0x65;let _0x197327=_0x1cd326[_0x54c174];return _0x197327;},_0x54c1(_0x34046d,_0x414e39);}cmd({'pattern':_0xbd8ed5(0x69),'desc':'Search\x20and\x20send\x20images\x20from\x20Google.','react':_0xbd8ed5(0x68),'category':'media','filename':__filename},async(_0x42e588,_0x213e12,_0x580d74,{from:_0x4be2db,quoted:_0x14132d,body:_0x45f247,isCmd:_0x4ed73e,command:_0x467d29,args:_0x1a1a58,q:_0x14d3ce,isGroup:_0x3c09d2,sender:_0x4598d0,senderNumber:_0x1fc1ab,botNumber2:_0x37bcd6,botNumber:_0x396c48,pushname:_0x19b0a8,isMe:_0x3dc19d,isOwner:_0x1d9c73,groupMetadata:_0x41a981,groupName:_0xab1f46,participants:_0x1b9f12,groupAdmins:_0x4df8bd,isBotAdmins:_0x37cf12,isAdmins:_0x5351be,reply:_0x59a035})=>{const _0x15db99=_0xbd8ed5;try{if(!_0x14d3ce)return _0x59a035(_0x15db99(0x65));const _0xc42a1=encodeURIComponent(_0x14d3ce),_0x2c7a76=_0x15db99(0x67)+_0xc42a1+_0x15db99(0x83)+GOOGLE_CX+_0x15db99(0x7e)+GOOGLE_API_KEY+_0x15db99(0x6f),_0x4e31ea=await axios['get'](_0x2c7a76),_0x1cafa7=_0x4e31ea[_0x15db99(0x7c)];if(!_0x1cafa7[_0x15db99(0x75)]||_0x1cafa7[_0x15db99(0x75)]['length']===0x0)return _0x59a035(_0x15db99(0x72));for(let _0x3f0ada=0x0;_0x3f0ada<_0x1cafa7['items'][_0x15db99(0x6d)];_0x3f0ada++){const _0x156643=_0x1cafa7['items'][_0x3f0ada][_0x15db99(0x78)],_0x416fe5=await axios[_0x15db99(0x7b)](_0x156643,{'responseType':'arraybuffer'}),_0x3d1793=Buffer['from'](_0x416fe5[_0x15db99(0x7c)],_0x15db99(0x80));await _0x42e588[_0x15db99(0x84)](_0x4be2db,{'image':_0x3d1793,'caption':_0x15db99(0x66)+(_0x3f0ada+0x1)+'\x20from\x20your\x20search!💗*\x0a\x0a\x20*Enjoy\x20these\x20images!\x20👾*\x0a\x0a>\x20🌈𝐒𝐔𝐇𝐀𝐒-𝐌𝐃\x20𝐖𝐡𝐚𝐭𝐬𝐀𝐩𝐩\x20𝐁𝐨𝐭🏝️'},{'quoted':_0x213e12});}}catch(_0x368741){console[_0x15db99(0x6b)](_0x368741),_0x59a035(_0x15db99(0x76)+_0x368741[_0x15db99(0x6a)]);}});
