
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ













const _0x1f5b91=_0x5a3b;(function(_0x52dc98,_0x441b10){const _0x1b32f5=_0x5a3b,_0x34c10d=_0x52dc98();while(!![]){try{const _0x1e96ed=-parseInt(_0x1b32f5(0xee))/0x1*(-parseInt(_0x1b32f5(0xec))/0x2)+parseInt(_0x1b32f5(0xed))/0x3*(parseInt(_0x1b32f5(0xe6))/0x4)+-parseInt(_0x1b32f5(0xe9))/0x5*(parseInt(_0x1b32f5(0xea))/0x6)+-parseInt(_0x1b32f5(0xe7))/0x7+parseInt(_0x1b32f5(0xe0))/0x8*(parseInt(_0x1b32f5(0xe1))/0x9)+parseInt(_0x1b32f5(0xdf))/0xa*(-parseInt(_0x1b32f5(0xdd))/0xb)+parseInt(_0x1b32f5(0xef))/0xc;if(_0x1e96ed===_0x441b10)break;else _0x34c10d['push'](_0x34c10d['shift']());}catch(_0x62b2c){_0x34c10d['push'](_0x34c10d['shift']());}}}(_0x2016,0xde773));const crypto=require('crypto'),{cmd}=require(_0x1f5b91(0xdc));cmd({'pattern':'gpass','desc':_0x1f5b91(0xe4),'category':'other','react':'🔐','filename':__filename},async(_0x29ece8,_0x1fb757,_0xbf2cd8,{from:_0x837a09,quoted:_0x4cc974,body:_0x1f55df,isCmd:_0x34e387,command:_0x22f2ec,args:_0x545694,q:_0x1a3857,isGroup:_0x5c82c5,sender:_0x601590,senderNumber:_0x4d4c29,botNumber2:_0xb8f699,botNumber:_0x3253a3,pushname:_0x4b3e23,isMe:_0x4a3053,isOwner:_0x2224d9,groupMetadata:_0x2b6626,groupName:_0x36fddc,participants:_0x57a634,groupAdmins:_0x27887b,isBotAdmins:_0x18df55,isAdmins:_0x34cb4a,reply:_0x15ab89})=>{const _0x4d0d9c=_0x1f5b91;try{const _0x24fa56=_0x545694[0x0]?parseInt(_0x545694[0x0]):0xc;if(isNaN(_0x24fa56)||_0x24fa56<0x8)return _0x15ab89('Please\x20provide\x20a\x20valid\x20length\x20for\x20the\x20password\x20(Minimum\x2008\x20Characters💦).');const _0x1c1cc6=_0x30c045=>{const _0x4dd310=_0x5a3b,_0x134aeb='abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789!@#$%^&*()_+[]{}|;:,.<>?';let _0x50608e='';for(let _0x824ae1=0x0;_0x824ae1<_0x30c045;_0x824ae1++){const _0x218208=crypto[_0x4dd310(0xe3)](0x0,_0x134aeb['length']);_0x50608e+=_0x134aeb[_0x218208];}return _0x50608e;},_0x2c25f7=_0x1c1cc6(_0x24fa56),_0x5ea57f=_0x4d0d9c(0xeb);await _0x29ece8[_0x4d0d9c(0xe5)](_0x837a09,{'text':_0x5ea57f},{'quoted':_0x1fb757}),await _0x29ece8[_0x4d0d9c(0xe5)](_0x837a09,{'text':_0x2c25f7},{'quoted':_0x1fb757});}catch(_0x44afd7){console[_0x4d0d9c(0xde)](_0x44afd7),_0x15ab89(_0x4d0d9c(0xe2)+_0x44afd7[_0x4d0d9c(0xe8)]);}});function _0x5a3b(_0x266f69,_0x28252a){const _0x201638=_0x2016();return _0x5a3b=function(_0x5a3b06,_0x5aec1f){_0x5a3b06=_0x5a3b06-0xdc;let _0x4fc605=_0x201638[_0x5a3b06];return _0x4fc605;},_0x5a3b(_0x266f69,_0x28252a);}function _0x2016(){const _0x5245bf=['18985sxjIhH','954VRqCsi','🔐\x20*Your\x20Strong\x20Password*\x20🔐\x0a\x0aPlease\x20find\x20your\x20generated\x20password\x20below:\x0a\x0a\x20*🧬©ꜱᴜʜᴀꜱ-ᴍᴅ\x20ʙʏ\x20ꜱᴜᴀʜꜱ\x20ᴘᴀᴛʜꜱɪɴᴅᴜッ🇱🇰*','142808MBeNqk','5955xcZalT','16bIgCyl','11069796cjHYlG','../command','22QhgCTz','log','5193580sGAtGx','2969240cnoJuu','9toQALk','❌\x20Error\x20generating\x20password🤕:\x20','randomInt','Generate\x20a\x20strong\x20password.','sendMessage','1164RuWhep','3220553aTrBjm','message'];_0x2016=function(){return _0x5245bf;};return _0x2016();}
