
//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ














const _0x445a17=_0x1923;(function(_0x20995a,_0x261999){const _0xaf12a=_0x1923,_0x1502ff=_0x20995a();while(!![]){try{const _0x5027ea=parseInt(_0xaf12a(0x6a))/0x1*(-parseInt(_0xaf12a(0x6d))/0x2)+-parseInt(_0xaf12a(0x6f))/0x3*(-parseInt(_0xaf12a(0x6b))/0x4)+-parseInt(_0xaf12a(0x70))/0x5+-parseInt(_0xaf12a(0x6e))/0x6+-parseInt(_0xaf12a(0x71))/0x7+-parseInt(_0xaf12a(0x73))/0x8*(-parseInt(_0xaf12a(0x74))/0x9)+-parseInt(_0xaf12a(0x78))/0xa*(-parseInt(_0xaf12a(0x75))/0xb);if(_0x5027ea===_0x261999)break;else _0x1502ff['push'](_0x1502ff['shift']());}catch(_0x3f891e){_0x1502ff['push'](_0x1502ff['shift']());}}}(_0x236c,0x36be5));const config=require('../config'),{cmd,commands}=require('../command'),{fetchJson}=require(_0x445a17(0x76));function _0x1923(_0x36eaa4,_0x5cfbd0){const _0x236cf0=_0x236c();return _0x1923=function(_0x192308,_0x4eae79){_0x192308=_0x192308-0x69;let _0x5b3c2b=_0x236cf0[_0x192308];return _0x5b3c2b;},_0x1923(_0x36eaa4,_0x5cfbd0);}function _0x236c(){const _0x58552f=['360onhCQI','data','407399FqBVQU','1028iKdKYS','https://chatgptforprabath-md.vercel.app/api/gptv1?q=','2TPnoiT','684978Ctbtdo','870uaDRvh','2170850GNaWPs','586320ONhNvV','gpt','221160JrhliY','99KKgmfl','270446kSXNfy','../lib/functions','main'];_0x236c=function(){return _0x58552f;};return _0x236c();}cmd({'pattern':_0x445a17(0x72),'desc':'ai','category':_0x445a17(0x77),'react':'🧠','filename':__filename},async(_0x466db2,_0x32cbd2,_0x3ff837,{from:_0x45a4ca,quoted:_0x555a1e,body:_0x15f360,isCmd:_0x561eda,command:_0x2c6c15,args:_0x519538,q:_0x36e43d,isGroup:_0x4f643a,sender:_0x213906,senderNumber:_0x2c04ed,botNumber2:_0x19a4d1,botNumber:_0x5f1126,pushname:_0x542d5f,isMe:_0x55ed8f,isOwner:_0x4c90f9,groupMetadata:_0x355e13,groupName:_0x1305f2,participants:_0x27abdd,groupAdmins:_0x10f7b5,isBotAdmins:_0x58f816,isAdmins:_0x2c363f,reply:_0x56a531})=>{const _0x15cd04=_0x445a17;try{let _0x2bae99=await fetchJson(_0x15cd04(0x6c)+_0x36e43d);_0x56a531(''+_0x2bae99[_0x15cd04(0x69)]);}catch(_0x252800){console['log'](_0x252800),_0x56a531(''+_0x252800);}});
