//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ












function _0x128e(){const _0x5d79e0=['⚒️\x20AutoBIO\x20feature\x20has\x20been\x20*enabled*!\x20🔄','toLocaleTimeString','3715187JjXtrv','⚒️\x20AutoBIO\x20feature\x20has\x20been\x20*disabled*!\x20🚫','⚒️\x20AutoBIO\x20feature\x20stopped.','113383pWqvOw','❌\x20You\x20are\x20not\x20the\x20owner!','👨‍💻\x20𝙒𝙤𝙧𝙡𝙙\x20𝘽𝙚𝙨𝙩\x20𝙒𝙝𝙖𝙩𝙨𝙖𝙥𝙥\x20𝘽𝙤𝙩\x20𝙎𝙐𝙃𝘼𝙎-𝙈𝘿🙈\x20𝘾𝙤𝙣𝙣𝙚𝙘𝙩𝙚𝙙\x20𝙎𝙪𝙘𝙨𝙨𝙚𝙨𝙛𝙪𝙡💥.𝘿𝙤𝙣\x27𝙩\x20𝙁𝙤𝙧𝙜𝙚𝙩\x20𝙏𝙤\x20𝙎𝙪𝙗𝙨𝙘𝙧𝙞𝙗𝙚\x20𝙈𝙚\x20𝙞𝙣\x20𝙔𝙤𝙪𝙩𝙪𝙗𝙚🔔\x20@suhasbro\x20[',']\x20👨‍💻','6876114GHCFvD','owner','1892904gWJRZo','55VBokFO','5HnbDoK','38713454xQTTNj','2MiYcYc','setautobio','17433KaxOdj','log','../config','20780FFjrfS','820fzYFgc','16dHpIOH','732IbkpOt'];_0x128e=function(){return _0x5d79e0;};return _0x128e();}const _0x495d88=_0x5e6f;(function(_0x3aa017,_0x394c8b){const _0x2b0269=_0x5e6f,_0xbf5a52=_0x3aa017();while(!![]){try{const _0x2dc4a3=parseInt(_0x2b0269(0x1f6))/0x1*(-parseInt(_0x2b0269(0x1e8))/0x2)+parseInt(_0x2b0269(0x1f0))/0x3*(-parseInt(_0x2b0269(0x1ed))/0x4)+-parseInt(_0x2b0269(0x1e6))/0x5*(-parseInt(_0x2b0269(0x1fa))/0x6)+-parseInt(_0x2b0269(0x1f3))/0x7*(parseInt(_0x2b0269(0x1ef))/0x8)+parseInt(_0x2b0269(0x1ea))/0x9*(-parseInt(_0x2b0269(0x1ee))/0xa)+-parseInt(_0x2b0269(0x1e5))/0xb*(parseInt(_0x2b0269(0x1fc))/0xc)+parseInt(_0x2b0269(0x1e7))/0xd;if(_0x2dc4a3===_0x394c8b)break;else _0xbf5a52['push'](_0xbf5a52['shift']());}catch(_0x489090){_0xbf5a52['push'](_0xbf5a52['shift']());}}}(_0x128e,0xb3324));const {cmd}=require('../command'),config=require(_0x495d88(0x1ec));let autoBioInterval;function _0x5e6f(_0x1a989f,_0x518f0f){const _0x128e3e=_0x128e();return _0x5e6f=function(_0x5e6f88,_0x58c269){_0x5e6f88=_0x5e6f88-0x1e5;let _0x365d92=_0x128e3e[_0x5e6f88];return _0x365d92;},_0x5e6f(_0x1a989f,_0x518f0f);}cmd({'pattern':_0x495d88(0x1e9),'desc':'Enable\x20or\x20disable\x20the\x20AutoBIO\x20feature.','category':_0x495d88(0x1fb),'react':'⚒️','filename':__filename},async(_0xfe5087,_0xdd8342,_0x462914,{from:_0x4b33e7,isOwner:_0xbef03c,reply:_0x1acf91})=>{const _0x3da718=_0x495d88;if(!_0xbef03c)return _0x1acf91(_0x3da718(0x1f7));config['autoBioEnabled']=!config['autoBioEnabled'],config['autoBioEnabled']?(_0x1acf91(_0x3da718(0x1f1)),startAutoBio(_0xfe5087)):(_0x1acf91(_0x3da718(0x1f4)),stopAutoBio());});function startAutoBio(_0x92d353){if(autoBioInterval)clearInterval(autoBioInterval);autoBioInterval=setInterval(async()=>{const _0x3a3309=_0x5e6f,_0x90f94a=new Date()[_0x3a3309(0x1f2)](),_0x68f71b=_0x3a3309(0x1f8)+_0x90f94a+_0x3a3309(0x1f9);await _0x92d353['updateProfileStatus'](_0x68f71b);},0x3c*0x3e8);}function stopAutoBio(){const _0x5738b2=_0x495d88;autoBioInterval&&(clearInterval(autoBioInterval),autoBioInterval=null,console[_0x5738b2(0x1eb)](_0x5738b2(0x1f5)));}
