//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











function _0x327e(){const _0xbc7222=['Give\x20me\x20a\x20text\x20to\x20generate\x20qr\x20code.','32582eJsEuP','164184MhGreB','22ETKsHr','Generate\x20qr\x20code.','log','5rsHhBu','qcode','sendMessage','6XKSJlB','517538RuMbza','54vGgJhE','*Generating\x20your\x20QR\x20Code...🎲*','1437XJRbcY','697600JEugmD','*✅\x20This\x20is\x20you\x20QR\x20Code\x20🎲*\x0a\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*','react','qrcode','&format=png','316280EAXMUe','260fawTjo','513224cPjnou'];_0x327e=function(){return _0xbc7222;};return _0x327e();}const _0x36c933=_0x4dca;(function(_0x122f71,_0x4f83cf){const _0x521f54=_0x4dca,_0xd7b962=_0x122f71();while(!![]){try{const _0x21828b=parseInt(_0x521f54(0xba))/0x1*(parseInt(_0x521f54(0xb5))/0x2)+parseInt(_0x521f54(0xc1))/0x3*(-parseInt(_0x521f54(0xb2))/0x4)+parseInt(_0x521f54(0xc2))/0x5+parseInt(_0x521f54(0xbd))/0x6*(parseInt(_0x521f54(0xbe))/0x7)+parseInt(_0x521f54(0xb3))/0x8+-parseInt(_0x521f54(0xbf))/0x9*(parseInt(_0x521f54(0xb1))/0xa)+-parseInt(_0x521f54(0xb7))/0xb*(parseInt(_0x521f54(0xb6))/0xc);if(_0x21828b===_0x4f83cf)break;else _0xd7b962['push'](_0xd7b962['shift']());}catch(_0x542259){_0xd7b962['push'](_0xd7b962['shift']());}}}(_0x327e,0x1b0cb));function _0x4dca(_0x5dc6f2,_0x395266){const _0x327e71=_0x327e();return _0x4dca=function(_0x4dca68,_0x409f6c){_0x4dca68=_0x4dca68-0xad;let _0x4abb66=_0x327e71[_0x4dca68];return _0x4abb66;},_0x4dca(_0x5dc6f2,_0x395266);}const {cmd,commands}=require('../command');cmd({'pattern':_0x36c933(0xaf),'alias':[_0x36c933(0xbb)],'desc':_0x36c933(0xb8),'category':'other','filename':__filename},async(_0xddc662,_0x2f36cb,_0x52330b,{from:_0x28c0af,quoted:_0x16a723,body:_0x576aba,isCmd:_0x5d7993,command:_0x4b17f3,args:_0x27d5c1,q:_0x2f8a39,isGroup:_0x35363d,sender:_0x167254,senderNumber:_0x4b46de,botNumber2:_0x390afb,botNumber:_0x506f56,pushname:_0x1d9623,isMe:_0x268cbd,isOwner:_0x22f8cd,groupMetadata:_0x525e3c,groupName:_0x179383,participants:_0x23183a,groupAdmins:_0x3af832,isBotAdmins:_0x32d4ac,isAdmins:_0x19c174,reply:_0x153eb5})=>{const _0x4c9730=_0x36c933;try{await _0x52330b[_0x4c9730(0xae)]('🎲');if(!_0x2f8a39)return _0x153eb5(_0x4c9730(0xb4));let _0x48a72c=_0x4c9730(0xc0);await _0xddc662['sendMessage'](_0x28c0af,{'text':_0x48a72c},{'quoted':_0x2f36cb});const _0x3f6861='https://barcode.orcascan.com/?data='+_0x2f8a39+'&text='+_0x2f8a39+_0x4c9730(0xb0);let _0x2dd1d7=_0x4c9730(0xad);await _0xddc662[_0x4c9730(0xbc)](_0x28c0af,{'image':{'url':_0x3f6861},'caption':_0x2dd1d7}),await _0x52330b[_0x4c9730(0xae)]('✅');}catch(_0x2cfd66){console[_0x4c9730(0xb9)](_0x2cfd66),_0x153eb5(''+_0x2cfd66);}});
