//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ














function _0x347a(_0x503678,_0x51d846){const _0x397886=_0x3978();return _0x347a=function(_0x347ac1,_0x4df120){_0x347ac1=_0x347ac1-0xd9;let _0x419212=_0x397886[_0x347ac1];return _0x419212;},_0x347a(_0x503678,_0x51d846);}function _0x3978(){const _0x70861f=['30axAQRz','⚡','5190iOorxa','../command','3456376lqOaEa','1587675wqTWqg','ping','log','sendMessage','457114xieZzo','4UnOBOH','509764AUKyYN','13293zPwqUN','132225XUDxVI','now','../config','966180SmKgqG'];_0x3978=function(){return _0x70861f;};return _0x3978();}const _0x59d243=_0x347a;(function(_0x2ab50b,_0x38d04f){const _0x5bb4b1=_0x347a,_0xf2b688=_0x2ab50b();while(!![]){try{const _0x1adb91=-parseInt(_0x5bb4b1(0xda))/0x1+-parseInt(_0x5bb4b1(0xe9))/0x2+-parseInt(_0x5bb4b1(0xe3))/0x3*(-parseInt(_0x5bb4b1(0xe8))/0x4)+parseInt(_0x5bb4b1(0xdd))/0x5+parseInt(_0x5bb4b1(0xde))/0x6*(-parseInt(_0x5bb4b1(0xe7))/0x7)+-parseInt(_0x5bb4b1(0xe2))/0x8+parseInt(_0x5bb4b1(0xd9))/0x9*(parseInt(_0x5bb4b1(0xe0))/0xa);if(_0x1adb91===_0x38d04f)break;else _0xf2b688['push'](_0xf2b688['shift']());}catch(_0x44b9e1){_0xf2b688['push'](_0xf2b688['shift']());}}}(_0x3978,0x53d40));const config=require(_0x59d243(0xdc)),{cmd,commands}=require(_0x59d243(0xe1));cmd({'pattern':_0x59d243(0xe4),'desc':'Check\x20bot\x27s\x20response\x20time.','category':'main','react':_0x59d243(0xdf),'filename':__filename},async(_0x1b8b29,_0x85cbee,_0x591ff8,{from:_0x220b67,quoted:_0x3f7c07,body:_0x4bc33a,isCmd:_0x5dc570,command:_0x1244bf,args:_0x1aa0c8,q:_0x5ccef7,isGroup:_0x2fe6b3,sender:_0x2cc517,senderNumber:_0x579098,botNumber2:_0x103049,botNumber:_0x86d611,pushname:_0x15a318,isMe:_0x1965f8,isOwner:_0x531f6c,groupMetadata:_0x658a80,groupName:_0x2d4b7b,participants:_0x3d240a,groupAdmins:_0x3975d8,isBotAdmins:_0x30e06a,isAdmins:_0x5c82a7,reply:_0xf00f2a})=>{const _0x573a01=_0x59d243;try{const _0x1672ab=Date[_0x573a01(0xdb)](),_0x45ffdd=await _0x1b8b29[_0x573a01(0xe6)](_0x220b67,{'text':'*🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳 𝚅8 💕⃟. 𝙿𝚒𝚗𝚐𝚒𝚗𝚐...*'}),_0x46aa0e=Date[_0x573a01(0xdb)](),_0x451c70=_0x46aa0e-_0x1672ab;await _0x1b8b29['sendMessage'](_0x220b67,{'text':'🧬\x20*𝚁𝚎𝚜𝚙𝚘𝚗𝚜𝚎*\x20*𝚝𝚒𝚖𝚎*\x20:\x20'+_0x451c70+'ms'},{'quoted':_0x45ffdd});}catch(_0x14bcb7){console[_0x573a01(0xe5)](_0x14bcb7),_0xf00f2a(''+_0x14bcb7);}});
