//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











const _0x55562c=_0x22d1;(function(_0x31cc20,_0x439a64){const _0x58c11b=_0x22d1,_0x415b4d=_0x31cc20();while(!![]){try{const _0x5ad6a3=-parseInt(_0x58c11b(0x1a7))/0x1*(-parseInt(_0x58c11b(0x1a0))/0x2)+parseInt(_0x58c11b(0x19a))/0x3*(parseInt(_0x58c11b(0x1b6))/0x4)+parseInt(_0x58c11b(0x1a1))/0x5*(-parseInt(_0x58c11b(0x1b5))/0x6)+-parseInt(_0x58c11b(0x19d))/0x7*(parseInt(_0x58c11b(0x1af))/0x8)+parseInt(_0x58c11b(0x1a8))/0x9+parseInt(_0x58c11b(0x19e))/0xa*(-parseInt(_0x58c11b(0x1b3))/0xb)+-parseInt(_0x58c11b(0x1a2))/0xc*(-parseInt(_0x58c11b(0x1a9))/0xd);if(_0x5ad6a3===_0x439a64)break;else _0x415b4d['push'](_0x415b4d['shift']());}catch(_0x19c986){_0x415b4d['push'](_0x415b4d['shift']());}}}(_0x2730,0xcbe91));const command=require(_0x55562c(0x1ac)),nima=require(_0x55562c(0x1aa));function _0x22d1(_0x5acff1,_0x1eabe8){const _0x273099=_0x2730();return _0x22d1=function(_0x22d130,_0xee394){_0x22d130=_0x22d130-0x199;let _0x54ccb3=_0x273099[_0x22d130];return _0x54ccb3;},_0x22d1(_0x5acff1,_0x1eabe8);}command[_0x55562c(0x1b4)]({'pattern':_0x55562c(0x1ad),'alias':[_0x55562c(0x1ab)],'desc':_0x55562c(0x1a3),'category':_0x55562c(0x1b0)},async(_0x1a670c,_0x4c4b68,_0x8d48a,{from:_0x8aef6a,quoted:_0x4ad01f,body:_0x5d743d,isCmd:_0x4523fa,command:_0x1cd0c8,args:_0x335b9e,q:_0x5bd5a5,isGroup:_0x3f0dc8,sender:_0x1c0806,senderNumber:_0x300bb2,botNumber2:_0xf008d6,botNumber:_0x4d7fb7,pushname:_0x1ca128,isMe:_0x44deca,isOwner:_0xc5b012,groupMetadata:_0x7db0a,groupName:_0xe9687d,participants:_0x2d74f0,groupAdmins:_0x3ed471,isBotAdmins:_0x49683f,isAdmins:_0x4e521c,reply:_0x3166ae})=>{const _0x2488a2=_0x55562c;try{await _0x3166ae('```Fetching\x20...```');var _0x545381=await nima[_0x2488a2(0x19c)]();const _0x384303=_0x545381[_0x2488a2(0x1b1)];let _0x27d238=_0x2488a2(0x19b)+_0x384303[_0x2488a2(0x19f)]+_0x2488a2(0x1ae)+_0x384303[_0x2488a2(0x1a4)]+_0x2488a2(0x199);await _0x1a670c['sendMessage'](_0x8aef6a,{'image':{'url':_0x384303[_0x2488a2(0x1b7)][_0x2488a2(0x1b2)]('?')[0x0]||_0x2488a2(0x1a5)},'caption':_0x27d238},{'quoted':_0x4c4b68}),await _0x8d48a[_0x2488a2(0x1a6)]('✅');}catch(_0x167e79){console['log'](_0x167e79),_0x3166ae(''+_0x167e79);}});function _0x2730(){const _0x2ead6a=['\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20','3vbApwI','\x0a*🎟️SUHAS-MD\x20TECHNOLOGY\x20NEWS🎟️*\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x0aᴛɪᴛʟᴇ:\x20','latest_news','2819957AYKJWV','16238330emoUgm','title','1529564cMUHsU','50JXxWem','60ShhvLr','Wabetainfo\x20link\x20info\x20get.','desc','https://avatars.githubusercontent.com/u/108072422?v=4','react','1DDMFhw','6161904wWRkNJ','1838239ERcEvx','@mrnima/technology_news_info','tech','../command','technews','\x0a\x0aᴅᴇꜱᴄʀɪᴘᴛɪᴏɴ:\x20','16eZFfEX','download','result','split','11lazIyT','cmd','284010VQSsNj','6326596DPjObs','img'];_0x2730=function(){return _0x2ead6a;};return _0x2730();}
