//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











function _0x1d2b(_0x220bb1,_0x1241b7){const _0x3de13d=_0x3de1();return _0x1d2b=function(_0x1d2b46,_0x580b67){_0x1d2b46=_0x1d2b46-0x132;let _0x3a949a=_0x3de13d[_0x1d2b46];return _0x3a949a;},_0x1d2b(_0x220bb1,_0x1241b7);}const _0x509cb2=_0x1d2b;(function(_0x3e8f26,_0x8bc695){const _0x31857d=_0x1d2b,_0x2574c5=_0x3e8f26();while(!![]){try{const _0x3a48a9=parseInt(_0x31857d(0x140))/0x1+-parseInt(_0x31857d(0x142))/0x2+-parseInt(_0x31857d(0x149))/0x3+-parseInt(_0x31857d(0x137))/0x4*(-parseInt(_0x31857d(0x14a))/0x5)+parseInt(_0x31857d(0x139))/0x6+parseInt(_0x31857d(0x143))/0x7*(parseInt(_0x31857d(0x13b))/0x8)+-parseInt(_0x31857d(0x144))/0x9;if(_0x3a48a9===_0x8bc695)break;else _0x2574c5['push'](_0x2574c5['shift']());}catch(_0x153511){_0x2574c5['push'](_0x2574c5['shift']());}}}(_0x3de1,0x18d92));const axios=require(_0x509cb2(0x133)),{cmd}=require(_0x509cb2(0x13f));cmd({'pattern':'trt','desc':_0x509cb2(0x141),'react':'⚡','category':'other','filename':__filename},async(_0x33a617,_0x53351f,_0x561e8d,{from:_0xdca6d2,q:_0x464bbd,reply:_0x465d8c})=>{const _0x44a69e=_0x509cb2;try{const _0x5902f0=_0x464bbd[_0x44a69e(0x146)]('\x20');if(_0x5902f0[_0x44a69e(0x147)]<0x2)return _0x465d8c(_0x44a69e(0x135));const _0xada38e=_0x5902f0[0x0],_0x5b28b5=_0x5902f0[_0x44a69e(0x148)](0x1)[_0x44a69e(0x134)]('\x20'),_0x329b45='https://api.mymemory.translated.net/get?q='+encodeURIComponent(_0x5b28b5)+'&langpair=en|'+_0xada38e,_0xc58815=await axios[_0x44a69e(0x13a)](_0x329b45),_0x5744fc=_0xc58815[_0x44a69e(0x132)][_0x44a69e(0x13e)][_0x44a69e(0x138)],_0x429e82=_0x44a69e(0x145)+_0x5b28b5+_0x44a69e(0x13d)+_0x5744fc+_0x44a69e(0x14b)+_0xada38e['toUpperCase']()+_0x44a69e(0x13c);return _0x465d8c(_0x429e82);}catch(_0x35abc1){return console['log'](_0x35abc1),_0x465d8c(_0x44a69e(0x136));}});function _0x3de1(){const _0x5793ef=['12747kTBgSx','700974WyOQpg','\x0a🌍\x20*SUHAS-MD\x20Translation*\x20🌍\x0a\x0a🔤\x20*Original*:\x20','split','length','slice','102873SAfNdM','615obtxTR','\x0a\x0a🌐\x20*Language*:\x20','data','axios','join','❗\x20Please\x20provide\x20a\x20language\x20code\x20and\x20text.\x20Usage:\x20.translate\x20[language\x20code]\x20[text]','⚠️\x20An\x20error\x20occurred\x20data\x20while\x20translating\x20the\x20your\x20text.\x20Please\x20try\x20again\x20later🤕','1772VDdPTq','translatedText','82290wNCZIA','get','432oWppFz','\x0a\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*','\x0a\x0a🔠\x20*Translated*:\x20','responseData','../command','157554hCdSaV','🌍\x20Translate\x20text\x20between\x20languages','220274ubnzKm'];_0x3de1=function(){return _0x5793ef;};return _0x3de1();}
