//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











function _0x1775(){const _0x1d045f=['log','Fetch\x20a\x20random\x20anime\x20girl\x20image.','1223104UUnfnX','1274266snpRRI','👸\x20*𝗦𝗨𝗛𝗔𝗦-𝗠𝗗\x20𝗥𝗔𝗡𝗗𝗢𝗠\x20𝗔𝗡𝗜𝗠𝗘\x20𝗜𝗠𝗔𝗚𝗘𝗦*\x20👸\x0a\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*','get','url','animegirl','719978onAHxg','react','*Error\x20Fetching\x20Anime\x20Girl\x20image*:\x20','3JqLkBe','../command','240648PVefyd','fun','680428nQhulM','message','253855DrcapT','895235ZQHzOu','axios','sendMessage'];_0x1775=function(){return _0x1d045f;};return _0x1775();}const _0x4526b0=_0x423f;(function(_0x3d94be,_0x276e12){const _0x4fedb0=_0x423f,_0x2fcd08=_0x3d94be();while(!![]){try{const _0xcd761a=-parseInt(_0x4fedb0(0x160))/0x1+-parseInt(_0x4fedb0(0x157))/0x2*(-parseInt(_0x4fedb0(0x15a))/0x3)+-parseInt(_0x4fedb0(0x15e))/0x4+parseInt(_0x4fedb0(0x161))/0x5+parseInt(_0x4fedb0(0x15c))/0x6+parseInt(_0x4fedb0(0x167))/0x7+-parseInt(_0x4fedb0(0x166))/0x8;if(_0xcd761a===_0x276e12)break;else _0x2fcd08['push'](_0x2fcd08['shift']());}catch(_0x32f5d8){_0x2fcd08['push'](_0x2fcd08['shift']());}}}(_0x1775,0x2d00c));function _0x423f(_0x448a73,_0x37034c){const _0x1775b1=_0x1775();return _0x423f=function(_0x423fde,_0x5ede43){_0x423fde=_0x423fde-0x156;let _0xfc0532=_0x1775b1[_0x423fde];return _0xfc0532;},_0x423f(_0x448a73,_0x37034c);}const axios=require(_0x4526b0(0x162)),{cmd,commands}=require(_0x4526b0(0x15b));cmd({'pattern':_0x4526b0(0x156),'desc':_0x4526b0(0x165),'category':_0x4526b0(0x15d),'react':'👧','filename':__filename},async(_0x4bdef6,_0x1651b8,_0x4521ef,{from:_0x103428,quoted:_0x1557c6,body:_0x1882ad,isCmd:_0x123a84,command:_0x47715e,args:_0x45c4bf,q:_0x334a30,isGroup:_0x4a4502,sender:_0x323e21,senderNumber:_0x4ac470,botNumber2:_0x9c757e,botNumber:_0x33afcc,pushname:_0x4d01cf,isMe:_0x3e09e3,isOwner:_0xe6689a,groupMetadata:_0x447696,groupName:_0x48c699,participants:_0x49a1a7,groupAdmins:_0x16973f,isBotAdmins:_0x299f7f,isAdmins:_0x5a6ed1,reply:_0x522f2c})=>{const _0x7b252a=_0x4526b0;try{const _0x492977='https://api.waifu.pics/sfw/waifu',_0x564d2a=await axios[_0x7b252a(0x169)](_0x492977),_0x3c7fee=_0x564d2a['data'];await _0x4bdef6[_0x7b252a(0x163)](_0x103428,{'image':{'url':_0x3c7fee[_0x7b252a(0x16a)]},'caption':_0x7b252a(0x168)},{'quoted':_0x1651b8}),await _0x4521ef[_0x7b252a(0x158)]('✅');}catch(_0x2f0fb9){console[_0x7b252a(0x164)](_0x2f0fb9),_0x522f2c(_0x7b252a(0x159)+_0x2f0fb9[_0x7b252a(0x15f)]);}});
