//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











function _0xa27d(){const _0x22a603=['📝\x20*ᴅᴇꜱᴄʀɪᴘᴛɪᴏɴ*:\x20','15FcTRxM','Error\x20fetching\x20repository\x20data🤕:\x20','16864133WISWNS','618dvfqFE','forks_count','5566100pSeBed','📌\x20*ɴᴀᴍᴇ*:\x20','../command','1327lBwITL','788456bURgrq','https://api.github.com/repos/','data','137043ExHTVw','stargazers_count','>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*\x0a','1094SPspai','Fetch\x20information\x20about\x20a\x20GitHub\x20repository.','html_url','2470349LAzKge','⭐\x20*ꜱᴛᴀʀꜱ*:\x20','sendMessage','join','8KbOvzL','description','axios','log','12UFMZOw','other','name'];_0xa27d=function(){return _0x22a603;};return _0xa27d();}const _0x4e75c0=_0x32c1;function _0x32c1(_0x2ed5f2,_0x9c4890){const _0xa27d72=_0xa27d();return _0x32c1=function(_0x32c122,_0x3b750a){_0x32c122=_0x32c122-0xea;let _0x252087=_0xa27d72[_0x32c122];return _0x252087;},_0x32c1(_0x2ed5f2,_0x9c4890);}(function(_0x543f3f,_0xa7bd3a){const _0x268a3b=_0x32c1,_0x13fc84=_0x543f3f();while(!![]){try{const _0x2dbd39=-parseInt(_0x268a3b(0xfb))/0x1*(-parseInt(_0x268a3b(0x102))/0x2)+-parseInt(_0x268a3b(0xf6))/0x3+parseInt(_0x268a3b(0xfc))/0x4*(-parseInt(_0x268a3b(0xf3))/0x5)+parseInt(_0x268a3b(0xef))/0x6*(-parseInt(_0x268a3b(0x105))/0x7)+parseInt(_0x268a3b(0xeb))/0x8*(parseInt(_0x268a3b(0xff))/0x9)+-parseInt(_0x268a3b(0xf8))/0xa+parseInt(_0x268a3b(0xf5))/0xb;if(_0x2dbd39===_0xa7bd3a)break;else _0x13fc84['push'](_0x13fc84['shift']());}catch(_0x3d88bd){_0x13fc84['push'](_0x13fc84['shift']());}}}(_0xa27d,0x66983));const axios=require(_0x4e75c0(0xed)),{cmd,commands}=require(_0x4e75c0(0xfa));cmd({'pattern':'srepo','desc':_0x4e75c0(0x103),'category':_0x4e75c0(0xf0),'react':'🍃','filename':__filename},async(_0x193bb5,_0x4159db,_0x1972ea,{from:_0x381d1a,quoted:_0x350ac0,body:_0x1cdc5c,isCmd:_0x20db8f,command:_0x4ee753,args:_0x483e62,q:_0x15808a,isGroup:_0x5cc036,sender:_0x310ae5,senderNumber:_0x1cbc16,botNumber2:_0x38a49c,botNumber:_0x30b01b,pushname:_0x9ac0e8,isMe:_0x186d46,isOwner:_0x54827c,groupMetadata:_0x237899,groupName:_0x3a984a,participants:_0x596078,groupAdmins:_0x9cd861,isBotAdmins:_0x29b525,isAdmins:_0x18adf5,reply:_0x5429b3})=>{const _0x503d99=_0x4e75c0;try{const _0x25985a=_0x483e62[_0x503d99(0xea)]('\x20');if(!_0x25985a)return _0x5429b3('Please\x20provide\x20a\x20GitHub\x20repository\x20name\x20in\x20the\x20format\x20📌`owner/repo`.');const _0x3495c4=_0x503d99(0xfd)+_0x25985a,_0x58887b=await axios['get'](_0x3495c4),_0x17aa02=_0x58887b[_0x503d99(0xfe)];let _0x229891='📁_*𝗚𝗜𝗧𝗛𝗨𝗕\x20𝗥𝗘𝗣𝗢\x20𝗜𝗡𝗙𝗢\x20𝗕𝗬\x20𝗦𝗨𝗛𝗔𝗦-𝗠𝗗*_📁\x0a\x0a';_0x229891+=_0x503d99(0xf9)+_0x17aa02[_0x503d99(0xf1)]+'\x0a',_0x229891+='🔗\x20*ᴜʀʟ*:\x20'+_0x17aa02[_0x503d99(0x104)]+'\x0a',_0x229891+=_0x503d99(0xf2)+_0x17aa02[_0x503d99(0xec)]+'\x0a',_0x229891+=_0x503d99(0x106)+_0x17aa02[_0x503d99(0x100)]+'\x0a',_0x229891+='🍴\x20*ꜰᴏʀᴋꜱ*:\x20'+_0x17aa02[_0x503d99(0xf7)]+'\x0a',_0x229891+='\x0a',_0x229891+=_0x503d99(0x101),await _0x193bb5[_0x503d99(0x107)](_0x381d1a,{'text':_0x229891},{'quoted':_0x4159db}),await _0x1972ea['react']('✅');}catch(_0x58b2af){console[_0x503d99(0xee)](_0x58b2af),_0x5429b3(_0x503d99(0xf4)+_0x58b2af['message']);}});
