//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











const _0x35f08e=_0x22f4;function _0x36da(){const _0x462b22=['example','response','meanings','../command','576810JCYASf','synonyms','\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*','\x0a📚𝗦𝗨𝗛𝗔𝗦-𝗠𝗗\x20𝗗𝗘𝗙𝗜𝗡𝗘\x20𝗜𝗡𝗙𝗢📚\x0a\x0a📚\x20*Word*:\x20','1225994YRLUQe','define','❗\x20Please\x20provide\x20a\x20word\x20to\x20define.\x20Usage:\x20.define\x20[word]','No\x20synonyms\x20available','\x0a🔗\x20*Synonyms*:\x20','239XjGlkE','1831872zrkvsa','162sXuRaK','get','📚\x20Get\x20the\x20definition\x20of\x20a\x20word','join','1417190ihKZHf','40184xprGNX','https://api.dictionaryapi.dev/api/v2/entries/en/','definitions','1796zFMdgd','definition','⚠️\x20An\x20error\x20occurred\x20while\x20fetching\x20the\x20definition.\x20Please\x20try\x20again\x20later.','4ofwHVb','4717280sDKkdB','\x0a📝\x20*Example*:\x20'];_0x36da=function(){return _0x462b22;};return _0x36da();}function _0x22f4(_0x43888a,_0x14205f){const _0x36daa4=_0x36da();return _0x22f4=function(_0x22f445,_0x559e39){_0x22f445=_0x22f445-0x1c6;let _0x188454=_0x36daa4[_0x22f445];return _0x188454;},_0x22f4(_0x43888a,_0x14205f);}(function(_0x305381,_0x109fdb){const _0x4637ba=_0x22f4,_0x3d55e6=_0x305381();while(!![]){try{const _0x28edcd=parseInt(_0x4637ba(0x1c8))/0x1*(-parseInt(_0x4637ba(0x1d2))/0x2)+-parseInt(_0x4637ba(0x1dc))/0x3+parseInt(_0x4637ba(0x1d5))/0x4*(-parseInt(_0x4637ba(0x1ce))/0x5)+parseInt(_0x4637ba(0x1c9))/0x6+parseInt(_0x4637ba(0x1e0))/0x7+parseInt(_0x4637ba(0x1cf))/0x8*(-parseInt(_0x4637ba(0x1ca))/0x9)+parseInt(_0x4637ba(0x1d6))/0xa;if(_0x28edcd===_0x109fdb)break;else _0x3d55e6['push'](_0x3d55e6['shift']());}catch(_0x46b388){_0x3d55e6['push'](_0x3d55e6['shift']());}}}(_0x36da,0x29dae));const axios=require('axios'),{cmd}=require(_0x35f08e(0x1db));cmd({'pattern':_0x35f08e(0x1e1),'desc':_0x35f08e(0x1cc),'react':'📚','category':'other','filename':__filename},async(_0x243836,_0x4e4696,_0x1fb9e5,{from:_0x2e6cc2,q:_0x1028e5,reply:_0x193fa4})=>{const _0x1e7cf6=_0x35f08e;try{if(!_0x1028e5)return _0x193fa4(_0x1e7cf6(0x1e2));const _0x11e588=_0x1028e5,_0x386602=_0x1e7cf6(0x1d0)+_0x11e588,_0x4759e5=await axios[_0x1e7cf6(0x1cb)](_0x386602),_0x15a754=_0x4759e5['data'][0x0],_0x4e524d=_0x15a754['meanings'][0x0]['definitions'][0x0][_0x1e7cf6(0x1d3)],_0x4c3ebc=_0x15a754[_0x1e7cf6(0x1da)][0x0][_0x1e7cf6(0x1d1)][0x0][_0x1e7cf6(0x1d8)]||'No\x20example\x20available',_0x196f19=_0x15a754[_0x1e7cf6(0x1da)][0x0][_0x1e7cf6(0x1d1)][0x0][_0x1e7cf6(0x1dd)][_0x1e7cf6(0x1cd)](',\x20')||_0x1e7cf6(0x1c6),_0x465547=_0x1e7cf6(0x1df)+_0x15a754['word']+'\x0a🔍\x20*Definition*:\x20'+_0x4e524d+_0x1e7cf6(0x1d7)+_0x4c3ebc+_0x1e7cf6(0x1c7)+_0x196f19+_0x1e7cf6(0x1de);return _0x193fa4(_0x465547);}catch(_0x12ba86){console['log'](_0x12ba86);if(_0x12ba86[_0x1e7cf6(0x1d9)]&&_0x12ba86['response']['status']===0x194)return _0x193fa4('🚫\x20Word\x20not\x20found.\x20Please\x20check\x20the\x20spelling\x20and\x20try\x20again.');return _0x193fa4(_0x1e7cf6(0x1d4));}});
