//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











const _0x239942=_0x256b;function _0x1e6f(){const _0x5da68c=['1526958RCzYoh','322052khBNtr','main','3357627EFRjnw','2076840QxiWHx','log','https://telegra.ph/file/4a74175f293f8074e1893.jpg','7pKKfBc','12WKKdFe','246440GRQMwp','https://telegra.ph/file/ff229baf932900c151026.jpg','856gFyUiq','25029807TVmABe','https://telegra.ph/file/60b23c2d0bcfc0869f275.jpg','❮❮❮\x20𝐌𝐘\x20𝐒𝐔𝐇𝐀𝐒-𝐌𝐃\x20𝟒𝐊\x20𝐏𝐇𝐎𝐓𝐎𝐒🌈™\x20❯❯❯','1473ltVStS','48haaTmt','sendMessage','react'];_0x1e6f=function(){return _0x5da68c;};return _0x1e6f();}function _0x256b(_0x472564,_0x231bf8){const _0x1e6f5a=_0x1e6f();return _0x256b=function(_0x256b6e,_0x238c02){_0x256b6e=_0x256b6e-0x1b0;let _0x541277=_0x1e6f5a[_0x256b6e];return _0x541277;},_0x256b(_0x472564,_0x231bf8);}(function(_0x425fe,_0x288286){const _0x12b728=_0x256b,_0x2b17c6=_0x425fe();while(!![]){try{const _0x350583=-parseInt(_0x12b728(0x1b6))/0x1*(parseInt(_0x12b728(0x1b0))/0x2)+-parseInt(_0x12b728(0x1be))/0x3*(parseInt(_0x12b728(0x1ba))/0x4)+-parseInt(_0x12b728(0x1b3))/0x5+parseInt(_0x12b728(0x1b7))/0x6*(-parseInt(_0x12b728(0x1b2))/0x7)+-parseInt(_0x12b728(0x1bf))/0x8*(-parseInt(_0x12b728(0x1c2))/0x9)+parseInt(_0x12b728(0x1b8))/0xa+parseInt(_0x12b728(0x1bb))/0xb;if(_0x350583===_0x288286)break;else _0x2b17c6['push'](_0x2b17c6['shift']());}catch(_0x2bb833){_0x2b17c6['push'](_0x2b17c6['shift']());}}}(_0x1e6f,0xad9c3));const {cmd,commands}=require('../command');cmd({'pattern':'suhas','desc':'suhas\x20the\x20bot','category':_0x239942(0x1b1),'react':'🇱🇰','filename':__filename},async(_0x869766,_0x413e88,_0x30a575,{from:_0x236163,quoted:_0x5c5353,body:_0x4e6aa6,isCmd:_0x2ef182,command:_0x379cf2,args:_0x46d39d,q:_0x4d8713,isGroup:_0xcacf98,sender:_0x58e982,senderNumber:_0x5a9ee2,botNumber2:_0x4f4e5a,botNumber:_0x344f05,pushname:_0x1642bf,isMe:_0x18ee4f,isOwner:_0x397dec,groupMetadata:_0x8e6e1,groupName:_0x426032,participants:_0x29e352,groupAdmins:_0x119b84,isBotAdmins:_0x2354c6,isAdmins:_0x198c74,reply:_0xdeb3b8})=>{const _0x4b72f0=_0x239942;try{let _0x184a4e=_0x4b72f0(0x1bd);await _0x869766[_0x4b72f0(0x1c0)](_0x236163,{'image':{'url':_0x4b72f0(0x1bc)},'caption':_0x184a4e},{'quoted':_0x413e88}),await _0x869766['sendMessage'](_0x236163,{'image':{'url':_0x4b72f0(0x1b9)},'caption':_0x184a4e},{'quoted':_0x413e88}),await _0x869766[_0x4b72f0(0x1c0)](_0x236163,{'image':{'url':_0x4b72f0(0x1b5)},'caption':_0x184a4e},{'quoted':_0x413e88}),await _0x869766[_0x4b72f0(0x1c0)](_0x236163,{'image':{'url':'https://telegra.ph/file/008937b5ef96545fab4f3.jpg'},'caption':_0x184a4e},{'quoted':_0x413e88}),await _0x30a575[_0x4b72f0(0x1c1)]('✅');}catch(_0x4f29e2){console[_0x4b72f0(0x1b4)](_0x4f29e2),_0xdeb3b8(''+_0x4f29e2);}});
