//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ












function _0x3482(_0x8c8c4d,_0xd98c4e){const _0x32cac3=_0x32ca();return _0x3482=function(_0x34827a,_0x1d6f0d){_0x34827a=_0x34827a-0xe6;let _0x39532c=_0x32cac3[_0x34827a];return _0x39532c;},_0x3482(_0x8c8c4d,_0xd98c4e);}const _0x5898a8=_0x3482;(function(_0x59bd3a,_0xb32877){const _0x6bb598=_0x3482,_0x5b2249=_0x59bd3a();while(!![]){try{const _0x265230=-parseInt(_0x6bb598(0xf3))/0x1*(-parseInt(_0x6bb598(0xe9))/0x2)+parseInt(_0x6bb598(0xe6))/0x3*(-parseInt(_0x6bb598(0xf2))/0x4)+parseInt(_0x6bb598(0xf5))/0x5*(-parseInt(_0x6bb598(0xef))/0x6)+-parseInt(_0x6bb598(0xe7))/0x7+-parseInt(_0x6bb598(0xec))/0x8*(-parseInt(_0x6bb598(0xed))/0x9)+parseInt(_0x6bb598(0xea))/0xa+parseInt(_0x6bb598(0xf6))/0xb;if(_0x265230===_0xb32877)break;else _0x5b2249['push'](_0x5b2249['shift']());}catch(_0x38d3d8){_0x5b2249['push'](_0x5b2249['shift']());}}}(_0x32ca,0x2f9ab));const config=require(_0x5898a8(0xf0)),{cmd,commands}=require(_0x5898a8(0xeb)),{runtime}=require('../lib/functions');cmd({'pattern':_0x5898a8(0xee),'alias':[_0x5898a8(0xe8)],'desc':'check\x20up\x20time','category':_0x5898a8(0xf4),'react':'⏰','filename':__filename},async(_0x1b080e,_0x1d06f5,_0x4ee83b,{from:_0x15a603,quoted:_0x2c3473,body:_0x53894f,isCmd:_0x2b3237,command:_0x2565b5,args:_0x2d16ca,q:_0x1776af,isGroup:_0x285af3,sender:_0x1364da,senderNumber:_0x89054f,botNumber2:_0x750a21,botNumber:_0x21d925,pushname:_0x2c14f2,isMe:_0x4f6e48,isOwner:_0xc234bb,groupMetadata:_0xbedb2b,groupName:_0x1ad6b1,participants:_0x2abbc0,groupAdmins:_0x486d56,isBotAdmins:_0x3af3d5,isAdmins:_0x94078f,reply:_0x4a852b})=>{const _0x19a1f6=_0x5898a8;try{let _0x725501='\x20*🚀\x20Runtime:-\x20\x20'+runtime(process['uptime']())+_0x19a1f6(0xf1);return _0x4a852b(''+_0x725501);}catch(_0xe517df){console['log'](_0xe517df),_0x4a852b(''+_0xe517df);}});function _0x32ca(){const _0x3f1abc=['48einBLO','1066010jVCPNm','../command','22904uvXdue','603JWmEuB','runtime','142650XNKFdz','../config','*\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*\x20','34652xNxrVh','5386wotnXt','main','25HCrPWk','1816947buXqpO','81vyxRLV','315700LQHSLw','uptime'];_0x32ca=function(){return _0x3f1abc;};return _0x32ca();}
