//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











function _0x2b7f(_0x112fc6,_0x8c03a8){const _0x5ac54f=_0x5ac5();return _0x2b7f=function(_0x2b7faf,_0x3e978e){_0x2b7faf=_0x2b7faf-0xda;let _0x4d3be3=_0x5ac54f[_0x2b7faf];return _0x4d3be3;},_0x2b7f(_0x112fc6,_0x8c03a8);}const _0xdf9c8d=_0x2b7f;(function(_0x1081db,_0x2e19ed){const _0x100d8e=_0x2b7f,_0x5559c7=_0x1081db();while(!![]){try{const _0x4ed83f=parseInt(_0x100d8e(0xe0))/0x1+-parseInt(_0x100d8e(0xee))/0x2+-parseInt(_0x100d8e(0xed))/0x3*(parseInt(_0x100d8e(0xe3))/0x4)+parseInt(_0x100d8e(0xf5))/0x5+-parseInt(_0x100d8e(0xdc))/0x6*(parseInt(_0x100d8e(0xf0))/0x7)+-parseInt(_0x100d8e(0xf6))/0x8+parseInt(_0x100d8e(0xf3))/0x9;if(_0x4ed83f===_0x2e19ed)break;else _0x5559c7['push'](_0x5559c7['shift']());}catch(_0x4c8bc3){_0x5559c7['push'](_0x5559c7['shift']());}}}(_0x5ac5,0x4a3f7));const {cmd}=require(_0xdf9c8d(0xeb)),axios=require(_0xdf9c8d(0xec)),{Buffer}=require(_0xdf9c8d(0xe1)),GOOGLE_API_KEY=_0xdf9c8d(0xde),GOOGLE_CX='45b94c5cef39940d1';cmd({'pattern':'img','alias':['image','wallpaper'],'desc':_0xdf9c8d(0xdd),'react':_0xdf9c8d(0xda),'category':_0xdf9c8d(0xe5),'filename':__filename},async(_0x412bf6,_0x2bad91,_0x3896d8,{from:_0x5827c6,quoted:_0x3f974e,body:_0x2ba927,isCmd:_0x58bdef,command:_0x2de267,args:_0x3632f6,q:_0x20d42f,isGroup:_0x3216f9,sender:_0x3f60b1,senderNumber:_0x1d77ed,botNumber2:_0x188d32,botNumber:_0x3ef94f,pushname:_0x5f34d8,isMe:_0x419d02,isOwner:_0xd5554e,groupMetadata:_0x4994dd,groupName:_0x4f5dcb,participants:_0x1b4047,groupAdmins:_0x592556,isBotAdmins:_0x7ba842,isAdmins:_0xcd9e5f,reply:_0x6a72f6})=>{const _0x1ee9a1=_0xdf9c8d;try{if(!_0x20d42f)return _0x6a72f6(_0x1ee9a1(0xf4));const _0x344f12=encodeURIComponent(_0x20d42f),_0x1c661d=_0x1ee9a1(0xef)+_0x344f12+_0x1ee9a1(0xdf)+GOOGLE_CX+_0x1ee9a1(0xf7)+GOOGLE_API_KEY+'&searchType=image&num=5',_0x445140=await axios['get'](_0x1c661d),_0x3d5e55=_0x445140['data'];if(!_0x3d5e55[_0x1ee9a1(0xe8)]||_0x3d5e55[_0x1ee9a1(0xe8)][_0x1ee9a1(0xea)]===0x0)return _0x6a72f6(_0x1ee9a1(0xe6));for(let _0xec4fdc=0x0;_0xec4fdc<_0x3d5e55['items'][_0x1ee9a1(0xea)];_0xec4fdc++){const _0x1fda3f=_0x3d5e55[_0x1ee9a1(0xe8)][_0xec4fdc][_0x1ee9a1(0xf8)],_0x5f3b3c=await axios['get'](_0x1fda3f,{'responseType':_0x1ee9a1(0xdb)}),_0x3c9fcd=Buffer['from'](_0x5f3b3c[_0x1ee9a1(0xe4)],_0x1ee9a1(0xf9));await _0x412bf6[_0x1ee9a1(0xe7)](_0x5827c6,{'image':_0x3c9fcd,'caption':_0x1ee9a1(0xf2)+(_0xec4fdc+0x1)+_0x1ee9a1(0xf1)},{'quoted':_0x2bad91});}await _0x3896d8[_0x1ee9a1(0xfa)]('✅');}catch(_0x36aa5e){console[_0x1ee9a1(0xe2)](_0x36aa5e),_0x6a72f6('Error:\x20'+_0x36aa5e[_0x1ee9a1(0xe9)]);}});function _0x5ac5(){const _0x14a275=['../command','axios','1534341kIKros','770610abzUjA','https://www.googleapis.com/customsearch/v1?q=','509173LOsigt','\x20from\x20your\x20search!💗*\x0a\x0a\x20*🏝️\x20Enjoy\x20these\x20images!\x20🏝️*\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*','\x0a*💗Image\x20','16215246kQiTQq','Please\x20provide\x20a\x20search\x20query\x20for\x20the\x20image.','175630tbzKmf','3558464IhnTah','&key=','link','binary','react','🖼️','arraybuffer','18iwhrEh','Search\x20and\x20send\x20images\x20from\x20Google.','AIzaSyDebFT-uY_f82_An6bnE9WvVcgVbzwDKgU','&cx=','27076TekHpn','buffer','error','4FDYuVt','data','media','No\x20images\x20found\x20for\x20your\x20query.','sendMessage','items','message','length'];_0x5ac5=function(){return _0x14a275;};return _0x5ac5();}
