//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











const _0x36e228=_0x4951;function _0x469b(){const _0x5d8a06=['65827CNRauw','../config','4UYggyI','2577225RHrZoI','1202234IOSzIt','../command','472944DFmtbT','../lib/functions','3367536gTKTJF','1733307QIGOTO','data','28MflQbI','https://chatgptforprabath-md.vercel.app/api/gptv1?q=','gpt','21271968IklujJ','log','main'];_0x469b=function(){return _0x5d8a06;};return _0x469b();}function _0x4951(_0x1de9b6,_0x340e49){const _0x469b12=_0x469b();return _0x4951=function(_0x4951eb,_0x388821){_0x4951eb=_0x4951eb-0x1c0;let _0x3f5a5c=_0x469b12[_0x4951eb];return _0x3f5a5c;},_0x4951(_0x1de9b6,_0x340e49);}(function(_0x58b101,_0x12c7bd){const _0x42eb32=_0x4951,_0x36cf4f=_0x58b101();while(!![]){try{const _0x702545=parseInt(_0x42eb32(0x1c9))/0x1+-parseInt(_0x42eb32(0x1cd))/0x2+-parseInt(_0x42eb32(0x1c1))/0x3*(parseInt(_0x42eb32(0x1cb))/0x4)+-parseInt(_0x42eb32(0x1cc))/0x5+-parseInt(_0x42eb32(0x1c0))/0x6+parseInt(_0x42eb32(0x1c3))/0x7*(parseInt(_0x42eb32(0x1cf))/0x8)+parseInt(_0x42eb32(0x1c6))/0x9;if(_0x702545===_0x12c7bd)break;else _0x36cf4f['push'](_0x36cf4f['shift']());}catch(_0x5940ce){_0x36cf4f['push'](_0x36cf4f['shift']());}}}(_0x469b,0x64298));const config=require(_0x36e228(0x1ca)),{cmd,commands}=require(_0x36e228(0x1ce)),{fetchJson}=require(_0x36e228(0x1d0));cmd({'pattern':_0x36e228(0x1c5),'desc':'ai','category':_0x36e228(0x1c8),'react':'🧠','filename':__filename},async(_0xeb9897,_0x25b086,_0x94feba,{from:_0x3db027,quoted:_0x1009f1,body:_0xdecdd,isCmd:_0x562d54,command:_0x230898,args:_0x58358e,q:_0x56cc21,isGroup:_0x3ae11f,sender:_0x84923f,senderNumber:_0x3fc590,botNumber2:_0x3696aa,botNumber:_0x4c46ff,pushname:_0x2c38b7,isMe:_0x5a73c8,isOwner:_0x8faa69,groupMetadata:_0x3180fe,groupName:_0x333467,participants:_0x1dddd3,groupAdmins:_0x2da375,isBotAdmins:_0x453ff9,isAdmins:_0x399b77,reply:_0x3a72e4})=>{const _0x3ad9ea=_0x36e228;try{let _0x938e17=await fetchJson(_0x3ad9ea(0x1c4)+_0x56cc21);_0x3a72e4(''+_0x938e17[_0x3ad9ea(0x1c2)]);}catch(_0x564f4e){console[_0x3ad9ea(0x1c7)](_0x564f4e),_0x3a72e4(''+_0x564f4e);}});
