//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











function _0x3b71(){const _0x580e86=['378384hajnNb','owner','8EQnheg','react','17068068qfKwCU','sendMessage','main','7163856ZlRcXZ','55akkysr','17067DXIWNy','6414790tvbNqM','👨‍💻','720SCzxPZ','owner\x20the\x20bot','301654WERRBV','*⚡𝐒𝐔𝐇𝐀𝐒-𝐌𝐃⚡*\x0a\x0a>\x20*🌍𝗢𝗪𝗡𝗘𝗥\x20𝗜𝗡𝗙𝗢🌍*\x20\x0a\x0a*⚡ᴏᴡɴᴇʀ\x20ɴᴀᴍᴇ*\x20-:\x20*ꜱᴜʜᴀꜱ\x20ᴘᴀᴛʜꜱɪɴᴅᴜ\x20(ꜱᴜʜᴀꜱ\x20ʙʀᴏ)*\x0a*⚡ʏᴏᴜᴛᴜʙᴇ*\x20-:\x20https://youtube.com/@suhasbro\x0a*⚡ᴡʜᴀᴛꜱᴀᴘᴘ\x20ᴄʜᴀɴɴᴇʟ*\x20-:\x20https://whatsapp.com/channel/0029VagKNUe96H4IdMbr9f2o\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*\x0a','4139950PAXyDG','133kqubGH'];_0x3b71=function(){return _0x580e86;};return _0x3b71();}const _0x591f02=_0x52c8;(function(_0xe6fa0d,_0x3c196e){const _0x226f5c=_0x52c8,_0x399283=_0xe6fa0d();while(!![]){try{const _0x6fa01f=parseInt(_0x226f5c(0x18c))/0x1*(-parseInt(_0x226f5c(0x186))/0x2)+-parseInt(_0x226f5c(0x181))/0x3*(-parseInt(_0x226f5c(0x184))/0x4)+parseInt(_0x226f5c(0x182))/0x5+parseInt(_0x226f5c(0x18a))/0x6*(-parseInt(_0x226f5c(0x189))/0x7)+parseInt(_0x226f5c(0x191))/0x8+-parseInt(_0x226f5c(0x18e))/0x9+-parseInt(_0x226f5c(0x188))/0xa*(-parseInt(_0x226f5c(0x180))/0xb);if(_0x6fa01f===_0x3c196e)break;else _0x399283['push'](_0x399283['shift']());}catch(_0x4559e0){_0x399283['push'](_0x399283['shift']());}}}(_0x3b71,0xed18f));const {cmd,commands}=require('../command');function _0x52c8(_0x560258,_0x539292){const _0x3b7139=_0x3b71();return _0x52c8=function(_0x52c87c,_0x549de7){_0x52c87c=_0x52c87c-0x180;let _0x967490=_0x3b7139[_0x52c87c];return _0x967490;},_0x52c8(_0x560258,_0x539292);}cmd({'pattern':_0x591f02(0x18b),'desc':_0x591f02(0x185),'category':_0x591f02(0x190),'react':_0x591f02(0x183),'filename':__filename},async(_0x509910,_0xc55ae9,_0x393e97,{from:_0x2390e8,quoted:_0x112720,body:_0x5adfe6,isCmd:_0x3165c9,command:_0x100774,args:_0x3b104d,q:_0x487e21,isGroup:_0x130bdd,sender:_0x608e28,senderNumber:_0x23090a,botNumber2:_0xeddb4d,botNumber:_0x535239,pushname:_0x25c3da,isMe:_0xa21fce,isOwner:_0x3c8d56,groupMetadata:_0x3233cc,groupName:_0x2f4a1f,participants:_0x441be8,groupAdmins:_0x410c6b,isBotAdmins:_0x5bde4a,isAdmins:_0x13c3d3,reply:_0x2a09ca})=>{const _0x5d3253=_0x591f02;try{let _0x36ec94=_0x5d3253(0x187);await _0x509910[_0x5d3253(0x18f)](_0x2390e8,{'image':{'url':'https://telegra.ph/file/4a8fe45cb863594e1f1c1.jpg'},'caption':_0x36ec94},{'quoted':_0xc55ae9}),await _0x393e97[_0x5d3253(0x18d)]('✅');}catch(_0x521077){console['log'](_0x521077),_0x2a09ca(''+_0x521077);}});
