//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











const _0xec6cd3=_0x18f9;function _0x4a98(){const _0x3edab9=['data','20804TmfKmg','error','185byYIUd','urlToImage','\x20🗒️𝗦𝗨𝗛𝗔𝗦-𝗠𝗗\x20𝗡𝗘𝗪𝗦\x20𝗖𝗘𝗡𝗧𝗘𝗥🗒️\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x0a➣\x20📰\x20*','266920XOcUGB','articles','log','27qcIjKF','1496eHingo','167796EPfgvE','No\x20news\x20articles\x20found.','Error\x20fetching\x20news🤕:','121242EetVEI','news','sendMessage','245dLHuZh','get','782008GQjftX','4869753jyXtfY','url','0f2c43ab11324578a7b1709651736382','Article\x20URL:','../command','length','description','min','Get\x20the\x20latest\x20news\x20headlines.','https://newsapi.org/v2/top-headlines?country=us&apiKey=','1389046hrjzzX','axios'];_0x4a98=function(){return _0x3edab9;};return _0x4a98();}function _0x18f9(_0x37b85e,_0x28b0e6){const _0x4a98a9=_0x4a98();return _0x18f9=function(_0x18f9b6,_0x234b79){_0x18f9b6=_0x18f9b6-0x1be;let _0x385c8e=_0x4a98a9[_0x18f9b6];return _0x385c8e;},_0x18f9(_0x37b85e,_0x28b0e6);}(function(_0x5a09e0,_0x448e93){const _0x3adcd0=_0x18f9,_0xd5a5e3=_0x5a09e0();while(!![]){try{const _0x5281c7=-parseInt(_0x3adcd0(0x1dd))/0x1+-parseInt(_0x3adcd0(0x1d0))/0x2+-parseInt(_0x3adcd0(0x1c6))/0x3+-parseInt(_0x3adcd0(0x1d3))/0x4*(-parseInt(_0x3adcd0(0x1d5))/0x5)+parseInt(_0x3adcd0(0x1c0))/0x6*(-parseInt(_0x3adcd0(0x1c3))/0x7)+parseInt(_0x3adcd0(0x1c5))/0x8*(parseInt(_0x3adcd0(0x1db))/0x9)+-parseInt(_0x3adcd0(0x1d8))/0xa*(-parseInt(_0x3adcd0(0x1dc))/0xb);if(_0x5281c7===_0x448e93)break;else _0xd5a5e3['push'](_0xd5a5e3['shift']());}catch(_0x298bf7){_0xd5a5e3['push'](_0xd5a5e3['shift']());}}}(_0x4a98,0xe156b));const axios=require(_0xec6cd3(0x1d1)),{cmd}=require(_0xec6cd3(0x1ca));cmd({'pattern':_0xec6cd3(0x1c1),'desc':_0xec6cd3(0x1ce),'category':'news','react':'📌','filename':__filename},async(_0x3ed7b2,_0xba1f2f,_0x485585,{from:_0xb4ce43,reply:_0x1ac35f})=>{const _0x35f1f6=_0xec6cd3;try{const _0x248100=_0x35f1f6(0x1c8),_0x360237=await axios[_0x35f1f6(0x1c4)](_0x35f1f6(0x1cf)+_0x248100),_0x41325c=_0x360237[_0x35f1f6(0x1d2)][_0x35f1f6(0x1d9)];if(!_0x41325c[_0x35f1f6(0x1cb)])return _0x1ac35f(_0x35f1f6(0x1be));for(let _0x2976ce=0x0;_0x2976ce<Math[_0x35f1f6(0x1cd)](_0x41325c['length'],0x5);_0x2976ce++){const _0x4abcc3=_0x41325c[_0x2976ce];let _0x4adf37=_0x35f1f6(0x1d7)+_0x4abcc3['title']+'*\x0a\x0a➣\x20⚠️\x20_'+_0x4abcc3[_0x35f1f6(0x1cc)]+'_\x0a\x0a➣\x20🔗\x20_'+_0x4abcc3[_0x35f1f6(0x1c7)]+'_\x0a\x0a\x20\x20>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20';console[_0x35f1f6(0x1da)](_0x35f1f6(0x1c9),_0x4abcc3[_0x35f1f6(0x1d6)]),_0x4abcc3[_0x35f1f6(0x1d6)]?await _0x3ed7b2[_0x35f1f6(0x1c2)](_0xb4ce43,{'image':{'url':_0x4abcc3[_0x35f1f6(0x1d6)]},'caption':_0x4adf37}):await _0x3ed7b2['sendMessage'](_0xb4ce43,{'text':_0x4adf37});};}catch(_0x1df9fb){console[_0x35f1f6(0x1d4)](_0x35f1f6(0x1bf),_0x1df9fb),_0x1ac35f('Could\x20not\x20fetch\x20news.\x20Please\x20try\x20again\x20later.');}});
