//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ






const _0x83f9a4=_0x4991;(function(_0x2287d9,_0x508860){const _0x1ba60d=_0x4991,_0xb7610e=_0x2287d9();while(!![]){try{const _0x22eb6a=-parseInt(_0x1ba60d(0xd5))/0x1*(-parseInt(_0x1ba60d(0xd4))/0x2)+parseInt(_0x1ba60d(0xc8))/0x3+-parseInt(_0x1ba60d(0xc7))/0x4*(parseInt(_0x1ba60d(0xc9))/0x5)+parseInt(_0x1ba60d(0xcc))/0x6*(-parseInt(_0x1ba60d(0xca))/0x7)+parseInt(_0x1ba60d(0xc3))/0x8+-parseInt(_0x1ba60d(0xd1))/0x9+parseInt(_0x1ba60d(0xc6))/0xa*(parseInt(_0x1ba60d(0xcd))/0xb);if(_0x22eb6a===_0x508860)break;else _0xb7610e['push'](_0xb7610e['shift']());}catch(_0x48b13b){_0xb7610e['push'](_0xb7610e['shift']());}}}(_0x3845,0x60ec8));function _0x3845(){const _0x1fd473=['1298360IrYqeV','1785nBntcF','*\x0a\x0a\x20*I\x20am\x20Suhas\x20Pathsindu🙈*\x0a\x0a\x20*I\x20am\x2018\x20years\x20old\x20Boy🔞*\x0a\x0a\x20*I\x20am\x20from\x20Sri\x20Lanka🏠*\x0a\x0a\x20*I\x20am\x20Simple\x20WhatsApp\x20Bot\x20Developer👨‍💻*\x0a\x0a\x0a\x20Thank\x20You.😊\x0a\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*','1854zcjRlu','591305ugwwhk','*👋\x20Hello\x20','ALIVE_IMG','../command','3356982chxTKb','about','sendMessage','66qOBgpZ','701nmFIpi','3273816HXDvta','About\x20For\x20Suhas.','log','10uJMmHe','4AEQJAL','1867050UhjHqW'];_0x3845=function(){return _0x1fd473;};return _0x3845();}const config=require('../config'),{cmd,commands}=require(_0x83f9a4(0xd0));function _0x4991(_0x53c16f,_0x873290){const _0x384556=_0x3845();return _0x4991=function(_0x49915d,_0x4825c0){_0x49915d=_0x49915d-0xc3;let _0x456ae0=_0x384556[_0x49915d];return _0x456ae0;},_0x4991(_0x53c16f,_0x873290);}cmd({'pattern':_0x83f9a4(0xd2),'desc':_0x83f9a4(0xc4),'category':'main','react':'🧟‍♂','filename':__filename},async(_0x31687f,_0xd21cf1,_0x8254f4,{from:_0x8c67f5,quoted:_0x16956d,body:_0x3bb045,isCmd:_0x1cc14a,command:_0x36a5ea,args:_0x505b7d,q:_0x421f6d,isGroup:_0x32b05e,sender:_0x853ab6,senderNumber:_0xae7d1f,botNumber2:_0x5c0af3,botNumber:_0xc2a4f,pushname:_0x51bf96,isMe:_0x14402d,isOwner:_0x32b201,groupMetadata:_0x24e615,groupName:_0x41740e,participants:_0x5d5947,groupAdmins:_0x4c0209,isBotAdmins:_0xc002ad,isAdmins:_0x56f8c8,reply:_0x152654})=>{const _0x3ac09d=_0x83f9a4;try{let _0x3e854d=_0x3ac09d(0xce)+_0x51bf96+_0x3ac09d(0xcb);return await _0x31687f[_0x3ac09d(0xd3)](_0x8c67f5,{'image':{'url':config[_0x3ac09d(0xcf)]},'caption':_0x3e854d},{'quoted':_0xd21cf1});}catch(_0x384537){console[_0x3ac09d(0xc5)](_0x384537),_0x152654(''+_0x384537);}});
