//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ












function _0x385d(_0x56be0f,_0xd7cb21){const _0x5a11a8=_0x5a11();return _0x385d=function(_0x385da7,_0x1764f8){_0x385da7=_0x385da7-0xbc;let _0x50a991=_0x5a11a8[_0x385da7];return _0x50a991;},_0x385d(_0x56be0f,_0xd7cb21);}function _0x5a11(){const _0x290362=['💋\x20*SUHAS-MD\x20Random\x20Cute\x20Girl\x20Videos*\x20💋\x0a\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*','../command','https://widipe.com/asupandouyin','randomvideo','304830zYXNYU','2996360aCBGXZ','fun','rvid','1541736ZfnpHC','500808KCvxdF','4682XfLkPN','cutegirlvid','girlvid','757436UsVWLm','270wUqXXz','get','log','react','../lib/functions','url','1091045haSXEi'];_0x5a11=function(){return _0x290362;};return _0x5a11();}const _0x10a750=_0x385d;(function(_0xcb7916,_0xdbe999){const _0x260d9b=_0x385d,_0xdfb233=_0xcb7916();while(!![]){try{const _0xafd1a9=parseInt(_0x260d9b(0xcb))/0x1+-parseInt(_0x260d9b(0xbc))/0x2*(parseInt(_0x260d9b(0xc0))/0x3)+-parseInt(_0x260d9b(0xbf))/0x4+parseInt(_0x260d9b(0xc6))/0x5+-parseInt(_0x260d9b(0xd0))/0x6+-parseInt(_0x260d9b(0xcf))/0x7+parseInt(_0x260d9b(0xcc))/0x8;if(_0xafd1a9===_0xdbe999)break;else _0xdfb233['push'](_0xdfb233['shift']());}catch(_0x4c5700){_0xdfb233['push'](_0xdfb233['shift']());}}}(_0x5a11,0x2f51b));const axios=require('axios'),{cmd,commands}=require(_0x10a750(0xc8)),{sleep}=require(_0x10a750(0xc4));cmd({'pattern':_0x10a750(0xce),'alias':[_0x10a750(0xca),_0x10a750(0xbd),_0x10a750(0xbe),'cutegirl'],'desc':'Fetch\x20random\x20asupan\x20video.','category':_0x10a750(0xcd),'filename':__filename},async(_0x4208ba,_0x18e7ac,_0x2f0fc5,{from:_0x58f59f,quoted:_0x231ef9,body:_0x377b31,isCmd:_0x443b9f,command:_0x30ed47,args:_0x35d96a,q:_0xc7e564,isGroup:_0x2e72bc,sender:_0x278040,senderNumber:_0x115a1c,botNumber2:_0x544eb3,botNumber:_0x1f9325,pushname:_0x11fb54,isMe:_0x59c9d9,isOwner:_0x5ba171,groupMetadata:_0x368c82,groupName:_0x2b5e0d,participants:_0x37c767,groupAdmins:_0x512a78,isBotAdmins:_0x2f9920,isAdmins:_0x9e7807,reply:_0x237a89})=>{const _0x1d2f1e=_0x10a750;try{await _0x2f0fc5['react']('💋');const _0x10083b=_0x1d2f1e(0xc9),_0x177c9a=await axios[_0x1d2f1e(0xc1)](_0x10083b),_0xb21d94=_0x177c9a['data'];await _0x4208ba['sendMessage'](_0x58f59f,{'video':{'url':_0xb21d94[_0x1d2f1e(0xc5)]},'caption':_0x1d2f1e(0xc7)},{'quoted':_0x18e7ac}),await _0x2f0fc5[_0x1d2f1e(0xc3)]('✅');}catch(_0x47f089){console[_0x1d2f1e(0xc2)](_0x47f089),_0x237a89(''+_0x47f089);}});
