//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











function _0x2e24(){const _0x55562d=['2195470WtUIKP','uptime','../command','*\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*\x20','967971QaiBun','28RDGunG','3031116fCPZPd','main','runtime','../lib/functions','195401QfbIlb','log','6980MRDupk','747GPVWuP','2ZhqROF','901256CfIymo','648500ldkKme'];_0x2e24=function(){return _0x55562d;};return _0x2e24();}const _0x49e296=_0x14d3;(function(_0x246c66,_0x2f3125){const _0x56c8bb=_0x14d3,_0x3a210e=_0x246c66();while(!![]){try{const _0x4ca45c=-parseInt(_0x56c8bb(0xe9))/0x1+parseInt(_0x56c8bb(0xdc))/0x2*(parseInt(_0x56c8bb(0xe3))/0x3)+-parseInt(_0x56c8bb(0xde))/0x4+parseInt(_0x56c8bb(0xdf))/0x5+-parseInt(_0x56c8bb(0xe5))/0x6+-parseInt(_0x56c8bb(0xe4))/0x7*(-parseInt(_0x56c8bb(0xdd))/0x8)+parseInt(_0x56c8bb(0xdb))/0x9*(-parseInt(_0x56c8bb(0xeb))/0xa);if(_0x4ca45c===_0x2f3125)break;else _0x3a210e['push'](_0x3a210e['shift']());}catch(_0x402dc8){_0x3a210e['push'](_0x3a210e['shift']());}}}(_0x2e24,0x47395));const config=require('../config'),{cmd,commands}=require(_0x49e296(0xe1)),{runtime}=require(_0x49e296(0xe8));function _0x14d3(_0x3f7283,_0x482000){const _0x2e24f7=_0x2e24();return _0x14d3=function(_0x14d3fd,_0x555e59){_0x14d3fd=_0x14d3fd-0xdb;let _0xe089ee=_0x2e24f7[_0x14d3fd];return _0xe089ee;},_0x14d3(_0x3f7283,_0x482000);}cmd({'pattern':_0x49e296(0xe7),'alias':[_0x49e296(0xe0)],'desc':'check\x20up\x20time','category':_0x49e296(0xe6),'react':'⏰','filename':__filename},async(_0xd0e721,_0x5d9ce3,_0x5bf316,{from:_0x73dad3,quoted:_0x602ba2,body:_0x8ce297,isCmd:_0x2de484,command:_0x7cac3d,args:_0x309a19,q:_0x568403,isGroup:_0x68ae7,sender:_0x15e5e6,senderNumber:_0x21a7bc,botNumber2:_0x2225cc,botNumber:_0x41e73e,pushname:_0x23a0c4,isMe:_0x49b1eb,isOwner:_0x16406b,groupMetadata:_0x2347e5,groupName:_0x9c86ab,participants:_0x4c0efe,groupAdmins:_0x3861f3,isBotAdmins:_0x5ce3d9,isAdmins:_0x6c08eb,reply:_0xd5ceee})=>{const _0x36edc3=_0x49e296;try{let _0x4f2efe='\x20*🚀\x20Runtime:-\x20\x20'+runtime(process['uptime']())+_0x36edc3(0xe2);return _0xd5ceee(''+_0x4f2efe);}catch(_0xfc06d5){console[_0x36edc3(0xea)](_0xfc06d5),_0xd5ceee(''+_0xfc06d5);}});
