//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











function _0x17f2(_0x2dd618,_0x136fa7){const _0x15d799=_0x15d7();return _0x17f2=function(_0x17f21a,_0x554ae1){_0x17f21a=_0x17f21a-0xcd;let _0x196d55=_0x15d799[_0x17f21a];return _0x196d55;},_0x17f2(_0x2dd618,_0x136fa7);}const _0x230cf7=_0x17f2;(function(_0xb285cc,_0x561b10){const _0x5cfa1c=_0x17f2,_0x527dc3=_0xb285cc();while(!![]){try{const _0x2985a7=-parseInt(_0x5cfa1c(0xd0))/0x1+-parseInt(_0x5cfa1c(0xdc))/0x2+parseInt(_0x5cfa1c(0xd6))/0x3*(-parseInt(_0x5cfa1c(0xda))/0x4)+parseInt(_0x5cfa1c(0xd2))/0x5+parseInt(_0x5cfa1c(0xdf))/0x6*(parseInt(_0x5cfa1c(0xdb))/0x7)+-parseInt(_0x5cfa1c(0xd9))/0x8+parseInt(_0x5cfa1c(0xe1))/0x9*(parseInt(_0x5cfa1c(0xd4))/0xa);if(_0x2985a7===_0x561b10)break;else _0x527dc3['push'](_0x527dc3['shift']());}catch(_0x1426bd){_0x527dc3['push'](_0x527dc3['shift']());}}}(_0x15d7,0xc9b5d));const config=require(_0x230cf7(0xd3)),{cmd,commands}=require(_0x230cf7(0xd8));cmd({'pattern':_0x230cf7(0xcf),'alias':[_0x230cf7(0xe0)],'react':'🔊','desc':'mute\x20group.','category':'group','filename':__filename},async(_0x4bf4c5,_0x1e0f2e,_0x2c6a2e,{from:_0x52dba8,l:_0x4c1028,quoted:_0x5313c5,body:_0x37a870,isCmd:_0x4ee514,command:_0x13711d,args:_0x353e26,q:_0x495ec3,isGroup:_0x24426f,sender:_0x12d510,senderNumber:_0x5f0e20,botNumber2:_0x1b9148,botNumber:_0x3ab601,pushname:_0x1692d7,isMe:_0x46ecd2,isOwner:_0x3f3627,groupMetadata:_0x2d85c5,groupName:_0x907329,participants:_0x27d57a,isItzcp:_0x5ed4e2,groupAdmins:_0x1ba7a5,isBotAdmins:_0x57be9a,isAdmins:_0x3ec057,reply:_0x37f812})=>{const _0x5b1b25=_0x230cf7;try{if(!_0x3f3627||!_0x3ec057)return;if(!_0x2c6a2e['isGroup'])return _0x37f812(mg[_0x5b1b25(0xce)]);if(!_0x57be9a)return _0x37f812(mg[_0x5b1b25(0xd5)]);await _0x4bf4c5['groupSettingUpdate'](_0x2c6a2e['chat'],'not_announcement');const _0x5a782a=await _0x4bf4c5[_0x5b1b25(0xcd)](_0x2c6a2e[_0x5b1b25(0xde)],{'text':_0x5b1b25(0xd7)},{'quoted':_0x1e0f2e});return await _0x4bf4c5['sendMessage'](_0x2c6a2e[_0x5b1b25(0xde)],{'react':{'text':'🔊','key':_0x5a782a[_0x5b1b25(0xd1)]}});await _0x2c6a2e[_0x5b1b25(0xdd)]('✅');}catch(_0x234851){console['log'](_0x234851),_0x37f812('*Please\x20give\x20me\x20a\x20Addmin\x20SUHAS-MD\x20❗👻*');}});function _0x15d7(){const _0x183d48=['602fdQmWB','2439632iqtjgC','react','chat','24492VnFhOC','unlock','27rmbZFd','sendMessage','onlygroup','unmute','1025012frnBqG','key','1630610lbGQFp','../config','13211790DPEyOe','needbotadmins','18tUVDUy','*Group\x20chat\x20unmuted*\x20🔊','../command','978336KdFVTo','964924GiFWRL'];_0x15d7=function(){return _0x183d48;};return _0x15d7();}
