//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ












function _0x3b9d(){const _0x21c503=['Search\x20and\x20send\x20images\x20from\x20Google.','axios','react','binary','29615ZZmXDD','18dHxdNH','items','from','image','432KBMJgu','2lTpcFa','https://www.googleapis.com/customsearch/v1?q=','AIzaSyDebFT-uY_f82_An6bnE9WvVcgVbzwDKgU','media','25901788dZHHiH','\x20from\x20your\x20search!💗*\x0a\x0a\x20*🏝️\x20Enjoy\x20these\x20images!\x20🏝️*\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*','&cx=','3439720cXQFgE','2062284MoCzhK','3094oiCBRq','Please\x20provide\x20a\x20search\x20query\x20for\x20the\x20image.','get','827573ptttiS','Error:\x20','wallpaper','img','link','error','length','2288fWQFaq','No\x20images\x20found\x20for\x20your\x20query.','\x0a*💗Image\x20','&searchType=image&num=5','data','arraybuffer','../command','2169498QPUrMU'];_0x3b9d=function(){return _0x21c503;};return _0x3b9d();}const _0x4590b5=_0x4dfb;(function(_0x522c96,_0x416ca7){const _0x486e2c=_0x4dfb,_0x3e0e65=_0x522c96();while(!![]){try{const _0x5ed46f=-parseInt(_0x486e2c(0x18f))/0x1*(-parseInt(_0x486e2c(0x183))/0x2)+-parseInt(_0x486e2c(0x178))/0x3+-parseInt(_0x486e2c(0x18b))/0x4+-parseInt(_0x486e2c(0x17d))/0x5*(parseInt(_0x486e2c(0x182))/0x6)+parseInt(_0x486e2c(0x18c))/0x7*(-parseInt(_0x486e2c(0x196))/0x8)+parseInt(_0x486e2c(0x17e))/0x9*(-parseInt(_0x486e2c(0x18a))/0xa)+parseInt(_0x486e2c(0x187))/0xb;if(_0x5ed46f===_0x416ca7)break;else _0x3e0e65['push'](_0x3e0e65['shift']());}catch(_0x24c955){_0x3e0e65['push'](_0x3e0e65['shift']());}}}(_0x3b9d,0xab90c));function _0x4dfb(_0x3036e1,_0x28e2bc){const _0x3b9d8f=_0x3b9d();return _0x4dfb=function(_0x4dfbfb,_0x5eaaa9){_0x4dfbfb=_0x4dfbfb-0x177;let _0x17fbf6=_0x3b9d8f[_0x4dfbfb];return _0x17fbf6;},_0x4dfb(_0x3036e1,_0x28e2bc);}const {cmd}=require(_0x4590b5(0x177)),axios=require(_0x4590b5(0x17a)),{Buffer}=require('buffer'),GOOGLE_API_KEY=_0x4590b5(0x185),GOOGLE_CX='45b94c5cef39940d1';cmd({'pattern':_0x4590b5(0x192),'alias':[_0x4590b5(0x181),_0x4590b5(0x191)],'desc':_0x4590b5(0x179),'react':'🖼️','category':_0x4590b5(0x186),'filename':__filename},async(_0x4347a5,_0x491e73,_0x2390ef,{from:_0x1b9486,quoted:_0x6034b1,body:_0x13e8d0,isCmd:_0x29eea3,command:_0x8f09c2,args:_0x4143d3,q:_0x448a54,isGroup:_0x110ed2,sender:_0x109600,senderNumber:_0x2f4e40,botNumber2:_0x21bf26,botNumber:_0x3e3c59,pushname:_0x369e01,isMe:_0x245df6,isOwner:_0x92c9c9,groupMetadata:_0x3b5719,groupName:_0x155ff2,participants:_0x52f3b8,groupAdmins:_0x58b1bf,isBotAdmins:_0x2e9ca8,isAdmins:_0x3fc4de,reply:_0x5bce6e})=>{const _0x2172ae=_0x4590b5;try{if(!_0x448a54)return _0x5bce6e(_0x2172ae(0x18d));const _0x4e9959=encodeURIComponent(_0x448a54),_0x4e2c99=_0x2172ae(0x184)+_0x4e9959+_0x2172ae(0x189)+GOOGLE_CX+'&key='+GOOGLE_API_KEY+_0x2172ae(0x199),_0xa80c8a=await axios['get'](_0x4e2c99),_0x52d713=_0xa80c8a[_0x2172ae(0x19a)];if(!_0x52d713[_0x2172ae(0x17f)]||_0x52d713['items']['length']===0x0)return _0x5bce6e(_0x2172ae(0x197));for(let _0x3f8d02=0x0;_0x3f8d02<_0x52d713['items'][_0x2172ae(0x195)];_0x3f8d02++){const _0x38f00f=_0x52d713['items'][_0x3f8d02][_0x2172ae(0x193)],_0x5ccf2f=await axios[_0x2172ae(0x18e)](_0x38f00f,{'responseType':_0x2172ae(0x19b)}),_0x2bbaab=Buffer[_0x2172ae(0x180)](_0x5ccf2f[_0x2172ae(0x19a)],_0x2172ae(0x17c));await _0x4347a5['sendMessage'](_0x1b9486,{'image':_0x2bbaab,'caption':_0x2172ae(0x198)+(_0x3f8d02+0x1)+_0x2172ae(0x188)},{'quoted':_0x491e73});}await _0x2390ef[_0x2172ae(0x17b)]('✅');}catch(_0x153d6a){console[_0x2172ae(0x194)](_0x153d6a),_0x5bce6e(_0x2172ae(0x190)+_0x153d6a['message']);}});
