//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











const _0x54163d=_0x5a3c;function _0x5a3c(_0x48077e,_0x376db1){const _0x4d5f57=_0x4d5f();return _0x5a3c=function(_0x5a3c94,_0x46d585){_0x5a3c94=_0x5a3c94-0x87;let _0x57ddae=_0x4d5f57[_0x5a3c94];return _0x57ddae;},_0x5a3c(_0x48077e,_0x376db1);}(function(_0x17a3c0,_0x30dc06){const _0x5380a8=_0x5a3c,_0x4ad7b1=_0x17a3c0();while(!![]){try{const _0x540528=-parseInt(_0x5380a8(0x8a))/0x1+parseInt(_0x5380a8(0x91))/0x2*(-parseInt(_0x5380a8(0x97))/0x3)+parseInt(_0x5380a8(0x8e))/0x4*(-parseInt(_0x5380a8(0x8f))/0x5)+parseInt(_0x5380a8(0x9e))/0x6*(parseInt(_0x5380a8(0x95))/0x7)+-parseInt(_0x5380a8(0x93))/0x8*(parseInt(_0x5380a8(0x8b))/0x9)+parseInt(_0x5380a8(0x9b))/0xa*(parseInt(_0x5380a8(0xa1))/0xb)+parseInt(_0x5380a8(0x90))/0xc*(parseInt(_0x5380a8(0x89))/0xd);if(_0x540528===_0x30dc06)break;else _0x4ad7b1['push'](_0x4ad7b1['shift']());}catch(_0x3ef8ae){_0x4ad7b1['push'](_0x4ad7b1['shift']());}}}(_0x4d5f,0x71f03));function _0x4d5f(){const _0x423210=['3387eDowmO','720p\x20(HD)','react','*`Please\x20give\x20me\x20a\x20valid\x20instagram\x20link.`*','26230JSparo','>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*','find','56886mSRkgp','../command','data','143IUsUid','ig.mp4','video/mp4','To\x20download\x20instagram\x20videos.','download','*`ησ\x20∂αтα\x20ƒσυη∂.`*','4381VIYgYs','214727CVQmfs','63Dnzgxd','resolution','*`No\x20results\x20found.`*','20LvuQMT','354905hFQGcj','58980IGYaGo','1114gowSMb','*`Error\x20Obtaning\x20Data.`*','278104jySzqE','chat','161chKpEA','insta'];_0x4d5f=function(){return _0x423210;};return _0x4d5f();}const {cmd,commands}=require(_0x54163d(0x9f));cmd({'pattern':_0x54163d(0x96),'alias':['instagram'],'desc':_0x54163d(0xa4),'category':_0x54163d(0x87),'react':'📩','filename':__filename},async(_0x4a976f,_0x1d1cb0,_0x1b6c54,{from:_0x1340f1,quoted:_0x19a5a0,body:_0x22f0f8,isCmd:_0x5a1d68,command:_0x5f4c8e,args:_0x235600,q:_0x3dcf26,isGroup:_0x476942,sender:_0x273ee9,senderNumber:_0x16f2c1,botNumber2:_0x4c3886,botNumber:_0xd219df,pushname:_0x1579ec,isMe:_0x5b1a05,isOwner:_0x4775f7,groupMetadata:_0x128eba,groupName:_0x11e550,participants:_0x21d4a9,groupAdmins:_0x160183,isBotAdmins:_0x419233,isAdmins:_0x402d09,reply:_0x1ecf8c})=>{const _0x106169=_0x54163d;try{if(!_0x235600[0x0])return _0x1ecf8c(_0x106169(0x9a));await _0x1b6c54['react']('📥');let _0x317cef;try{_0x317cef=await igdl(_0x235600[0x0]);}catch(_0x4d0a92){return _0x1ecf8c(_0x106169(0x92));}let _0x478f9a=_0x317cef[_0x106169(0xa0)];if(!_0x478f9a||_0x478f9a['length']===0x0)return _0x1ecf8c(_0x106169(0x8d));let _0x2b46bf;try{_0x2b46bf=_0x478f9a['find'](_0x30d570=>_0x30d570['resolution']===_0x106169(0x98))||_0x478f9a[_0x106169(0x9d)](_0x40062c=>_0x40062c[_0x106169(0x8c)]==='360p\x20(SD)');}catch(_0x4da73f){return _0x1ecf8c('*`error\x20data\x20loss.`*');}if(!_0x2b46bf)return _0x1ecf8c(_0x106169(0x88));await _0x1b6c54['react']('⚡');let _0x25b8c3=_0x2b46bf['url'],_0x5cbe01=_0x106169(0x9c);try{await _0x4a976f['sendMessage'](_0x1b6c54[_0x106169(0x94)],{'video':{'url':_0x25b8c3},'caption':_0x5cbe01,'fileName':_0x106169(0xa2),'mimetype':_0x106169(0xa3)},{'quoted':_0x1b6c54});}catch(_0x42c5d1){return _0x1ecf8c('*`Error\x20Download\x20Video`*');await _0x1b6c54[_0x106169(0x99)]('❌');}}catch(_0x3836ed){console['log'](_0x3836ed),_0x1ecf8c(''+_0x3836ed);}});
