//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











function _0x415c(){const _0x394713=['quoted','16upBSeB','successful..👨‍💻✅','group','383850bMkRee','1375661yNkCNm','208666LTFlwv','chat','64ThrBve','sendMessage','sender','delete\x20message','notextfordel','318366VHzQiC','delete','21565ADxjbK','348084agUJiU','1790142ukonwK','.del','log'];_0x415c=function(){return _0x394713;};return _0x415c();}const _0x5584f9=_0x38dc;(function(_0x38fa21,_0xb89650){const _0x2b2775=_0x38dc,_0x274978=_0x38fa21();while(!![]){try{const _0x13e51e=parseInt(_0x2b2775(0x1b3))/0x1+-parseInt(_0x2b2775(0x1b1))/0x2+-parseInt(_0x2b2775(0x1ba))/0x3+-parseInt(_0x2b2775(0x1b5))/0x4*(-parseInt(_0x2b2775(0x1bc))/0x5)+parseInt(_0x2b2775(0x1be))/0x6+-parseInt(_0x2b2775(0x1b2))/0x7+parseInt(_0x2b2775(0x1c2))/0x8*(parseInt(_0x2b2775(0x1bd))/0x9);if(_0x13e51e===_0xb89650)break;else _0x274978['push'](_0x274978['shift']());}catch(_0x2f9b20){_0x274978['push'](_0x274978['shift']());}}}(_0x415c,0x26c5d));const config=require('../config'),{cmd,commands}=require('../command');function _0x38dc(_0x2180d6,_0x27ccc3){const _0x415ca7=_0x415c();return _0x38dc=function(_0x38dcb9,_0x4178b6){_0x38dcb9=_0x38dcb9-0x1b1;let _0x2fdc4a=_0x415ca7[_0x38dcb9];return _0x2fdc4a;},_0x38dc(_0x2180d6,_0x27ccc3);}cmd({'pattern':_0x5584f9(0x1bb),'react':'❌','alias':[','],'desc':_0x5584f9(0x1b8),'category':_0x5584f9(0x1c4),'use':_0x5584f9(0x1bf),'filename':__filename},async(_0x213afd,_0x4ec58f,_0x387314,{from:_0x12b616,l:_0x3e03a5,quoted:_0x19e8d1,body:_0x53de46,isCmd:_0x4529a1,command:_0x3661b8,args:_0x134d27,q:_0x27a467,isGroup:_0x34bd28,sender:_0x1bfe2a,senderNumber:_0x54b449,botNumber2:_0x596bb6,botNumber:_0x34bb11,pushname:_0xef8cb5,isMe:_0x45664a,isOwner:_0x2e09bc,groupMetadata:_0x836f48,groupName:_0x379879,participants:_0x333b9f,isItzcp:_0x53250d,groupAdmins:_0xdafe46,isBotAdmins:_0x53e047,isAdmins:_0x32248c,reply:_0x2f90b5})=>{const _0x1826da=_0x5584f9;if(!_0x2e09bc||!_0x32248c)return;try{if(!_0x387314[_0x1826da(0x1c1)])return _0x2f90b5(mg[_0x1826da(0x1b9)]);const _0x559baa={'remoteJid':_0x387314[_0x1826da(0x1b4)],'fromMe':![],'id':_0x387314[_0x1826da(0x1c1)]['id'],'participant':_0x387314[_0x1826da(0x1c1)][_0x1826da(0x1b7)]};await _0x213afd[_0x1826da(0x1b6)](_0x387314[_0x1826da(0x1b4)],{'delete':_0x559baa});}catch(_0x234e21){console[_0x1826da(0x1c0)](_0x234e21),_0x2f90b5(_0x1826da(0x1c3));}});
