//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ












const _0x2af66d=_0x258f;function _0x258f(_0x6cea26,_0x122c35){const _0x299860=_0x2998();return _0x258f=function(_0x258f32,_0x4f1cc9){_0x258f32=_0x258f32-0x1c9;let _0x1ac5f4=_0x299860[_0x258f32];return _0x1ac5f4;},_0x258f(_0x6cea26,_0x122c35);}function _0x2998(){const _0x19988d=['toFixed','hostname','../lib/functions','6QikarY','🗺️','41001kSAesZ','MB\x20/\x20','uptime','../command','31570kUnYlu','status','73243qugTBz','16Bfqnoi','botinfo','main','5969196OAnQkr','1283080HcPXkb','28ZbdTMo','system','*\x0a\x20\x20\x20\x20*├\x20👨‍💻Owner:-\x20SUHAS-MD🥰*\x20\x20\x20\x0a\x20\x20\x20\x20*├\x20🤖version:\x201.5.0*\x0a\x20\x20\x20\x20└──────────────────────➤\x0a\x20\x20\x20\x20\x0a\x20\x20\x20\x20>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*\x0a','heapUsed','totalmem','869904EMgpiA','┌──────────────────➤\x0a\x20\x20\x20\x20*├\x20⏳Uptime:-\x20\x20','memoryUsage','log','11POBKEF','2059267pRnTkO','*\x20\x20\x20\x20\x0a\x20\x20\x20\x20*├\x20📟Ram\x20usage:-\x20','88oZBCZw'];_0x2998=function(){return _0x19988d;};return _0x2998();}(function(_0x5a06be,_0x2a1c08){const _0x4216aa=_0x258f,_0x5a8c41=_0x5a06be();while(!![]){try{const _0x345a1b=parseInt(_0x4216aa(0x1ca))/0x1+-parseInt(_0x4216aa(0x1d0))/0x2*(parseInt(_0x4216aa(0x1e2))/0x3)+parseInt(_0x4216aa(0x1dc))/0x4*(parseInt(_0x4216aa(0x1e6))/0x5)+parseInt(_0x4216aa(0x1e0))/0x6*(-parseInt(_0x4216aa(0x1da))/0x7)+-parseInt(_0x4216aa(0x1cb))/0x8*(parseInt(_0x4216aa(0x1d5))/0x9)+parseInt(_0x4216aa(0x1cf))/0xa+parseInt(_0x4216aa(0x1d9))/0xb*(parseInt(_0x4216aa(0x1ce))/0xc);if(_0x345a1b===_0x2a1c08)break;else _0x5a8c41['push'](_0x5a8c41['shift']());}catch(_0x4923f8){_0x5a8c41['push'](_0x5a8c41['shift']());}}}(_0x2998,0x26d55));const {cmd,commands}=require(_0x2af66d(0x1e5)),os=require('os'),{runtime}=require(_0x2af66d(0x1df));cmd({'pattern':_0x2af66d(0x1d1),'alias':[_0x2af66d(0x1c9),_0x2af66d(0x1cc)],'desc':'check\x20up\x20time','category':_0x2af66d(0x1cd),'react':_0x2af66d(0x1e1),'filename':__filename},async(_0x5d56f6,_0x307164,_0x41212b,{from:_0x5da16b,quoted:_0x30b35d,body:_0x659ff4,isCmd:_0x560ff0,command:_0x5018f2,args:_0x5f4a0b,q:_0x5de1f9,isGroup:_0x385344,sender:_0x9472b9,senderNumber:_0x2854fb,botNumber2:_0x2a84ee,botNumber:_0xe4670e,pushname:_0x592d16,isMe:_0x3608dc,isOwner:_0x26876a,groupMetadata:_0x129111,groupName:_0x225d67,participants:_0x528a40,groupAdmins:_0x231dc5,isBotAdmins:_0x4d5874,isAdmins:_0x4fc8d5,reply:_0x557204})=>{const _0x5e5583=_0x2af66d;try{let _0x4f446a=_0x5e5583(0x1d6)+runtime(process[_0x5e5583(0x1e4)]())+_0x5e5583(0x1db)+(process[_0x5e5583(0x1d7)]()[_0x5e5583(0x1d3)]/0x400/0x400)[_0x5e5583(0x1dd)](0x2)+_0x5e5583(0x1e3)+Math['round'](require('os')[_0x5e5583(0x1d4)]/0x400/0x400)+'MB*\x0a\x20\x20\x20\x20*├\x20⚙️HostName:-\x20'+os[_0x5e5583(0x1de)]()+_0x5e5583(0x1d2);return _0x557204(''+_0x4f446a);}catch(_0x1f1b2f){console[_0x5e5583(0x1d8)](_0x1f1b2f),_0x557204(''+_0x1f1b2f);}});
