//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











const _0x207d2d=_0xb699;function _0x364f(){const _0x53d638=['🧠\x20Get\x20a\x20random\x20fun\x20fact','1179NpYzml','120NdHIlI','get','3EWGZpI','1384915fDQpOh','\x0a👾\x20*ꜱᴜʜᴀꜱ-ᴍᴅ\x20ʀᴀɴᴅᴏᴍ\x20ꜰᴜɴ\x20ꜰᴀᴄᴛ*\x20👾\x0a\x0a','https://uselessfacts.jsph.pl/random.json?language=en','16269820pHTose','1016540fJkBfI','\x0a\x0aIsn\x27t\x20that\x20interesting?\x20😄\x0a\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*','167055tLidGu','479308OrjNeT','text','17032SCCnJI','../command','fact','fun','462065geuMpl','axios'];_0x364f=function(){return _0x53d638;};return _0x364f();}(function(_0x1d842f,_0x258347){const _0x494f17=_0xb699,_0x2325ef=_0x1d842f();while(!![]){try{const _0x5aab5a=parseInt(_0x494f17(0x17e))/0x1+parseInt(_0x494f17(0x189))/0x2+parseInt(_0x494f17(0x184))/0x3*(-parseInt(_0x494f17(0x178))/0x4)+parseInt(_0x494f17(0x185))/0x5+parseInt(_0x494f17(0x182))/0x6*(parseInt(_0x494f17(0x177))/0x7)+parseInt(_0x494f17(0x17a))/0x8*(parseInt(_0x494f17(0x181))/0x9)+-parseInt(_0x494f17(0x188))/0xa;if(_0x5aab5a===_0x258347)break;else _0x2325ef['push'](_0x2325ef['shift']());}catch(_0x4194b0){_0x2325ef['push'](_0x2325ef['shift']());}}}(_0x364f,0x3eac4));const axios=require(_0x207d2d(0x17f)),{cmd}=require(_0x207d2d(0x17b));function _0xb699(_0x3c13db,_0x351892){const _0x364fc9=_0x364f();return _0xb699=function(_0xb69921,_0xc9951){_0xb69921=_0xb69921-0x176;let _0x399ccc=_0x364fc9[_0xb69921];return _0x399ccc;},_0xb699(_0x3c13db,_0x351892);}cmd({'pattern':_0x207d2d(0x17c),'desc':_0x207d2d(0x180),'react':'😝','category':_0x207d2d(0x17d),'filename':__filename},async(_0x404936,_0x370b73,_0x140c66,{from:_0x2d6698,q:_0x11b9e2,reply:_0x478266})=>{const _0x4d1b22=_0x207d2d;try{const _0x100130=_0x4d1b22(0x187),_0x243777=await axios[_0x4d1b22(0x183)](_0x100130),_0x265628=_0x243777['data'][_0x4d1b22(0x179)],_0x1b7679=_0x4d1b22(0x186)+_0x265628+_0x4d1b22(0x176);return _0x478266(_0x1b7679);}catch(_0x5e7d7e){return console['log'](_0x5e7d7e),_0x478266('⚠️\x20An\x20error\x20occurred\x20while\x20fetching\x20a\x20fun\x20fact.\x20Please\x20try\x20again\x20later🤕.');}});
