//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











const _0x475a47=_0x4677;(function(_0x2afda0,_0x37d06d){const _0x27e366=_0x4677,_0x4810ed=_0x2afda0();while(!![]){try{const _0x1f196a=parseInt(_0x27e366(0x1b0))/0x1+-parseInt(_0x27e366(0x1ae))/0x2*(-parseInt(_0x27e366(0x1b6))/0x3)+-parseInt(_0x27e366(0x1a6))/0x4+parseInt(_0x27e366(0x1a4))/0x5*(-parseInt(_0x27e366(0x1a8))/0x6)+parseInt(_0x27e366(0x1a5))/0x7+parseInt(_0x27e366(0x1aa))/0x8+-parseInt(_0x27e366(0x1a7))/0x9;if(_0x1f196a===_0x37d06d)break;else _0x4810ed['push'](_0x4810ed['shift']());}catch(_0x1849f4){_0x4810ed['push'](_0x4810ed['shift']());}}}(_0x28c0,0xe4956));const config=require(_0x475a47(0x1a2)),{cmd,commands}=require(_0x475a47(0x19f));function _0x28c0(){const _0x3e56bd=['11470304OtnsPN','mute','react','needbotadmins','138pOsPOl','mute\x20group.','228245ObBGaV','chat','group','*Group\x20chat\x20muted*\x20🔒','log','key','78801QWMGUr','announcement','../command','lock','groupSettingUpdate','../config','sendMessage','2103935uGEQyp','11908897klAbJI','3050776yWQWrf','27503712fLhiuV','6mEZFxk','*Please\x20give\x20me\x20a\x20Addmin\x20SUHAS-MD\x20❗👻*'];_0x28c0=function(){return _0x3e56bd;};return _0x28c0();}function _0x4677(_0xfcc54,_0x5c9023){const _0x28c0d5=_0x28c0();return _0x4677=function(_0x46775c,_0x1575e1){_0x46775c=_0x46775c-0x19e;let _0x3573ad=_0x28c0d5[_0x46775c];return _0x3573ad;},_0x4677(_0xfcc54,_0x5c9023);}cmd({'pattern':_0x475a47(0x1ab),'alias':[_0x475a47(0x1a0)],'react':'🔒','desc':_0x475a47(0x1af),'category':_0x475a47(0x1b2),'filename':__filename},async(_0x3cfcbb,_0x51ed7d,_0x2bfef8,{from:_0x5b1d94,l:_0x261d3b,quoted:_0xb9e71a,body:_0x274ed6,isCmd:_0x41257c,command:_0x39cf54,args:_0x2122e4,q:_0x36ffeb,isGroup:_0x5159b2,sender:_0x1cee47,senderNumber:_0x238b3c,botNumber2:_0x90ed5a,botNumber:_0x39e14d,pushname:_0x5e389a,isMe:_0x21078e,isOwner:_0x360a5a,groupMetadata:_0x3a87ab,groupName:_0x100bc1,participants:_0x43de55,isItzcp:_0x16abcb,groupAdmins:_0x14a250,isBotAdmins:_0x4743f0,isAdmins:_0x3a29d8,reply:_0x48be3a})=>{const _0x5d8aab=_0x475a47;try{if(!_0x360a5a||!_0x3a29d8)return;if(!_0x2bfef8['isGroup'])return _0x48be3a(mg['onlygroup']);if(!_0x4743f0)return _0x48be3a(mg[_0x5d8aab(0x1ad)]);await _0x3cfcbb[_0x5d8aab(0x1a1)](_0x2bfef8['chat'],_0x5d8aab(0x19e));const _0xe8e144=await _0x3cfcbb[_0x5d8aab(0x1a3)](_0x2bfef8[_0x5d8aab(0x1b1)],{'text':_0x5d8aab(0x1b3)},{'quoted':_0x51ed7d});return await _0x3cfcbb[_0x5d8aab(0x1a3)](_0x2bfef8['chat'],{'react':{'text':'🔒','key':_0xe8e144[_0x5d8aab(0x1b5)]}});await _0x2bfef8[_0x5d8aab(0x1ac)]('✅');}catch(_0x2d5d30){console[_0x5d8aab(0x1b4)](_0x2d5d30),_0x48be3a(_0x5d8aab(0x1a9));}});
