//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











const _0x242566=_0x5bb7;function _0x5bb7(_0x3bde67,_0x357854){const _0x681df4=_0x681d();return _0x5bb7=function(_0x5bb76c,_0x21b6a2){_0x5bb76c=_0x5bb76c-0x18a;let _0x4cbfdc=_0x681df4[_0x5bb76c];return _0x4cbfdc;},_0x5bb7(_0x3bde67,_0x357854);}(function(_0x35c6a3,_0x5ac78f){const _0x56218a=_0x5bb7,_0x1b81e3=_0x35c6a3();while(!![]){try{const _0x32c2eb=parseInt(_0x56218a(0x18f))/0x1+parseInt(_0x56218a(0x195))/0x2+-parseInt(_0x56218a(0x19d))/0x3+parseInt(_0x56218a(0x18b))/0x4*(parseInt(_0x56218a(0x18d))/0x5)+-parseInt(_0x56218a(0x19c))/0x6+-parseInt(_0x56218a(0x190))/0x7*(-parseInt(_0x56218a(0x18e))/0x8)+-parseInt(_0x56218a(0x192))/0x9;if(_0x32c2eb===_0x5ac78f)break;else _0x1b81e3['push'](_0x1b81e3['shift']());}catch(_0x4c3be0){_0x1b81e3['push'](_0x1b81e3['shift']());}}}(_0x681d,0x5d4de));const {cmd,commands}=require('../command');function _0x681d(){const _0x44c2a1=['1478696GRGjIA','663895YTSohu','7IkBVOu','sendMessage','3839967KPFVYW','❮❮❮\x20🌈𝗦𝗨𝗛𝗔𝗦-𝗠𝗗\x204𝗞\x20𝗪𝗔𝗟𝗟𝗣𝗔𝗣𝗘𝗥𝗦🌈\x20❯❯❯','https://telegra.ph/file/51b44e4b086667361061b.jpg','860852FpBOaW','main','https://telegra.ph/file/3d9732d2657d2d72dc102.jpg','https://telegra.ph/file/7d165d73f914985542537.jpg','https://telegra.ph/file/008937b5ef96545fab4f3.jpg','anime','anime\x20the\x20bot','846540LnfZEz','1746663KwPkgh','https://telegra.ph/file/b26f27aa5daaada031b90.jpg','7496NSrAek','react','675lvgTst'];_0x681d=function(){return _0x44c2a1;};return _0x681d();}cmd({'pattern':_0x242566(0x19a),'desc':_0x242566(0x19b),'category':_0x242566(0x196),'react':'⛱️','filename':__filename},async(_0x2fe46e,_0x242988,_0x14a1ab,{from:_0x3ed6fc,quoted:_0x228792,body:_0x184a8e,isCmd:_0x455c92,command:_0x100076,args:_0x111285,q:_0x17aaf6,isGroup:_0x3caeb9,sender:_0x358834,senderNumber:_0x5bce86,botNumber2:_0x470f75,botNumber:_0x45c656,pushname:_0x12330d,isMe:_0x5bb353,isOwner:_0x558400,groupMetadata:_0x3dcfff,groupName:_0x419140,participants:_0x33633d,groupAdmins:_0x3018dc,isBotAdmins:_0x33adb3,isAdmins:_0x37bba6,reply:_0x23e352})=>{const _0x4082a6=_0x242566;try{let _0x4bfa1f=_0x4082a6(0x193);await _0x2fe46e[_0x4082a6(0x191)](_0x3ed6fc,{'image':{'url':_0x4082a6(0x18a)},'caption':_0x4bfa1f},{'quoted':_0x242988}),await _0x2fe46e[_0x4082a6(0x191)](_0x3ed6fc,{'image':{'url':_0x4082a6(0x194)},'caption':_0x4bfa1f},{'quoted':_0x242988}),await _0x2fe46e[_0x4082a6(0x191)](_0x3ed6fc,{'image':{'url':_0x4082a6(0x198)},'caption':_0x4bfa1f},{'quoted':_0x242988}),await _0x2fe46e[_0x4082a6(0x191)](_0x3ed6fc,{'image':{'url':_0x4082a6(0x197)},'caption':_0x4bfa1f},{'quoted':_0x242988}),await _0x2fe46e['sendMessage'](_0x3ed6fc,{'image':{'url':'https://telegra.ph/file/8daf7e432a646f3ebe7eb.jpg'},'caption':_0x4bfa1f},{'quoted':_0x242988}),await _0x2fe46e[_0x4082a6(0x191)](_0x3ed6fc,{'image':{'url':'https://telegra.ph/file/7514b18ea89da924e7496.jpg'},'caption':_0x4bfa1f},{'quoted':_0x242988}),await _0x2fe46e[_0x4082a6(0x191)](_0x3ed6fc,{'image':{'url':'https://telegra.ph/file/ce9cb5acd2cec7693d76b.jpg'},'caption':_0x4bfa1f},{'quoted':_0x242988}),await _0x2fe46e['sendMessage'](_0x3ed6fc,{'image':{'url':_0x4082a6(0x199)},'caption':_0x4bfa1f},{'quoted':_0x242988}),await _0x14a1ab[_0x4082a6(0x18c)]('✅');}catch(_0xed1657){console['log'](_0xed1657),_0x23e352(''+_0xed1657);}});
