//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











const _0x49f9cd=_0x3090;(function(_0x3a358d,_0x30679f){const _0x40d469=_0x3090,_0x37b2c4=_0x3a358d();while(!![]){try{const _0x4c3123=-parseInt(_0x40d469(0x17f))/0x1+parseInt(_0x40d469(0x183))/0x2+-parseInt(_0x40d469(0x17e))/0x3*(parseInt(_0x40d469(0x182))/0x4)+parseInt(_0x40d469(0x18b))/0x5*(-parseInt(_0x40d469(0x181))/0x6)+parseInt(_0x40d469(0x185))/0x7+-parseInt(_0x40d469(0x18c))/0x8+parseInt(_0x40d469(0x186))/0x9;if(_0x4c3123===_0x30679f)break;else _0x37b2c4['push'](_0x37b2c4['shift']());}catch(_0x1b7a20){_0x37b2c4['push'](_0x37b2c4['shift']());}}}(_0x531a,0xec058));const {cmd}=require(_0x49f9cd(0x18d)),config=require(_0x49f9cd(0x189));let autoBioInterval;cmd({'pattern':'setautobio','desc':_0x49f9cd(0x17b),'category':_0x49f9cd(0x187),'react':'⚒️','filename':__filename},async(_0x48b8ab,_0x4e4923,_0x57a211,{from:_0x460647,isOwner:_0x388428,reply:_0x59bf1a})=>{const _0x221fe8=_0x49f9cd;if(!_0x388428)return _0x59bf1a(_0x221fe8(0x17c));config[_0x221fe8(0x184)]=!config['autoBioEnabled'],config['autoBioEnabled']?(_0x59bf1a(_0x221fe8(0x180)),startAutoBio(_0x48b8ab)):(_0x59bf1a(_0x221fe8(0x18a)),stopAutoBio());});function _0x3090(_0x505b58,_0x5c54d6){const _0x531a50=_0x531a();return _0x3090=function(_0x3090e8,_0x6c0bc1){_0x3090e8=_0x3090e8-0x17b;let _0xe02ddf=_0x531a50[_0x3090e8];return _0xe02ddf;},_0x3090(_0x505b58,_0x5c54d6);}function startAutoBio(_0x12dce3){if(autoBioInterval)clearInterval(autoBioInterval);autoBioInterval=setInterval(async()=>{const _0xb503c0=_0x3090,_0x338db7=new Date()[_0xb503c0(0x17d)](),_0x503219='👨‍💻\x20𝙒𝙤𝙧𝙡𝙙\x20𝘽𝙚𝙨𝙩\x20𝙒𝙝𝙖𝙩𝙨𝙖𝙥𝙥\x20𝘽𝙤𝙩\x20𝙎𝙐𝙃𝘼𝙎-𝙈𝘿🙈\x20𝘾𝙤𝙣𝙣𝙚𝙘𝙩𝙚𝙙\x20𝙎𝙪𝙘𝙨𝙨𝙚𝙨𝙛𝙪𝙡💥.𝘿𝙤𝙣\x27𝙩\x20𝙁𝙤𝙧𝙜𝙚𝙩\x20𝙏𝙤\x20𝙎𝙪𝙗𝙨𝙘𝙧𝙞𝙗𝙚\x20𝙈𝙚\x20𝙞𝙣\x20𝙔𝙤𝙪𝙩𝙪𝙗𝙚🔔\x20@suhasbro\x20['+_0x338db7+']\x20👨‍💻';await _0x12dce3['updateProfileStatus'](_0x503219);},0x3c*0x3e8);}function _0x531a(){const _0x11d7db=['toLocaleTimeString','3VtlUvU','639620YRNsKE','⚒️\x20AutoBIO\x20feature\x20has\x20been\x20*enabled*!\x20🔄','42VRWZRU','3929956RABomo','1066566RqDrOi','autoBioEnabled','1939063UMPBki','37741554NkgHiz','owner','log','../config','⚒️\x20AutoBIO\x20feature\x20has\x20been\x20*disabled*!\x20🚫','1115485iATLhE','6826128SmFTNn','../command','Enable\x20or\x20disable\x20the\x20AutoBIO\x20feature.','❌\x20You\x20are\x20not\x20the\x20owner!'];_0x531a=function(){return _0x11d7db;};return _0x531a();}function stopAutoBio(){const _0x263c9d=_0x49f9cd;autoBioInterval&&(clearInterval(autoBioInterval),autoBioInterval=null,console[_0x263c9d(0x188)]('⚒️\x20AutoBIO\x20feature\x20stopped.'));}
