//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











const _0x59895f=_0x18f1;(function(_0xe0156a,_0x3ff92f){const _0x144f0b=_0x18f1,_0x29f2aa=_0xe0156a();while(!![]){try{const _0x3f7f51=-parseInt(_0x144f0b(0x8a))/0x1+parseInt(_0x144f0b(0x86))/0x2+-parseInt(_0x144f0b(0x8b))/0x3+parseInt(_0x144f0b(0x81))/0x4+-parseInt(_0x144f0b(0x83))/0x5+parseInt(_0x144f0b(0x85))/0x6*(parseInt(_0x144f0b(0x87))/0x7)+-parseInt(_0x144f0b(0x8c))/0x8;if(_0x3f7f51===_0x3ff92f)break;else _0x29f2aa['push'](_0x29f2aa['shift']());}catch(_0x511245){_0x29f2aa['push'](_0x29f2aa['shift']());}}}(_0x1362,0x85223));function _0x1362(){const _0x3f7859=['log','main','../lib/functions','3582980TvdNlN','ai2','2546490hOaCxp','https://chatgptforprabath-md.vercel.app/api/gptv1?q=','12ebMbrq','1925720LEJKRN','2839641LpaQad','../config','../command','611997OguRIj','2456136ctEgho','1476872TpjLuB'];_0x1362=function(){return _0x3f7859;};return _0x1362();}const config=require(_0x59895f(0x88)),{cmd,commands}=require(_0x59895f(0x89)),{fetchJson}=require(_0x59895f(0x80));function _0x18f1(_0x446dc2,_0x31ecdd){const _0x136257=_0x1362();return _0x18f1=function(_0x18f1ab,_0x25c28a){_0x18f1ab=_0x18f1ab-0x7f;let _0x420495=_0x136257[_0x18f1ab];return _0x420495;},_0x18f1(_0x446dc2,_0x31ecdd);}cmd({'pattern':'ai','alias':['ai1',_0x59895f(0x82)],'desc':'ai','category':_0x59895f(0x7f),'react':'🧠','filename':__filename},async(_0x3161ed,_0x2b437b,_0x40c214,{from:_0x54d680,quoted:_0x2453e1,body:_0x2898df,isCmd:_0x211905,command:_0x1ac74f,args:_0x352f48,q:_0x4cb52a,isGroup:_0x122cb3,sender:_0x12c245,senderNumber:_0x2340e9,botNumber2:_0x465172,botNumber:_0x21c48f,pushname:_0x17221e,isMe:_0x9dc06e,isOwner:_0x4d922d,groupMetadata:_0x633bd,groupName:_0x1973e6,participants:_0x285404,groupAdmins:_0x418039,isBotAdmins:_0xbb7fa6,isAdmins:_0x27530c,reply:_0x220f7a})=>{const _0x12155a=_0x59895f;try{let _0x192fa9=await fetchJson(_0x12155a(0x84)+_0x4cb52a);_0x220f7a(''+_0x192fa9['data']);}catch(_0x2da0b2){console[_0x12155a(0x8d)](_0x2da0b2),_0x220f7a(''+_0x2da0b2);}});
