//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ












const _0x40a1fb=_0xc9bd;(function(_0x19ea92,_0x1ffda9){const _0x87d5a5=_0xc9bd,_0x30f2d4=_0x19ea92();while(!![]){try{const _0x6d1e59=parseInt(_0x87d5a5(0x14f))/0x1*(-parseInt(_0x87d5a5(0x148))/0x2)+-parseInt(_0x87d5a5(0x143))/0x3+-parseInt(_0x87d5a5(0x146))/0x4*(parseInt(_0x87d5a5(0x145))/0x5)+parseInt(_0x87d5a5(0x151))/0x6+-parseInt(_0x87d5a5(0x152))/0x7*(parseInt(_0x87d5a5(0x13f))/0x8)+-parseInt(_0x87d5a5(0x14e))/0x9+parseInt(_0x87d5a5(0x142))/0xa;if(_0x6d1e59===_0x1ffda9)break;else _0x30f2d4['push'](_0x30f2d4['shift']());}catch(_0x59b133){_0x30f2d4['push'](_0x30f2d4['shift']());}}}(_0xfbd3,0xcf079));const crypto=require('crypto'),{cmd}=require(_0x40a1fb(0x14c));cmd({'pattern':'gpass','alias':[_0x40a1fb(0x149)],'desc':_0x40a1fb(0x141),'category':'other','react':'🔐','filename':__filename},async(_0xa289d2,_0x1d234c,_0x59215d,{from:_0x4672ec,quoted:_0x5359be,body:_0x3582e7,isCmd:_0x4aca40,command:_0x1a08dd,args:_0x41d330,q:_0x40fa65,isGroup:_0x551521,sender:_0x415617,senderNumber:_0x1f357d,botNumber2:_0x42477d,botNumber:_0x2dc3b7,pushname:_0x4ded8f,isMe:_0x3453a4,isOwner:_0x4bf8dc,groupMetadata:_0x4099fc,groupName:_0x2f5de5,participants:_0x5e34d0,groupAdmins:_0x1bfda6,isBotAdmins:_0x1201e0,isAdmins:_0x4c73bf,reply:_0x5c0227})=>{const _0x1a4630=_0x40a1fb;try{const _0x223ba9=_0x41d330[0x0]?parseInt(_0x41d330[0x0]):0xc;if(isNaN(_0x223ba9)||_0x223ba9<0x8)return _0x5c0227(_0x1a4630(0x140));const _0x54bca8=_0x4b2bfe=>{const _0x1cd418=_0x1a4630,_0x1b026e='abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789!@#$%^&*()_+[]{}|;:,.<>?';let _0xaff9d1='';for(let _0x16e89b=0x0;_0x16e89b<_0x4b2bfe;_0x16e89b++){const _0x5bf090=crypto[_0x1cd418(0x14a)](0x0,_0x1b026e[_0x1cd418(0x144)]);_0xaff9d1+=_0x1b026e[_0x5bf090];}return _0xaff9d1;},_0xa59076=_0x54bca8(_0x223ba9),_0x4a6fce='🔐\x20*Your\x20Strong\x20Password*\x20🔐\x0a\x0aPlease\x20find\x20your\x20generated\x20password\x20below:\x0a\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*';await _0xa289d2[_0x1a4630(0x150)](_0x4672ec,{'text':_0x4a6fce},{'quoted':_0x1d234c}),await _0xa289d2[_0x1a4630(0x150)](_0x4672ec,{'text':_0xa59076},{'quoted':_0x1d234c}),await _0x59215d[_0x1a4630(0x147)]('✅');}catch(_0x129ed0){console[_0x1a4630(0x14d)](_0x129ed0),_0x5c0227(_0x1a4630(0x153)+_0x129ed0[_0x1a4630(0x14b)]);}});function _0xc9bd(_0x11da63,_0x22ab05){const _0xfbd392=_0xfbd3();return _0xc9bd=function(_0xc9bd2e,_0x41a434){_0xc9bd2e=_0xc9bd2e-0x13f;let _0x48e452=_0xfbd392[_0xc9bd2e];return _0x48e452;},_0xc9bd(_0x11da63,_0x22ab05);}function _0xfbd3(){const _0x1d1fd4=['8TNWseX','Please\x20provide\x20a\x20valid\x20length\x20for\x20the\x20password\x20(Minimum\x2008\x20Characters💦).','Generate\x20a\x20strong\x20password.','41483760IoGvmA','3458940siMUkW','length','5OGUYgD','1540948nfcsPN','react','2bZgiEd','googlepw','randomInt','message','../command','log','11553669aQJoJD','1026034YEJpWX','sendMessage','6954264mynpbg','4280045qmEROg','❌\x20Error\x20generating\x20password🤕:\x20'];_0xfbd3=function(){return _0x1d1fd4;};return _0xfbd3();}
