//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











const _0x3bb8e=_0x5bf6;(function(_0x1e4a98,_0x5a0dec){const _0x22c4c1=_0x5bf6,_0x27a0c8=_0x1e4a98();while(!![]){try{const _0x89d1e8=parseInt(_0x22c4c1(0x12c))/0x1*(-parseInt(_0x22c4c1(0x116))/0x2)+-parseInt(_0x22c4c1(0x129))/0x3+-parseInt(_0x22c4c1(0x123))/0x4+parseInt(_0x22c4c1(0x11a))/0x5*(-parseInt(_0x22c4c1(0x12a))/0x6)+parseInt(_0x22c4c1(0x121))/0x7*(-parseInt(_0x22c4c1(0x118))/0x8)+-parseInt(_0x22c4c1(0x128))/0x9*(-parseInt(_0x22c4c1(0x12b))/0xa)+parseInt(_0x22c4c1(0x120))/0xb*(parseInt(_0x22c4c1(0x117))/0xc);if(_0x89d1e8===_0x5a0dec)break;else _0x27a0c8['push'](_0x27a0c8['shift']());}catch(_0x37680f){_0x27a0c8['push'](_0x27a0c8['shift']());}}}(_0x3b6b,0xb62b1));const axios=require(_0x3bb8e(0x119)),{cmd}=require(_0x3bb8e(0x11e));function _0x3b6b(){const _0x4c5f9f=['1LxfMhP','https://api.quotable.io/random','\x22\x0a-\x20','1946606WZTALm','5124cNFeSN','770648CEkgeD','axios','6725RBPszh','error','\x0a\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*\x0a\x20\x20\x20\x20\x20\x20\x20\x20','quote','../command','author','93379ZNKNpw','70NcZBsl','get','3780188ZRuMBB','\x0a💬\x20\x22','fun','Error\x20fetching\x20quote:','content','7041303XBfoJS','58272oFuUaf','3390BpTcMm','10nHftcV'];_0x3b6b=function(){return _0x4c5f9f;};return _0x3b6b();}function _0x5bf6(_0x344ed6,_0x147155){const _0x3b6b9c=_0x3b6b();return _0x5bf6=function(_0x5bf6d5,_0x536af6){_0x5bf6d5=_0x5bf6d5-0x116;let _0x5a4678=_0x3b6b9c[_0x5bf6d5];return _0x5a4678;},_0x5bf6(_0x344ed6,_0x147155);}cmd({'pattern':_0x3bb8e(0x11d),'desc':'Get\x20a\x20random\x20inspiring\x20quote.','category':_0x3bb8e(0x125),'react':'💬','filename':__filename},async(_0x5ef49c,_0x3cc7bf,_0x44a010,{from:_0x594e05,reply:_0x2eb91d})=>{const _0xf718f6=_0x3bb8e;try{const _0x186c59=await axios[_0xf718f6(0x122)](_0xf718f6(0x12d)),_0x498d22=_0x186c59['data'],_0x43de1e=_0xf718f6(0x124)+_0x498d22[_0xf718f6(0x127)]+_0xf718f6(0x12e)+_0x498d22[_0xf718f6(0x11f)]+_0xf718f6(0x11c);return _0x2eb91d(_0x43de1e);}catch(_0x1c584e){console[_0xf718f6(0x11b)](_0xf718f6(0x126),_0x1c584e),_0x2eb91d('¢συℓ∂\x20ησт\x20ƒєт¢н\x20α\x20qυσтє.\x20ρℓєαѕє\x20тяу\x20αgαιη\x20ℓαтєя.');}});
