//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











const _0x50c0ad=_0x170b;(function(_0x5ca66f,_0xc23fc4){const _0x7a3228=_0x170b,_0x4e6777=_0x5ca66f();while(!![]){try{const _0x1d393b=-parseInt(_0x7a3228(0xe7))/0x1*(parseInt(_0x7a3228(0xdf))/0x2)+-parseInt(_0x7a3228(0xea))/0x3+-parseInt(_0x7a3228(0xd5))/0x4*(parseInt(_0x7a3228(0xd7))/0x5)+parseInt(_0x7a3228(0xd4))/0x6+parseInt(_0x7a3228(0xe1))/0x7+-parseInt(_0x7a3228(0xdc))/0x8+-parseInt(_0x7a3228(0xe6))/0x9*(-parseInt(_0x7a3228(0xd8))/0xa);if(_0x1d393b===_0xc23fc4)break;else _0x4e6777['push'](_0x4e6777['shift']());}catch(_0x228095){_0x4e6777['push'](_0x4e6777['shift']());}}}(_0x1370,0xdd65e));const axios=require(_0x50c0ad(0xd3)),{cmd,commands}=require(_0x50c0ad(0xe8));function _0x170b(_0x56adb7,_0x57b581){const _0x13709b=_0x1370();return _0x170b=function(_0x170bba,_0x5bde94){_0x170bba=_0x170bba-0xd2;let _0x3e5442=_0x13709b[_0x170bba];return _0x3e5442;},_0x170b(_0x56adb7,_0x57b581);}function _0x1370(){const _0x7a92ab=['animegirl7','3042UqFxzo','33093JwkoWM','../command','get','2122851iCKQqb','*Error\x20Fetching\x20Anime\x20Girl\x20image*:\x20','data','axios','8261970PFMWhk','2313072XEtlWw','log','5fWQsvR','3740zxtOiR','animegirl9','👸\x20*𝗦𝗨𝗛𝗔𝗦-𝗠𝗗\x20𝗥𝗔𝗡𝗗𝗢𝗠\x20𝗔𝗡𝗜𝗠𝗘\x20𝗜𝗠𝗔𝗚𝗘𝗦*\x20👸\x0a\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*','animegirl1','3313888JirdAG','fun','animegirl5','38BoTMAF','animegirl8','12126289uwQbfx','https://api.waifu.pics/sfw/waifu','animegirl3','react'];_0x1370=function(){return _0x7a92ab;};return _0x1370();}cmd({'pattern':_0x50c0ad(0xdb),'alias':['animegirl2',_0x50c0ad(0xe3),'animegirl4',_0x50c0ad(0xde),'animegirl6',_0x50c0ad(0xe5),_0x50c0ad(0xe0),_0x50c0ad(0xd9),'animegirl10'],'desc':'Fetch\x20a\x20random\x20anime\x20girl\x20image.','category':_0x50c0ad(0xdd),'react':'👧','filename':__filename},async(_0x4052ed,_0xb91775,_0x1aa745,{from:_0x62bee,quoted:_0x2f4628,body:_0x1618ac,isCmd:_0xdaac23,command:_0x1d58c5,args:_0x7c76f5,q:_0x12c428,isGroup:_0x13f542,sender:_0x419731,senderNumber:_0x176366,botNumber2:_0x22af85,botNumber:_0x475f00,pushname:_0x3c8d27,isMe:_0x2fbb83,isOwner:_0x5960a5,groupMetadata:_0x555da7,groupName:_0x353715,participants:_0x21cfdc,groupAdmins:_0x13b7c6,isBotAdmins:_0x409429,isAdmins:_0x55354d,reply:_0x22ed02})=>{const _0x36ac87=_0x50c0ad;try{const _0x47f1d7=_0x36ac87(0xe2),_0x3ae92a=await axios[_0x36ac87(0xe9)](_0x47f1d7),_0x1a3f4a=_0x3ae92a[_0x36ac87(0xd2)];await _0x4052ed['sendMessage'](_0x62bee,{'image':{'url':_0x1a3f4a['url']},'caption':_0x36ac87(0xda)},{'quoted':_0xb91775}),await _0x1aa745[_0x36ac87(0xe4)]('✅');}catch(_0x26b105){console[_0x36ac87(0xd6)](_0x26b105),_0x22ed02(_0x36ac87(0xeb)+_0x26b105['message']);}});
