//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ












const _0x204314=_0x2a67;(function(_0xca8b7,_0x3016ba){const _0x501430=_0x2a67,_0x1ae295=_0xca8b7();while(!![]){try{const _0x37d7f2=-parseInt(_0x501430(0x163))/0x1*(parseInt(_0x501430(0x170))/0x2)+parseInt(_0x501430(0x167))/0x3+-parseInt(_0x501430(0x16b))/0x4*(-parseInt(_0x501430(0x15e))/0x5)+parseInt(_0x501430(0x155))/0x6*(parseInt(_0x501430(0x16c))/0x7)+-parseInt(_0x501430(0x160))/0x8*(-parseInt(_0x501430(0x15b))/0x9)+parseInt(_0x501430(0x165))/0xa+-parseInt(_0x501430(0x161))/0xb*(parseInt(_0x501430(0x16e))/0xc);if(_0x37d7f2===_0x3016ba)break;else _0x1ae295['push'](_0x1ae295['shift']());}catch(_0x45396){_0x1ae295['push'](_0x1ae295['shift']());}}}(_0x17e2,0x87535));function _0x2a67(_0x21d1ee,_0x3d38f1){const _0x17e2ef=_0x17e2();return _0x2a67=function(_0x2a6769,_0x3521dd){_0x2a6769=_0x2a6769-0x155;let _0x50b9e5=_0x17e2ef[_0x2a6769];return _0x50b9e5;},_0x2a67(_0x21d1ee,_0x3d38f1);}const command=require(_0x204314(0x159)),nima=require('@mrnima/technology_news_info');function _0x17e2(){const _0x48e78e=['title','88OYIyan','55lLEmCY','technews','176212FWnpLh','https://avatars.githubusercontent.com/u/108072422?v=4','2979910lPeTcr','tech','2483325pnyhfc','split','cmd','img','651964LoBcIx','14gMLFMd','download','2550948wtnrvB','```Fetching\x20...```','8ZAIBjd','801066dRMlFN','sendMessage','Wabetainfo\x20link\x20info\x20get.','\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20','../command','log','360225ypKeDD','\x0a*🎟️SUHAS-MD\x20TECHNOLOGY\x20NEWS🎟️*\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x0aᴛɪᴛʟᴇ:\x20','react','15xxPjCk'];_0x17e2=function(){return _0x48e78e;};return _0x17e2();}command[_0x204314(0x169)]({'pattern':_0x204314(0x162),'alias':[_0x204314(0x166)],'desc':_0x204314(0x157),'category':_0x204314(0x16d)},async(_0xa2c0f3,_0x5da5e,_0x55e48c,{from:_0x254550,quoted:_0x11c93f,body:_0x164ae4,isCmd:_0x5af286,command:_0x313885,args:_0x397a46,q:_0x3930f9,isGroup:_0x25f2f6,sender:_0x3dd208,senderNumber:_0x163148,botNumber2:_0x33b328,botNumber:_0x1997b2,pushname:_0x1d6d74,isMe:_0x4070af,isOwner:_0x5cc0d4,groupMetadata:_0x4be955,groupName:_0x235e9,participants:_0x22ec7a,groupAdmins:_0x5165ef,isBotAdmins:_0x38b370,isAdmins:_0x251a32,reply:_0x16a518})=>{const _0x1c9d5d=_0x204314;try{await _0x16a518(_0x1c9d5d(0x16f));var _0x2ac183=await nima['latest_news']();const _0x16c624=_0x2ac183['result'];let _0x33e370=_0x1c9d5d(0x15c)+_0x16c624[_0x1c9d5d(0x15f)]+'\x0a\x0aᴅᴇꜱᴄʀɪᴘᴛɪᴏɴ:\x20'+_0x16c624['desc']+_0x1c9d5d(0x158);await _0xa2c0f3[_0x1c9d5d(0x156)](_0x254550,{'image':{'url':_0x16c624[_0x1c9d5d(0x16a)][_0x1c9d5d(0x168)]('?')[0x0]||_0x1c9d5d(0x164)},'caption':_0x33e370},{'quoted':_0x5da5e}),await _0x55e48c[_0x1c9d5d(0x15d)]('✅');}catch(_0x1ff43b){console[_0x1c9d5d(0x15a)](_0x1ff43b),_0x16a518(''+_0x1ff43b);}});
