//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











function _0x58cf(_0x5be7bc,_0x453ba4){const _0x350cc9=_0x350c();return _0x58cf=function(_0x58cf43,_0x281c99){_0x58cf43=_0x58cf43-0x1dc;let _0x51320a=_0x350cc9[_0x58cf43];return _0x51320a;},_0x58cf(_0x5be7bc,_0x453ba4);}const _0x1ee9cf=_0x58cf;(function(_0x3212e6,_0x4c5bac){const _0x1ae1e5=_0x58cf,_0x1bbcee=_0x3212e6();while(!![]){try{const _0xd96dcd=parseInt(_0x1ae1e5(0x1e9))/0x1+-parseInt(_0x1ae1e5(0x1e7))/0x2+parseInt(_0x1ae1e5(0x1dd))/0x3+parseInt(_0x1ae1e5(0x1df))/0x4+parseInt(_0x1ae1e5(0x1ea))/0x5+parseInt(_0x1ae1e5(0x1ec))/0x6+-parseInt(_0x1ae1e5(0x1eb))/0x7*(parseInt(_0x1ae1e5(0x1e3))/0x8);if(_0xd96dcd===_0x4c5bac)break;else _0x1bbcee['push'](_0x1bbcee['shift']());}catch(_0x4f7ff1){_0x1bbcee['push'](_0x1bbcee['shift']());}}}(_0x350c,0xaf015));const config=require(_0x1ee9cf(0x1e8)),{cmd,commands}=require(_0x1ee9cf(0x1e5));function _0x350c(){const _0x596834=['8KbIAyJ','\x20*👋\x20Hello.How\x20are\x20You?\x20','../command','react','2265874TGaLCq','../config','812373IhamYW','2420360JKAHiq','2286473YcwGWC','4774632DJVvvl','support','main','250017iQssLo','To\x20get\x20the\x20bot\x20informations.','3364SGxCip','log','sendMessage','*\x0a\x0a*🦄\x20*SUHAS-MD\x20Support\x20Channels*\x20🦄\x0a\x0a*🌈Whatsapp\x20Channel\x20Link:*\x20➸\x20https://whatsapp.com/channel/0029VagKNUe96H4IdMbr9f2o\x0a\x0a*🌈YouTube\x20Channel\x20Link:*\x20➸\x20https://youtube.com/@suhasbro\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*'];_0x350c=function(){return _0x596834;};return _0x350c();}cmd({'pattern':_0x1ee9cf(0x1ed),'desc':_0x1ee9cf(0x1de),'react':'😸','category':_0x1ee9cf(0x1dc),'filename':__filename},async(_0x57fefb,_0xb2a8e5,_0x25d886,{from:_0x383342,quoted:_0x51b4de,body:_0x1a31dc,isCmd:_0x2a2185,command:_0x2634ee,args:_0x450b2f,q:_0x254a31,isGroup:_0x16d45,sender:_0x4df466,senderNumber:_0x228f2f,botNumber2:_0x1acfa4,botNumber:_0x48f599,pushname:_0x45871d,isMe:_0x36db55,isOwner:_0x2d02e9,groupMetadata:_0x2e0b09,groupName:_0x4612bd,participants:_0x2dfef4,groupAdmins:_0x5712ee,isBotAdmins:_0x5d6464,isAdmins:_0x1b9735,reply:_0x1dabe2})=>{const _0x304b47=_0x1ee9cf;try{let _0x5d913=_0x304b47(0x1e4)+_0x45871d+_0x304b47(0x1e2);return await _0x57fefb[_0x304b47(0x1e1)](_0x383342,{'image':{'url':config['ALIVE_IMG']},'caption':_0x5d913},{'quoted':_0xb2a8e5});await _0x25d886[_0x304b47(0x1e6)]('✅');}catch(_0x5a58a9){console[_0x304b47(0x1e0)](_0x5a58a9),_0x1dabe2(''+_0x5a58a9);}});
