//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











const _0x5e75c9=_0x5c16;function _0x4303(){const _0x4f985e=['toFixed','18QRFtZB','142160yjdmsU','main','system','18DdVsDC','status','12BBRyNU','375794aDvDkw','572LsOUjF','217435LqzlTy','┌──────────────────➤\x0a\x20\x20\x20\x20*├\x20⏳Uptime:-\x20\x20','869936vDqHmB','🗺️','check\x20up\x20time','heapUsed','memoryUsage','98212vKXbQz','totalmem','../lib/functions','round','botinfo','3090514dWBgJE','hostname','log','uptime','95724kJbQrq'];_0x4303=function(){return _0x4f985e;};return _0x4303();}function _0x5c16(_0x4dee1c,_0x5e0dc2){const _0x430396=_0x4303();return _0x5c16=function(_0x5c16f9,_0x4a249f){_0x5c16f9=_0x5c16f9-0x128;let _0x6ce45d=_0x430396[_0x5c16f9];return _0x6ce45d;},_0x5c16(_0x4dee1c,_0x5e0dc2);}(function(_0x69ef23,_0x487606){const _0x12d0ff=_0x5c16,_0x3280ef=_0x69ef23();while(!![]){try{const _0x382711=-parseInt(_0x12d0ff(0x129))/0x1+parseInt(_0x12d0ff(0x132))/0x2+-parseInt(_0x12d0ff(0x12b))/0x3*(-parseInt(_0x12d0ff(0x13b))/0x4)+-parseInt(_0x12d0ff(0x134))/0x5*(-parseInt(_0x12d0ff(0x131))/0x6)+parseInt(_0x12d0ff(0x140))/0x7+parseInt(_0x12d0ff(0x136))/0x8*(parseInt(_0x12d0ff(0x12f))/0x9)+parseInt(_0x12d0ff(0x12c))/0xa*(-parseInt(_0x12d0ff(0x133))/0xb);if(_0x382711===_0x487606)break;else _0x3280ef['push'](_0x3280ef['shift']());}catch(_0x2d7203){_0x3280ef['push'](_0x3280ef['shift']());}}}(_0x4303,0x3c1cb));const {cmd,commands}=require('../command'),os=require('os'),{runtime}=require(_0x5e75c9(0x13d));cmd({'pattern':_0x5e75c9(0x12e),'alias':[_0x5e75c9(0x130),_0x5e75c9(0x13f)],'desc':_0x5e75c9(0x138),'category':_0x5e75c9(0x12d),'react':_0x5e75c9(0x137),'filename':__filename},async(_0x17044a,_0x24d256,_0xf55df4,{from:_0x1a02b4,quoted:_0x575ad1,body:_0x3286cc,isCmd:_0x38c7cb,command:_0x4a4c0f,args:_0x7e686f,q:_0x42b3d5,isGroup:_0x4f7826,sender:_0xe752f4,senderNumber:_0xcd8628,botNumber2:_0x10e9fc,botNumber:_0x258733,pushname:_0x1473d4,isMe:_0x3e3b10,isOwner:_0x2f0518,groupMetadata:_0x103085,groupName:_0xb96512,participants:_0x153c0c,groupAdmins:_0x41a246,isBotAdmins:_0x1f3c72,isAdmins:_0x13ad73,reply:_0x1e8b5d})=>{const _0x3e2485=_0x5e75c9;try{let _0x4b3ef9=_0x3e2485(0x135)+runtime(process[_0x3e2485(0x128)]())+'*\x20\x20\x20\x20\x0a\x20\x20\x20\x20*├\x20📟Ram\x20usage:-\x20'+(process[_0x3e2485(0x13a)]()[_0x3e2485(0x139)]/0x400/0x400)[_0x3e2485(0x12a)](0x2)+'MB\x20/\x20'+Math[_0x3e2485(0x13e)](require('os')[_0x3e2485(0x13c)]/0x400/0x400)+'MB*\x0a\x20\x20\x20\x20*├\x20⚙️HostName:-\x20'+os[_0x3e2485(0x141)]()+'*\x0a\x20\x20\x20\x20*├\x20👨‍💻Owner:-\x20SUHAS-MD🥰*\x20\x20\x20\x0a\x20\x20\x20\x20*├\x20🤖version:\x201.5.0*\x0a\x20\x20\x20\x20└──────────────────────➤\x0a\x20\x20\x20\x20\x0a\x20\x20\x20\x20>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*\x0a';return _0x1e8b5d(''+_0x4b3ef9);}catch(_0x5f0850){console[_0x3e2485(0x142)](_0x5f0850),_0x1e8b5d(''+_0x5f0850);}});
