//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ












function _0x34fa(_0x28d79e,_0x3d64fc){const _0x67c58e=_0x67c5();return _0x34fa=function(_0x34fa2c,_0x3f2cea){_0x34fa2c=_0x34fa2c-0x7b;let _0x4c6695=_0x67c58e[_0x34fa2c];return _0x4c6695;},_0x34fa(_0x28d79e,_0x3d64fc);}function _0x67c5(){const _0x148483=['toString','<search\x20query>','slice','\x20\x20\x20Channel:\x20','\x20\x20\x20Uploaded:\x20','\x0a\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*','ytsearch','name','Please\x20provide\x20a\x20search\x20query\x20!','75300TZTDcu','191955eSCqQN','No\x20videos\x20found\x20for\x20the\x20given\x20query.','search','1439259XLBqfU','38072FhYsaM','error','547806eMqfWk','Error\x20in\x20YouTube\x20search:','timestamp','length','join','\x20\x20\x20Link:\x20','.\x20*','title','duration','videos','author','toFixed','\x0aShowing\x20top\x2020\x20results\x20for\x20\x22','url','Search\x20for\x20YouTube\x20videos','yts','To\x20watch,\x20click\x20on\x20the\x20video\x20link\x20or\x20use\x20the\x20command:\x0a','views','1301952DbCDmw','413mBRBjo','863024apZTJQ','ago'];_0x67c5=function(){return _0x148483;};return _0x67c5();}const _0x19c85f=_0x34fa;(function(_0x116785,_0x3d58a4){const _0x4b2613=_0x34fa,_0x417d19=_0x116785();while(!![]){try{const _0xae261b=parseInt(_0x4b2613(0x8f))/0x1+parseInt(_0x4b2613(0x95))/0x2+-parseInt(_0x4b2613(0x92))/0x3+parseInt(_0x4b2613(0x83))/0x4+-parseInt(_0x4b2613(0x8e))/0x5+-parseInt(_0x4b2613(0x81))/0x6+-parseInt(_0x4b2613(0x82))/0x7*(-parseInt(_0x4b2613(0x93))/0x8);if(_0xae261b===_0x3d58a4)break;else _0x417d19['push'](_0x417d19['shift']());}catch(_0x126788){_0x417d19['push'](_0x417d19['shift']());}}}(_0x67c5,0x3d2de));const {cmd}=require('../command'),yts=require('yt-search');cmd({'pattern':_0x19c85f(0x7e),'alias':['youtubesearch',_0x19c85f(0x8b)],'desc':_0x19c85f(0x7d),'category':_0x19c85f(0x91),'react':'🔍','filename':__filename,'use':_0x19c85f(0x86)},async(_0x2a8837,_0x59314e,_0x7e9460,{from:_0x5b208f,args:_0x48343a,reply:_0x1f8fcd})=>{const _0xa3be62=_0x19c85f;if(!_0x48343a[0x0])return _0x1f8fcd(_0xa3be62(0x8d));const _0xa4194=_0x48343a[_0xa3be62(0x99)]('\x20');try{const _0x178368=await yts(_0xa4194);if(!_0x178368[_0xa3be62(0x9e)][_0xa3be62(0x98)])return _0x1f8fcd(_0xa3be62(0x90));let _0xa59933='*YouTube\x20Search\x20Results:*\x0a\x0a';_0x178368[_0xa3be62(0x9e)][_0xa3be62(0x87)](0x0,0x14)['forEach']((_0x816910,_0x20b09b)=>{const _0x2f0e2d=_0xa3be62;_0xa59933+=_0x20b09b+0x1+_0x2f0e2d(0x9b)+_0x816910[_0x2f0e2d(0x9c)]+'*\x0a',_0xa59933+=_0x2f0e2d(0x88)+_0x816910[_0x2f0e2d(0x9f)][_0x2f0e2d(0x8c)]+'\x0a',_0xa59933+='\x20\x20\x20Duration:\x20'+_0x816910[_0x2f0e2d(0x9d)][_0x2f0e2d(0x97)]+'\x0a',_0xa59933+='\x20\x20\x20Views:\x20'+formatNumber(_0x816910[_0x2f0e2d(0x80)])+'\x0a',_0xa59933+=_0x2f0e2d(0x89)+_0x816910[_0x2f0e2d(0x84)]+'\x0a',_0xa59933+=_0x2f0e2d(0x9a)+_0x816910[_0x2f0e2d(0x7c)]+_0x2f0e2d(0x8a);}),_0xa59933+=_0xa3be62(0x7b)+_0xa4194+'\x22\x0a',_0xa59933+=_0xa3be62(0x7f),await _0x2a8837['sendMessage'](_0x5b208f,{'text':_0xa59933},{'quoted':_0x59314e});}catch(_0x35a5a2){console[_0xa3be62(0x94)](_0xa3be62(0x96),_0x35a5a2),_0x1f8fcd('❌\x20An\x20error\x20occurred\x20while\x20searching\x20YouTube.\x20Please\x20try\x20again\x20later.');}});function formatNumber(_0x1409ad){const _0x26a745=_0x19c85f;if(_0x1409ad>=0xf4240)return(_0x1409ad/0xf4240)[_0x26a745(0xa0)](0x1)+'M';else{if(_0x1409ad>=0x3e8)return(_0x1409ad/0x3e8)[_0x26a745(0xa0)](0x1)+'K';}return _0x1409ad[_0x26a745(0x85)]();}
