//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











const _0xa98d68=_0x1d50;(function(_0x55a78d,_0x5ce71c){const _0xde1da=_0x1d50,_0xd2e45=_0x55a78d();while(!![]){try{const _0x59a660=parseInt(_0xde1da(0xd4))/0x1+parseInt(_0xde1da(0xcb))/0x2*(parseInt(_0xde1da(0xca))/0x3)+parseInt(_0xde1da(0xc7))/0x4*(-parseInt(_0xde1da(0xd6))/0x5)+-parseInt(_0xde1da(0xc9))/0x6*(-parseInt(_0xde1da(0xcf))/0x7)+parseInt(_0xde1da(0xc3))/0x8+-parseInt(_0xde1da(0xd3))/0x9+parseInt(_0xde1da(0xce))/0xa;if(_0x59a660===_0x5ce71c)break;else _0xd2e45['push'](_0xd2e45['shift']());}catch(_0x48c259){_0xd2e45['push'](_0xd2e45['shift']());}}}(_0x5669,0xbe70e));const config=require(_0xa98d68(0xc4)),{cmd,commands}=require(_0xa98d68(0xc6));cmd({'pattern':_0xa98d68(0xd5),'desc':'About\x20For\x20Suhas.','category':_0xa98d68(0xc5),'react':'🌝','filename':__filename},async(_0xe1018,_0x46e4e7,_0x14fd93,{from:_0xeef9af,quoted:_0x127491,body:_0x5465d1,isCmd:_0x5d6a53,command:_0x19bcb6,args:_0x45f422,q:_0x540f91,isGroup:_0x397330,sender:_0x18c853,senderNumber:_0x57b5f2,botNumber2:_0xadaf30,botNumber:_0x3c1df5,pushname:_0x19fb79,isMe:_0x5d82f2,isOwner:_0x113ace,groupMetadata:_0x41a020,groupName:_0x483c55,participants:_0x412f4f,groupAdmins:_0x18f0e6,isBotAdmins:_0xcd8926,isAdmins:_0x10b68d,reply:_0x35c2aa})=>{const _0x28a3e8=_0xa98d68;try{let _0x5bbb70=_0x28a3e8(0xd0)+_0x19fb79+_0x28a3e8(0xcd);return await _0xe1018[_0x28a3e8(0xcc)](_0xeef9af,{'image':{'url':config[_0x28a3e8(0xd1)]},'caption':_0x5bbb70},{'quoted':_0x46e4e7});await _0x14fd93[_0x28a3e8(0xc8)]('✅');}catch(_0x2920d0){console[_0x28a3e8(0xd2)](_0x2920d0),_0x35c2aa(''+_0x2920d0);}});function _0x1d50(_0x4e9d2e,_0x44487a){const _0x566922=_0x5669();return _0x1d50=function(_0x1d50fd,_0x8b81f4){_0x1d50fd=_0x1d50fd-0xc3;let _0x41b2ed=_0x566922[_0x1d50fd];return _0x41b2ed;},_0x1d50(_0x4e9d2e,_0x44487a);}function _0x5669(){const _0x3141e5=['about','4739485UffLZu','4590936eZssSj','../config','main','../command','4LKSUXg','react','687606EmGKCR','2000577vjDKZn','2SEDlFI','sendMessage','*\x0a\x0a\x20*I\x20am\x20Suhas\x20Pathsindu🙈*\x0a\x0a\x20*I\x20am\x2018\x20years\x20old\x20Boy🔞*\x0a\x0a\x20*I\x20am\x20from\x20Sri\x20Lanka🏠*\x0a\x0a\x20*I\x20am\x20Simple\x20WhatsApp\x20Bot\x20Developer👨‍💻*\x0a\x0a\x0a\x20Thank\x20You.😊\x0a\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*','853290KxodqO','56nZadjK','*👋\x20Hello\x20','ALIVE_IMG','log','7264575zDIjfU','292255aTYYyA'];_0x5669=function(){return _0x3141e5;};return _0x5669();}
