//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











const _0x143d2a=_0x4b3a;function _0x4b3a(_0x931d6f,_0xbcc93b){const _0x210eff=_0x210e();return _0x4b3a=function(_0x4b3ac4,_0x16079a){_0x4b3ac4=_0x4b3ac4-0x161;let _0x20fa6d=_0x210eff[_0x4b3ac4];return _0x20fa6d;},_0x4b3a(_0x931d6f,_0xbcc93b);}(function(_0x1d417e,_0x4b51e1){const _0x26273d=_0x4b3a,_0x216805=_0x1d417e();while(!![]){try{const _0x264cd4=-parseInt(_0x26273d(0x172))/0x1*(parseInt(_0x26273d(0x174))/0x2)+parseInt(_0x26273d(0x165))/0x3*(-parseInt(_0x26273d(0x170))/0x4)+parseInt(_0x26273d(0x16a))/0x5+-parseInt(_0x26273d(0x175))/0x6*(parseInt(_0x26273d(0x161))/0x7)+-parseInt(_0x26273d(0x171))/0x8+parseInt(_0x26273d(0x177))/0x9+-parseInt(_0x26273d(0x167))/0xa*(-parseInt(_0x26273d(0x16b))/0xb);if(_0x264cd4===_0x4b51e1)break;else _0x216805['push'](_0x216805['shift']());}catch(_0x679a23){_0x216805['push'](_0x216805['shift']());}}}(_0x210e,0xdee95));const axios=require(_0x143d2a(0x16d)),{cmd,commands}=require(_0x143d2a(0x16f));function _0x210e(){const _0x1b1814=['dog','639355nkddZE','22mUtZyD','Fetch\x20a\x20random\x20dog\x20image.','axios','log','../command','748804bIbkWi','7108752FIuZbM','2ZwRacy','react','1723210GftkVs','18joqjdb','sendMessage','11311272bbUfwW','1607809pOxOPZ','Error\x20Fetching\x20Dog\x20Image🤕:\x20','message','🐶\x20𝗦𝗨𝗛𝗔𝗦-𝗠𝗗\x20𝗥𝗔𝗡𝗗𝗢𝗠\x20𝗗𝗢𝗚\x20𝗜𝗠𝗔𝗚𝗘𝗦🐶\x0a\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*','21wnMXbS','puppy','20698190pHXkag','https://dog.ceo/api/breeds/image/random'];_0x210e=function(){return _0x1b1814;};return _0x210e();}cmd({'pattern':_0x143d2a(0x169),'alias':[_0x143d2a(0x166)],'desc':_0x143d2a(0x16c),'category':'fun','react':'🐶','filename':__filename},async(_0x3cfb56,_0x27d49a,_0x126766,{from:_0x1e5a5c,quoted:_0x3aa002,body:_0x4bb950,isCmd:_0x100e70,command:_0x35f225,args:_0x3508ca,q:_0x4b6f8a,isGroup:_0x1d7fd0,sender:_0xf258a9,senderNumber:_0x50b781,botNumber2:_0xa2f231,botNumber:_0x450d36,pushname:_0x533d76,isMe:_0x419d2c,isOwner:_0x2afe36,groupMetadata:_0x53dd23,groupName:_0x10747f,participants:_0x8f4d20,groupAdmins:_0x25028a,isBotAdmins:_0x370c49,isAdmins:_0x547da5,reply:_0x2b9dad})=>{const _0x50bc32=_0x143d2a;try{const _0x4553a8=_0x50bc32(0x168),_0x17f873=await axios['get'](_0x4553a8),_0x163e89=_0x17f873['data'];await _0x3cfb56[_0x50bc32(0x176)](_0x1e5a5c,{'image':{'url':_0x163e89[_0x50bc32(0x163)]},'caption':_0x50bc32(0x164)},{'quoted':_0x27d49a}),await _0x126766[_0x50bc32(0x173)]('✅');}catch(_0x2294fd){console[_0x50bc32(0x16e)](_0x2294fd),_0x2b9dad(_0x50bc32(0x162)+_0x2294fd['message']);}});
