//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











function _0xcbff(_0x50b6f3,_0x22e8a6){const _0x4166f0=_0x4166();return _0xcbff=function(_0xcbff2,_0x592893){_0xcbff2=_0xcbff2-0x8d;let _0x4534eb=_0x4166f0[_0xcbff2];return _0x4534eb;},_0xcbff(_0x50b6f3,_0x22e8a6);}const _0x3f7cf4=_0xcbff;function _0x4166(){const _0xae5bdf=['\x0a*🎬SUHAS-MD\x20Movie\x20Search🎬*\x0a\x0a*•ᴛɪᴛʟᴇ:*\x20','Released','317934BpHRFU','Director','245304WzHqHA','message','\x0a*•ᴄᴏᴜɴᴛʀʏ:*\x20','data','http://www.omdbapi.com/?t=','\x0a*•ᴡʀɪᴛᴇʀ:*\x20','Country','join','Language','\x0a*•ᴅɪʀᴇᴄᴛᴏʀ:*\x20','react','\x0a*•ᴀᴄᴛᴏʀꜱ:*\x20','Awards','📽️\x20Please\x20provide\x20the\x20name\x20of\x20the\x20movie.','\x0a*•ᴀᴡᴀʀᴅꜱ:*\x20','Writer','get','138nFgcgM','\x0a*•ɢᴇɴʀᴇ:*\x20','Fetch\x20detailed\x20information\x20about\x20a\x20movie.','\x0a>\x20SUHAS-MD🧚‍♂️','Genre','&apikey=d3963e30','27XmcBKT','\x0a*•ɪᴍᴅʙ\x20ʀᴀᴛɪɴɢ:*\x20','37199682TdHNYY','../config','axios','Poster','1269370OAczpf','❌\x20Error:\x20','error','1554460aALYuh','\x0a*•ʀᴜɴᴛɪᴍᴇ:*\x20','imdbRating','\x0a*•ʏᴇᴀʀ:*\x20','False','sendMessage','282471PWOpzb','3438552kITOTy','utility','ALIVE_IMG','\x0a*•ʟᴀɴɢᴜᴀɢᴇ:*\x20','\x0a*•ʀᴇʟᴇᴀꜱᴇᴅ:*\x20','\x0a*•ʀᴀᴛᴇᴅ:*\x20','Actors','Rated','movie','\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*\x0a','!\x20Movie\x20not\x20found.'];_0x4166=function(){return _0xae5bdf;};return _0x4166();}(function(_0xc805f4,_0x356af9){const _0x5d1a3e=_0xcbff,_0x4c8cc8=_0xc805f4();while(!![]){try{const _0x38e222=parseInt(_0x5d1a3e(0x9b))/0x1+parseInt(_0x5d1a3e(0xaf))/0x2*(parseInt(_0x5d1a3e(0x92))/0x3)+parseInt(_0x5d1a3e(0xa2))/0x4+parseInt(_0x5d1a3e(0x98))/0x5+-parseInt(_0x5d1a3e(0xc2))/0x6*(-parseInt(_0x5d1a3e(0xa1))/0x7)+parseInt(_0x5d1a3e(0xb1))/0x8+-parseInt(_0x5d1a3e(0x94))/0x9;if(_0x38e222===_0x356af9)break;else _0x4c8cc8['push'](_0x4c8cc8['shift']());}catch(_0x4dea55){_0x4c8cc8['push'](_0x4c8cc8['shift']());}}}(_0x4166,0xe19ff));const axios=require(_0x3f7cf4(0x96)),{cmd}=require('../command'),config=require(_0x3f7cf4(0x95));cmd({'pattern':_0x3f7cf4(0xaa),'desc':_0x3f7cf4(0x8e),'category':_0x3f7cf4(0xa3),'react':'🎬','filename':__filename},async(_0x2a56e3,_0x3e8b3b,_0x3b35b3,{from:_0x7c65b4,quoted:_0x1c857c,body:_0x403c74,isCmd:_0x327834,command:_0xd228b4,args:_0x5580aa,q:_0x53cf52,isGroup:_0xf7c823,sender:_0xa74564,senderNumber:_0x5d049f,botNumber2:_0x42087b,botNumber:_0x580d60,pushname:_0x303fa6,isMe:_0x675bc9,isOwner:_0x2cd5dc,groupMetadata:_0x134ab9,groupName:_0x1834ea,participants:_0xb16c6,groupAdmins:_0x4b1ee9,isBotAdmins:_0x3c19e3,isAdmins:_0x21ba0b,reply:_0xa621b4})=>{const _0x5d59a8=_0x3f7cf4;try{const _0x140f4b=_0x5580aa[_0x5d59a8(0xb8)]('\x20');if(!_0x140f4b)return _0xa621b4(_0x5d59a8(0xbe));const _0x473700=_0x5d59a8(0xb5)+encodeURIComponent(_0x140f4b)+_0x5d59a8(0x91),_0x4bd790=await axios[_0x5d59a8(0xc1)](_0x473700),_0x1cb988=_0x4bd790[_0x5d59a8(0xb4)];if(_0x1cb988['Response']===_0x5d59a8(0x9f))return _0xa621b4(_0x5d59a8(0xac));const _0xb1b8b8=_0x5d59a8(0xad)+_0x1cb988['Title']+_0x5d59a8(0x9e)+_0x1cb988['Year']+_0x5d59a8(0xa7)+_0x1cb988[_0x5d59a8(0xa9)]+_0x5d59a8(0xa6)+_0x1cb988[_0x5d59a8(0xae)]+_0x5d59a8(0x9c)+_0x1cb988['Runtime']+_0x5d59a8(0x8d)+_0x1cb988[_0x5d59a8(0x90)]+_0x5d59a8(0xba)+_0x1cb988[_0x5d59a8(0xb0)]+_0x5d59a8(0xb6)+_0x1cb988[_0x5d59a8(0xc0)]+_0x5d59a8(0xbc)+_0x1cb988[_0x5d59a8(0xa8)]+_0x5d59a8(0xa5)+_0x1cb988[_0x5d59a8(0xb9)]+_0x5d59a8(0xb3)+_0x1cb988[_0x5d59a8(0xb7)]+_0x5d59a8(0xbf)+_0x1cb988[_0x5d59a8(0xbd)]+_0x5d59a8(0x93)+_0x1cb988[_0x5d59a8(0x9d)]+_0x5d59a8(0xab),_0x2416d9=_0x1cb988[_0x5d59a8(0x97)]&&_0x1cb988[_0x5d59a8(0x97)]!=='N/A'?_0x1cb988[_0x5d59a8(0x97)]:config[_0x5d59a8(0xa4)];await _0x2a56e3[_0x5d59a8(0xa0)](_0x7c65b4,{'image':{'url':_0x2416d9},'caption':_0xb1b8b8+_0x5d59a8(0x8f)},{'quoted':_0x3e8b3b}),await _0x3b35b3[_0x5d59a8(0xbb)]('✅');}catch(_0x41f99a){console[_0x5d59a8(0x9a)](_0x41f99a),_0xa621b4(_0x5d59a8(0x99)+_0x41f99a[_0x5d59a8(0xb2)]);}});
