//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











const _0x3fd448=_0x534e;function _0x534e(_0x451eb7,_0x5a50a2){const _0x3c60f0=_0x3c60();return _0x534e=function(_0x534eb2,_0x52be60){_0x534eb2=_0x534eb2-0x1a3;let _0x4d9896=_0x3c60f0[_0x534eb2];return _0x4d9896;},_0x534e(_0x451eb7,_0x5a50a2);}(function(_0x4a9cac,_0x52ce95){const _0xe05845=_0x534e,_0x5dc658=_0x4a9cac();while(!![]){try{const _0x5f0b1c=-parseInt(_0xe05845(0x1a5))/0x1*(-parseInt(_0xe05845(0x1b5))/0x2)+-parseInt(_0xe05845(0x1b4))/0x3*(parseInt(_0xe05845(0x1b3))/0x4)+parseInt(_0xe05845(0x1a3))/0x5+-parseInt(_0xe05845(0x1ac))/0x6*(-parseInt(_0xe05845(0x1a6))/0x7)+-parseInt(_0xe05845(0x1a9))/0x8+parseInt(_0xe05845(0x1ae))/0x9+-parseInt(_0xe05845(0x1a4))/0xa*(parseInt(_0xe05845(0x1b1))/0xb);if(_0x5f0b1c===_0x52ce95)break;else _0x5dc658['push'](_0x5dc658['shift']());}catch(_0x7e6810){_0x5dc658['push'](_0x5dc658['shift']());}}}(_0x3c60,0xa233d));function _0x3c60(){const _0xe4a85f=['👋\x20𝗛𝗶\x20','1928YdILlD','1149EOhUsf','568GSiSQU','\x0a\x0a\x20♡\x20_♫__♡\x0a║║╔║║╔╗\x20♫\x0a╠╣╠║║║║\x0a║║╚╚╚╚╝\x20♫\x20\x20\x0a\x0a*🧚‍♂️𝙸\x20𝚊𝚖\x20𝙰𝚕𝚒𝚟𝚎\x20𝙽𝚘𝚠.🧚‍♂️*\x0a\x0a🧚‍♂️𝙄\x20𝘼𝙢\x20𝙎𝙪𝙝𝙖𝙨\x20𝙋𝙖𝙩𝙝𝙨𝙞𝙣𝙙𝙪.\x0a🧚‍♂️𝙎𝙐𝙃𝘼𝙎-𝙈𝘿\x20𝙒𝙝𝙖𝙩𝙨𝘼𝙥𝙥\x20𝘽𝙤𝙩\x20𝙊𝙬𝙣𝙚𝙧\x0a🧚‍♂️𝙎𝙪𝙗𝙨𝙘𝙧𝙞𝙗𝙚\x20𝙈𝙚\x20𝙤𝙣\x20𝙔𝙤𝙪𝙩𝙪𝙗𝙚\x20𝙁𝙤𝙧\x20𝙈𝙤𝙧𝙚\x20𝙄𝙣𝙛𝙤𝙧𝙢𝙖𝙩𝙞𝙤𝙣𝙨...\x0a\x0a*⚡ʏᴏᴜᴛᴜʙᴇ*\x20-:\x20https://youtube.com/@suhasbro\x0a*⚡ᴡʜᴀᴛꜱᴀᴘᴘ\x20ᴄʜᴀɴɴᴇʟ*\x20-:\x20https://whatsapp.com/channel/0029VagKNUe96H4IdMbr9f2o\x0a\x0a‎╮╰╮╮▕╲╰╮╭╯╱▏╭╭╭╭\x0a╰╰╮╰╭╱▔▔▔▔╲╮╯╭╯\x0a┏━┓┏┫╭▅╲╱▅╮┣┓╭║║║\x0a╰┳╯╰┫┗━╭╮━┛┣╯╯╚╬╝\x0a╭┻╮╱╰╮╰━━╯╭╯╲┊\x20\x20\x20║\x0a╰┳┫▔╲╰┳━━┳╯╱▔┊\x20\x20\x20║\x0a┈┃╰━━╲▕╲╱▏╱━━━┬╨╮\x0a┈╰━━╮┊▕╱╲▏┊╭━━┴╥╯\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*\x0a','alive','3057200UkJDrr','4190wuoCbn','2083NXoplV','5190353tHrdsA','https://telegra.ph/file/4a8fe45cb863594e1f1c1.jpg','log','2928776CcXdLs','sendMessage','main','6ksYqNo','../command','8994483jjKShj','react','online\x20the\x20bot','45386QBJAJH'];_0x3c60=function(){return _0xe4a85f;};return _0x3c60();}const {cmd,commands}=require(_0x3fd448(0x1ad));cmd({'pattern':_0x3fd448(0x1b7),'desc':_0x3fd448(0x1b0),'category':_0x3fd448(0x1ab),'react':'🌟','filename':__filename},async(_0x1dc725,_0x13b814,_0x43ff06,{from:_0x37c329,quoted:_0x4251f0,body:_0x114a49,isCmd:_0x17a3d9,command:_0xcbadbe,args:_0x311bbf,q:_0x54534e,isGroup:_0x3ea6ee,sender:_0x16df32,senderNumber:_0x68fc7e,botNumber2:_0x1df284,botNumber:_0x4d6e47,pushname:_0x12e20a,isMe:_0x30d1ba,isOwner:_0x15701c,groupMetadata:_0x134a93,groupName:_0x396c38,participants:_0x785d3,groupAdmins:_0x3a5b15,isBotAdmins:_0x1df342,isAdmins:_0x4c5836,reply:_0x5b00fc})=>{const _0xf561ff=_0x3fd448;try{let _0x3dca95=_0xf561ff(0x1b2)+_0x12e20a+_0xf561ff(0x1b6);await _0x1dc725[_0xf561ff(0x1aa)](_0x37c329,{'image':{'url':_0xf561ff(0x1a7)},'caption':_0x3dca95},{'quoted':_0x13b814}),await _0x43ff06[_0xf561ff(0x1af)]('✅');}catch(_0x353db0){console[_0xf561ff(0x1a8)](_0x353db0),_0x5b00fc(''+_0x353db0);}});
