//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ










const _0x11eea3=_0x2035;(function(_0x548ea8,_0x57f53c){const _0x44c12c=_0x2035,_0x222fc1=_0x548ea8();while(!![]){try{const _0x4770c6=-parseInt(_0x44c12c(0x90))/0x1*(-parseInt(_0x44c12c(0x93))/0x2)+-parseInt(_0x44c12c(0x88))/0x3*(parseInt(_0x44c12c(0x89))/0x4)+parseInt(_0x44c12c(0x94))/0x5+-parseInt(_0x44c12c(0x92))/0x6+parseInt(_0x44c12c(0x8e))/0x7+parseInt(_0x44c12c(0x8b))/0x8+-parseInt(_0x44c12c(0x8d))/0x9*(parseInt(_0x44c12c(0x8f))/0xa);if(_0x4770c6===_0x57f53c)break;else _0x222fc1['push'](_0x222fc1['shift']());}catch(_0x2bdf5e){_0x222fc1['push'](_0x222fc1['shift']());}}}(_0x3fbf,0x4d5bf));function _0x2035(_0xe30fce,_0x5708f9){const _0x3fbf62=_0x3fbf();return _0x2035=function(_0x2035a3,_0x45e814){_0x2035a3=_0x2035a3-0x86;let _0x2ca65d=_0x3fbf62[_0x2035a3];return _0x2ca65d;},_0x2035(_0xe30fce,_0x5708f9);}const config=require('../config'),{cmd,commands}=require(_0x11eea3(0x8a)),{fetchJson}=require('../lib/functions'),fs=require('fs');cmd({'pattern':_0x11eea3(0x87),'desc':_0x11eea3(0x91),'category':'owner','react':'🤖','filename':__filename},async(_0x983a0a,_0x2de03a,_0x2bee08,{from:_0x1391d8,isOwner:_0x136d47,reply:_0x476831})=>{const _0x497392=_0x11eea3;if(!_0x136d47)return _0x476831(_0x497392(0x95));const _0x647af6=_0x983a0a[_0x497392(0x8c)]?_0x983a0a[_0x497392(0x8c)]['id']:_0x983a0a['info'][_0x497392(0x86)];_0x476831(_0x497392(0x96)+_0x647af6);});function _0x3fbf(){const _0x575b6f=['2008128HUGhnY','user','1364859RWqDTM','1526798IVAlcf','10WoICZL','39821wfDACx','Get\x20the\x20bot\x27s\x20JID.','1639476WhDYoI','10xPUYLh','1811940SFcMua','❌\x20You\x20are\x20not\x20the\x20owner!','🤖\x20*Bot\x20JID:*\x20','wid','jid','453zkLdkn','7652WiKIGZ','../command'];_0x3fbf=function(){return _0x575b6f;};return _0x3fbf();}
