//  ░██████╗██╗░░░██╗██╗░░██╗░█████╗░░██████╗    ███╗░░░███╗██████╗░    ██╗░░░██╗░█████╗░
//  ██╔════╝██║░░░██║██║░░██║██╔══██╗██╔════╝    ████╗░████║██╔══██╗    ██║░░░██║██╔══██╗
//  ╚█████╗░██║░░░██║███████║███████║╚█████╗░    ██╔████╔██║██║░░██║    ╚██╗░██╔╝╚█████╔╝
//  ░╚═══██╗██║░░░██║██╔══██║██╔══██║░╚═══██╗    ██║╚██╔╝██║██║░░██║    ░╚████╔╝░██╔══██╗
//  ██████╔╝╚██████╔╝██║░░██║██║░░██║██████╔╝    ██║░╚═╝░██║██████╔╝    ░░╚██╔╝░░╚█████╔╝
//  ╚═════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░    ╚═╝░░░░░╚═╝╚═════╝░    ░░░╚═╝░░░░╚════╝░

//  ░██╗░░░░░░░██╗██╗░░██╗░█████╗░████████╗░██████╗░█████╗░██████╗░██████╗░    ██████╗░░█████╗░████████╗
//  ░██║░░██╗░░██║██║░░██║██╔══██╗╚══██╔══╝██╔════╝██╔══██╗██╔══██╗██╔══██╗    ██╔══██╗██╔══██╗╚══██╔══╝
//  ░╚██╗████╗██╔╝███████║███████║░░░██║░░░╚█████╗░███████║██████╔╝██████╔╝    ██████╦╝██║░░██║░░░██║░░░
//  ░░████╔═████║░██╔══██║██╔══██║░░░██║░░░░╚═══██╗██╔══██║██╔═══╝░██╔═══╝░    ██╔══██╗██║░░██║░░░██║░░░
//  ░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░    ██████╦╝╚█████╔╝░░░██║░░░
//  ░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░    ╚═════╝░░╚════╝░░░░╚═╝░░░



// * Project name - SUHAS- MD 
// * Author - Suhas Pathsindu
// * Team - Suhas Bro 
// * Version - V2

// World best and powerfull whatsapp user bot in Sri lanka
// 🧬©ꜱᴜʜᴀꜱ-ᴍᴅ ʙʏ ꜱᴜᴀʜꜱ ᴘᴀᴛʜꜱɪɴᴅᴜッ











const _0xe75fd=_0x15dc;(function(_0x36722e,_0x14a16d){const _0x46bf94=_0x15dc,_0x5c8bd1=_0x36722e();while(!![]){try{const _0x33e6fb=parseInt(_0x46bf94(0x16f))/0x1+-parseInt(_0x46bf94(0x175))/0x2*(-parseInt(_0x46bf94(0x178))/0x3)+-parseInt(_0x46bf94(0x186))/0x4*(-parseInt(_0x46bf94(0x16b))/0x5)+-parseInt(_0x46bf94(0x177))/0x6+-parseInt(_0x46bf94(0x16e))/0x7+-parseInt(_0x46bf94(0x18a))/0x8+parseInt(_0x46bf94(0x18c))/0x9;if(_0x33e6fb===_0x14a16d)break;else _0x5c8bd1['push'](_0x5c8bd1['shift']());}catch(_0x2bac95){_0x5c8bd1['push'](_0x5c8bd1['shift']());}}}(_0x2d56,0xa11bd));const {cmd}=require(_0xe75fd(0x179)),yts=require(_0xe75fd(0x16d));function _0x15dc(_0x22b213,_0x3ac941){const _0x2d567d=_0x2d56();return _0x15dc=function(_0x15dcf6,_0x5c2347){_0x15dcf6=_0x15dcf6-0x16a;let _0x4218d1=_0x2d567d[_0x15dcf6];return _0x4218d1;},_0x15dc(_0x22b213,_0x3ac941);}function _0x2d56(){const _0x1548e6=['To\x20watch,\x20click\x20on\x20the\x20video\x20link\x20or\x20use\x20the\x20command:\x0a','*YouTube\x20Search\x20Results:*\x0a\x0a','toString','8DoJtum','ago','1311096DbNwqS','604167qFBNLw','../command','name','timestamp','url','toFixed','join','Please\x20provide\x20a\x20search\x20query\x20!','title','author','duration','\x20\x20\x20Channel:\x20','forEach','yts','332WFsrSX','❌\x20An\x20error\x20occurred\x20while\x20searching\x20YouTube.\x20Please\x20try\x20again\x20later.','\x20\x20\x20Uploaded:\x20','\x20\x20\x20Views:\x20','6465720RidLcf','youtubesearch','1997307YTdqdZ','\x20\x20\x20Duration:\x20','.\x20*','<search\x20query>','26735NXHjob','Search\x20for\x20YouTube\x20videos','yt-search','5788608dVEIIT','1042296XaufdS','\x0a\x0a\x0a>\x20*©\x20𝙿𝚘𝚠𝚎𝚛𝚍\x20𝙱𝚢\x20🧚‍♂️⃝𝚂𝚄𝙷𝙰𝚂-𝙼𝙳\x20𝚅8\x20💕⃟*','Error\x20in\x20YouTube\x20search:'];_0x2d56=function(){return _0x1548e6;};return _0x2d56();}cmd({'pattern':_0xe75fd(0x185),'alias':[_0xe75fd(0x18b),'ytsearch'],'desc':_0xe75fd(0x16c),'category':'search','react':'🔍','filename':__filename,'use':_0xe75fd(0x16a)},async(_0x5e5761,_0x399518,_0x5687ea,{from:_0x193049,args:_0xeaa9be,reply:_0xe9140f})=>{const _0x1b35d7=_0xe75fd;if(!_0xeaa9be[0x0])return _0xe9140f(_0x1b35d7(0x17f));const _0x4116c6=_0xeaa9be[_0x1b35d7(0x17e)]('\x20');try{const _0x36ffec=await yts(_0x4116c6);if(!_0x36ffec['videos']['length'])return _0xe9140f('No\x20videos\x20found\x20for\x20the\x20given\x20query.');let _0x4a0d22=_0x1b35d7(0x173);_0x36ffec['videos']['slice'](0x0,0x14)[_0x1b35d7(0x184)]((_0x1aff63,_0x47a41b)=>{const _0x4d7a9c=_0x1b35d7;_0x4a0d22+=_0x47a41b+0x1+_0x4d7a9c(0x18e)+_0x1aff63[_0x4d7a9c(0x180)]+'*\x0a',_0x4a0d22+=_0x4d7a9c(0x183)+_0x1aff63[_0x4d7a9c(0x181)][_0x4d7a9c(0x17a)]+'\x0a',_0x4a0d22+=_0x4d7a9c(0x18d)+_0x1aff63[_0x4d7a9c(0x182)][_0x4d7a9c(0x17b)]+'\x0a',_0x4a0d22+=_0x4d7a9c(0x189)+formatNumber(_0x1aff63['views'])+'\x0a',_0x4a0d22+=_0x4d7a9c(0x188)+_0x1aff63[_0x4d7a9c(0x176)]+'\x0a',_0x4a0d22+='\x20\x20\x20Link:\x20'+_0x1aff63[_0x4d7a9c(0x17c)]+_0x4d7a9c(0x170);}),_0x4a0d22+='\x0aShowing\x20top\x2020\x20results\x20for\x20\x22'+_0x4116c6+'\x22\x0a',_0x4a0d22+=_0x1b35d7(0x172),await _0x5e5761['sendMessage'](_0x193049,{'text':_0x4a0d22},{'quoted':_0x399518});}catch(_0x4a3bcb){console['error'](_0x1b35d7(0x171),_0x4a3bcb),_0xe9140f(_0x1b35d7(0x187));}});function formatNumber(_0x242a56){const _0x475c98=_0xe75fd;if(_0x242a56>=0xf4240)return(_0x242a56/0xf4240)['toFixed'](0x1)+'M';else{if(_0x242a56>=0x3e8)return(_0x242a56/0x3e8)[_0x475c98(0x17d)](0x1)+'K';}return _0x242a56[_0x475c98(0x174)]();}
